{"name":"Pandapaxxy's Controller rolls - Season 17","description":"Recommendations based on Pandapaxxy's breakdowns on r/sharditorkeepit for Controller on Season 17 weapons.","data":[{"hash":3055790362,"plugs":[[1840239774,1482024992,4090651448],[679225683,1087426260,2420895100],[1168162263,3400784728,671806388,1347741687,573122728,595108252],[3425386926,3523296417,4104185692,288411554,1906147653,3007133316]],"tags":["PVE"],"description":"The Eyasluna copy is back. After Eyasluna returned. The history of this gun is very...odd. But Austringer is here and it trades blows with Eyasluna very well. Each has their own benefits. I think Eyaslunas beats out Austringer in PvE. Being stasis and having headstone as a possible roll gives more utility than almost anything Austringer can offer. There's the tried and true rampage / outlaw combo. Or you could invest into grenade builds or frenzy builds. Whatever you desire.\n\nIn the Crucible is where Austringer has a lot more footing. You can either go for Eyasluna with rangefinder and moving target for max aim assist and incredible range. Or Austringer with eye of the storm and rangefinder for better aim assist at low health. Neither one is objectively better than the other, but how you play will determine which hand cannon is better for you. Having enhanced perks is a definite favor for Austringer, but it does not make Austringer blow Eyasluna right out of the water."},{"hash":3055790362,"plugs":[[1840239774],[679225683],[1168162263,1347741687],[3425386926,288411554]],"tags":["GodPVE"]},{"hash":3055790362,"plugs":[[1840239774,3250034553,1482024992],[1885400500,1561002382],[699525795,957782887,3722653512,3719974635,4116820839,2898218424],[2846385770,47981717,3523296417,509594246,1370847713,1906147653]],"tags":["PVP"]},{"hash":3055790362,"plugs":[[1840239774],[1885400500],[699525795,3719974635],[2846385770,509594246]],"tags":["GodPVP"]},{"hash":3107853529,"plugs":[[1840239774,839105230],[679225683,1087426260,2420895100],[1354429876,2866798147,848860060,3974407819],[2551157718,23371658]],"tags":["PVE"],"description":"Anyone else have a Beloved sitting in their vault with a couple hundred kills on it? Same. I'm not really happy with Beloved returning, but it's here so we might as well enjoy it. Unfortunately for Beloved's PvE presence, the best fourth column perk is box breathing. It's not the worst perk for a sniper, but is severely outclassed by more PvE dedicated snipers.\n\nBeloved was made for the crucible. It has been a while since its heyday, but it will happily come out of retirement for another swing at the best PvP sniper in Destiny 2's history. Instead of going all into range like previously, the recent sandbox changes have made handling more important than ever. Both quickdraw and snapshot are still incredible on Beloved, but now you can go for surplus, moving target, or firmly planted and still have a smashing good time."},{"hash":3107853529,"plugs":[[1840239774],[679225683],[1354429876,848860060],[2551157718,23371658]],"tags":["GodPVE"]},{"hash":3107853529,"plugs":[[1840239774],[1561002382,1885400500],[957782887,3436462433,280464955,4116820839,2658083589,3920370755],[706527188,588594999,1961144892,2717805783]],"tags":["PVP"]},{"hash":3107853529,"plugs":[[1840239774],[1561002382],[957782887,4116820839],[706527188,1961144892]],"tags":["GodPVP"]},{"hash":1959650777,"plugs":[[3525010810,1441682018,3798852852],[3796465595],[3300816228,2869569095,3523296417,3528046508,2308090567,1906147653],[4104185692,2978966579,2396489472,3007133316,344235611,598607952]],"tags":["PVE"],"description":"We got ourselves a rocket. A rocket with a low blast radius, even for its frame, just feels bad. Bump in the Night isn't something special to look forward to. It does look cool, I'll give it that. Overall there's better options for auto-loading holster rockets, or frenzy rockets.\n\nIn PvP Bump in the Night is also outclassed. Having access to both demolitionist for more grenades and chain reaction for potential multi-kills is cool, but the low velocity and lower blast radius really hold it back."},{"hash":1959650777,"plugs":[[3525010810],[3796465595],[3300816228,3528046508],[4104185692,3007133316]],"tags":["GodPVE"]},{"hash":1959650777,"plugs":[[1478423395,1441682018,3525010810],[1996142143,2822142346],[3523296417,3977735242,1906147653,406461158],[2396489472,2978966579,598607952,344235611]],"tags":["PVP"]},{"hash":1959650777,"plugs":[[1478423395],[1996142143],[3523296417,1906147653],[2396489472,598607952]],"tags":["GodPVP"]},{"hash":933455006,"plugs":[[839105230,1840239774],[689005463,2680121939,1483536627],[1428297954,744594675],[1546637391,438098033,2978966579]],"tags":["PVE"],"description":"Burden of Guilt is the new Trials of Saint-14 Osiris fusion. This now makes the third (or second) stasis fusion rifle. I am all for loadout flexibility and adding stasis fusions is a great way to do that. Adaptive frames have almost always been in the shadow of precisions and they are always grouped into the same \"frame\" changes. For PvE, similar to other fusions, vorpal weapon is the best in slot perk to look for. Perpetual motion is the best reload perk, which you will need with the low 31 reload stat.\n\nFor PvP is where I think Burden of Guilt will be able to really show its metaphorical stuff. Having both elemental capacitor to max out handling, or stability, or increase your strafe speed; and high-impact reserves to make the damage profile similar to precisions is incredibly strong."},{"hash":933455006,"plugs":[[839105230],[689005463],[1428297954],[1546637391]],"tags":["GodPVE"]},{"hash":933455006,"plugs":[[839105230],[3868766766],[3511092054,744594675,1428297954],[2213355989,2652708987]],"tags":["PVP"]},{"hash":933455006,"plugs":[[839105230],[3868766766],[3511092054],[2213355989]],"tags":["GodPVP"]},{"hash":2002522739,"plugs":[[839105230,1840239774],[689005463,2680121939,1483536627],[1428297954,744594675],[1546637391,438098033,2978966579]],"tags":["PVE"],"description":"Burden of Guilt is the new Trials of Saint-14 Osiris fusion. This now makes the third (or second) stasis fusion rifle. I am all for loadout flexibility and adding stasis fusions is a great way to do that. Adaptive frames have almost always been in the shadow of precisions and they are always grouped into the same \"frame\" changes. For PvE, similar to other fusions, vorpal weapon is the best in slot perk to look for. Perpetual motion is the best reload perk, which you will need with the low 31 reload stat.\n\nFor PvP is where I think Burden of Guilt will be able to really show its metaphorical stuff. Having both elemental capacitor to max out handling, or stability, or increase your strafe speed; and high-impact reserves to make the damage profile similar to precisions is incredibly strong."},{"hash":2002522739,"plugs":[[839105230],[689005463],[1428297954],[1546637391]],"tags":["GodPVE"]},{"hash":2002522739,"plugs":[[839105230],[3868766766],[3511092054,744594675,1428297954],[2213355989,2652708987]],"tags":["PVP"]},{"hash":2002522739,"plugs":[[839105230],[3868766766],[3511092054],[2213355989]],"tags":["GodPVP"]},{"hash":2490988246,"plugs":[[1840239774,1482024992,4090651448],[106909392,1087426260,2420895100],[3108830275,1631667848,855168139,402033656],[2779035018,1683379515,4293542123,1171147302,2216471363,2675184851]],"tags":["PVE"],"description":"So, truthfully I was not really impressed with CALUS Mini-Tool on first glance. After running Duality with one, I can confidently say I was wrong. Solar 3.0 paired with the CALUS Mini-Tool is a dream. It's not the most ideal choice without its pairing, but it still puts in some exceptional work. With Solar 3.0's healing wells, and unrelenting, you might never die. Incandescent is an incredible perk to keep synergy with Solar 3.0, definitely a roll to keep an eye out for.\n\nCALUS Mini-Tool does not stand as strong in PvP as other possible smgs. The 14 zoom and lack of rangefinder or other heavy range increasing perks makes it fall off in terms of usefulness. It can be usable when paired with MIDA Multi-Tool. MIDA covering the longer ranges and CALUS covering the tight CQC rolls. Not necessarily the most lethal combination, but it works."},{"hash":2490988246,"plugs":[[1840239774],[106909392],[3108830275,855168139],[2779035018,1171147302]],"tags":["GodPVE"]},{"hash":2490988246,"plugs":[[1840239774,1482024992,3250034553],[3142289711],[4071163871,588594999,494941759,2717805783],[699525795,1890422124,3719974635,1523649716]],"tags":["PVP"]},{"hash":2490988246,"plugs":[[1840239774],[3142289711],[4071163871,494941759],[699525795,3719974635]],"tags":["GodPVP"]},{"hash":3105930175,"plugs":[[839105230],[1561002382],[11612903,2997472817],[3523296417,1048183818]],"tags":["PVE"],"description":"So the newest ritual weapon is a stasis machine gun. The unique factor is Osmosis to change its damage type from stasis to whatever subclass you happen to be on. A real jack of all trades. Unfortunately it is the true master of one. Having both adrenaline junkie and demolitionist really elevate it with grenade builds on Void 3.0 or some Solar 3.0 builds, but I would rather have either a dedicated \"big-deeps\" machine gun or an add clear machine gun with firefly or dragonfly. I don't really find myself using machine guns for add clearing, but having a very reliable weapon for grenade builds is never a bad option. I think it would pair best with Void 3.0 and lead from gold builds.\n\nFor PvP there aren't too many times a neutral machine gun is a top choice. It is definitely reliable and that 6/10 Bungie hopes for. I would just stay away from Chain of Command for PvP. You're better off using something else."},{"hash":3105930175,"plugs":[[839105230],[1561002382],[11612903],[3523296417]],"tags":["GodPVE"]},{"hash":3105930175,"plugs":[[839105230],[1561002382],[11612903],[3523296417]],"tags":["PVP"]},{"hash":3105930175,"plugs":[[839105230],[1561002382],[11612903],[3523296417]],"tags":["GodPVP"]},{"hash":575830664,"plugs":[[1840239774,1482024992],[106909392,1087426260,2420895100],[1168162263,1428297954,3400784728],[3425386926,1546637391,1954620775]],"tags":["PVE"],"description":"While I am very glad D.F.A. (DFA) is reissued to have random rolls, it shipped super underwhelming. DFA has a lot of competition in its slot. From the hugely popular Fatebringer to the fan favorite Dire Promise, from the OG Eyasluna to OG Austringer. Not even including the exotic kinetic hand cannons, DFA has a high hill to climb. The benefit DFA has over some of the other weapons is the possibility of getting adept rolls for the bonus masterworks and adept mods. This doesn't entirely cover the fact that DFA's perk pool just shipped underwhelming. Outlaw and rampage are tried and true but extremely boring. Vorpal weapon is great and makes DFA the first kinetic 140 with vorpal, but that alone doesn't bring it up past some of the aforementioned powerhouses.\n\nFor PvP you're just better off using any other hand cannon. Fragile focus adds a good 2-3m of range without taking damage, but is unrealistic to keep up in 6s. In 3s it can be obtainable but is also hard to keep up once you start shooting. Perpetual motion is the best for adding stability and handling, two stats DFA does need. Opening shot coupled with fragile focus could make for some deep clean ups but the fall off of both will be very harsh."},{"hash":575830664,"plugs":[[1840239774],[106909392],[1168162263],[3425386926]],"tags":["GodPVE"]},{"hash":575830664,"plugs":[[1840239774,1482024992,3250034553],[3142289711],[1428297954,2451262963,509074078],[47981717,1954620775]],"tags":["PVP"]},{"hash":575830664,"plugs":[[1840239774],[3142289711],[1428297954],[47981717]],"tags":["GodPVP"]},{"hash":2006308129,"plugs":[[1840239774,1482024992],[106909392,1087426260,2420895100],[1168162263,1428297954,3400784728],[3425386926,1546637391,1954620775]],"tags":["PVE"],"description":"While I am very glad D.F.A. (DFA) is reissued to have random rolls, it shipped super underwhelming. DFA has a lot of competition in its slot. From the hugely popular Fatebringer to the fan favorite Dire Promise, from the OG Eyasluna to OG Austringer. Not even including the exotic kinetic hand cannons, DFA has a high hill to climb. The benefit DFA has over some of the other weapons is the possibility of getting adept rolls for the bonus masterworks and adept mods. This doesn't entirely cover the fact that DFA's perk pool just shipped underwhelming. Outlaw and rampage are tried and true but extremely boring. Vorpal weapon is great and makes DFA the first kinetic 140 with vorpal, but that alone doesn't bring it up past some of the aforementioned powerhouses.\n\nFor PvP you're just better off using any other hand cannon. Fragile focus adds a good 2-3m of range without taking damage, but is unrealistic to keep up in 6s. In 3s it can be obtainable but is also hard to keep up once you start shooting. Perpetual motion is the best for adding stability and handling, two stats DFA does need. Opening shot coupled with fragile focus could make for some deep clean ups but the fall off of both will be very harsh."},{"hash":2006308129,"plugs":[[1840239774],[106909392],[1168162263],[3425386926]],"tags":["GodPVE"]},{"hash":2006308129,"plugs":[[1840239774,1482024992,3250034553],[3142289711],[1428297954,2451262963,509074078],[47981717,1954620775]],"tags":["PVP"]},{"hash":2006308129,"plugs":[[1840239774],[3142289711],[1428297954],[47981717]],"tags":["GodPVP"]},{"hash":3738678140,"plugs":[[1300023272,4090651448,1482024992],[106909392,1087426260,2420895100],[1631667848,1820235745,3300816228],[2679249093,4082225868,11612903]],"tags":["PVE"],"description":"Gambit is a dead weight. Wait. That's not entirely true. The Gambit focus weapon this season is called Dead Weight. Rapid-fire shotguns have always been my favorite for one-two punch builds. One-two punch doesn't really rely on the damage from the shotgun as your melee is then increased by 200% (80% with Liar's Handshake). So you don't really have to invest as heavily into any one stat. Range is negligible as you will be barrel stuffing a boss to be within melee range. Stability doesn't really matter on shotguns in general. Handling does help to make follow up shots a little faster. And with grave robber you can completely ignore the reload stat. Any mag boosting perk brings you right to the magazine cap of 8. So really any other perks just benefit the shotgun to make it feel better. If you dislike one-two punch (how dare you) there's plenty of other alternative combinations like swashbuckler and subsistence for keeping the damage going, or subsistence and adrenaline junkie for grenade focused builds. If you prefer a more pocket shotgun feel then auto-loading holster is the best in slot.\n\nRapid-fire shotguns do not fare so well in PvP compared to PvE. Full choke is still mandatory to secure the best possibility for a two-tap kill. Accurized rounds pushes out the fall off so you'd still be able to do that solid 1 damage at 3m and beyond. Perpetual motion brings up the already healthy handling. Where Dead Weight falls off hard is in the final column. Not having access to some of the top tier perks like opening shot or even elemental capacitor to max out the range adds to the downfall of this shotgun. Just don't use rapid-fire shotguns in PvP."},{"hash":3738678140,"plugs":[[1300023272],[106909392],[1631667848],[2679249093]],"tags":["GodPVE"]},{"hash":3738678140,"plugs":[[1047830412,1300023272],[3142289711,679225683],[1428297954,3436462433],[3523296417,11612903,4082225868]],"tags":["PVP"]},{"hash":3738678140,"plugs":[[1047830412],[3142289711],[1428297954],[3523296417]],"tags":["GodPVP"]},{"hash":502356570,"plugs":[[1840239774,1482024992],[106909392,1087426260,2420895100],[744594675,3592538738,2139363611,2675361166],[3425386926,4082225868,4293542123,288411554,1161469972,2675184851]],"tags":["PVE"],"description":"Drang (Baroque) is hot right now. It's always been one of the better sidearms at base, and having a randomly rolled version is welcome. Well-rounded paired with your choice of rampage, or incandescent is probably going to be your best bet. Swashbuckler and wellspring together is also another good combination.\n\nSturm and Drang are the other duo pairing. Sturm fell off after the 120 nerf, but Drang and the Baroque version are both incredibly strong. The in-air accuracy nerf hurt all weapons, but I think sidearms were one weapon type that got hit the hardest. Having better in-air accuracy at base is rather nice, but the lack of air assault and across the board air penalties hurts sidearm play. I think swashbuckler is the best option for the last column as melee kills in cqc are common and going into the next fight with a large damage boost will make your sidearm hit like a hand cannon."},{"hash":502356570,"plugs":[[1840239774],[106909392],[744594675,2139363611],[3425386926,288411554]],"tags":["GodPVE"]},{"hash":502356570,"plugs":[[3250034553,1482024992,1467527085],[3142289711],[588594999,699525795,2717805783,3719974635],[4082225868,3425386926,1161469972,288411554]],"tags":["PVP"]},{"hash":502356570,"plugs":[[3250034553],[3142289711],[588594999,2717805783],[4082225868,1161469972]],"tags":["GodPVP"]},{"hash":1601177201,"plugs":[[1840239774,1482024992,4090651448],[106909392,1087426260,2420895100],[2779035018,2946784966],[3708227201,2458213969,3425386926]],"tags":["PVE"],"description":"Precision frame smgs struggle in PvE content. Both of the 900 rpm smgs just pump out damage faster, and aggressive frames hit like a truck while still maintaining a lot of that spray. Precision frames have the best base range for all smgs but comically low handling, reload, and stability. All three of which are important in PvE activities. Reload especially. Enyo-D comes equipped with feeding frenzy to circumvent the low reload, and fluted barrel will bump up that low handling. I like surrounded with surrounded spec for the best damage, but multikill clip coupled with feeding frenzy is a great option too.\n\nWhere I've heard the most chatter around Enyo-D is in the Crucible. People are calling it the Antiope-D 2.0 or the kinetic Shayura's Wrath. I think both are true, but the Enyo-D still has some shortcomings when it comes to comparing against the both. Enyo-D does not have kill clip. Multikill clip is fine and good, but the immediate 33% damage bonus is incredible on any precision frame smg. Enyo-D also has less zoom than both. The zoom field has been condensed, but the 16 zoom smgs will still be some of the best out of the gate. Steady hands also brings up one of Enyo-D's weakest stats and makes it feel incredibly fluid. Keep an eye out for this one."},{"hash":1601177201,"plugs":[[1840239774],[106909392],[2779035018],[3708227201]],"tags":["GodPVE"]},{"hash":1601177201,"plugs":[[1840239774,3250034553,1482024992],[3142289711],[509074078,1195158366,2946784966],[2458213969,3425386926]],"tags":["PVP"]},{"hash":1601177201,"plugs":[[1840239774],[3142289711],[509074078],[2458213969]],"tags":["GodPVP"]},{"hash":2778013407,"plugs":[[839105230,1840239774],[1968497646,1087426260,2420895100],[1354429876,744594675,848860060,2139363611],[2896038713,3708227201,3673922083,2402480669,781192741,2889515627]],"tags":["PVE"],"description":"Firefright is one of the better precision frame auto rifles we have gotten recently. Through a combination of a mag increasing perk and bonus damage of your choice you'll have a wonderful time shooting this auto. It's stats might mislead you, but overall I think Firefright is an excellent choice for a good all-around auto.\n\nSimilar to a lot of weapons this season, Firefright suffers from its frame, not its perks. Threat detector and elemental capacitor both are incredible on any weapon and adagio on a precision frame feels really fun to use. Because of vanilla D2 and the usage of Uriel's Gift and other precision frame auto rifles, the current day auto rifles have the worst optimal and body shot TtK, resulting in lukewarm results at best, and at worst, not an enjoyable experience."},{"hash":2778013407,"plugs":[[839105230],[1968497646],[1354429876,848860060],[2896038713,2402480669]],"tags":["GodPVE"]},{"hash":2778013407,"plugs":[[839105230],[1561002382,1885400500],[4071163871,1866048759,494941759,3118144663],[3511092054,3673922083,711234314,2889515627]],"tags":["PVP"]},{"hash":2778013407,"plugs":[[839105230],[1561002382],[4071163871,494941759],[3511092054,711234314]],"tags":["GodPVP"]},{"hash":2194955522,"plugs":[[839105230,1840239774,1482024992],[106909392,1087426260,2420895100],[2779035018,2869569095,1171147302,2308090567],[557221067,1771339417,4293542123,2896748467,395388285,2675184851]],"tags":["PVE"],"description":"Fixed Odds is an interesting reissue. I originally thought I would love it back in opulence, but the nature and rpm of the high-impact frame machine guns makes them feel so slow. To make Fixed Odds feel a little less slow, run either arrowhead brake for the recoil direction or fluted barrel to bring up one of its worst stats. Any mag boosting perk is preferred in the second column. Feeding frenzy or field prep will depend on how you play, but both bring up another low stat. Finally depending on how you play, killing tally, firing line, or incandescent are all fantastic perks. If you're using a Solar 3.0 subclass, incandescent and feeding frenzy make a great pairing. If you prefer any other subclass and are solo, killing tally will be phenomenal. Finally if you run group activities a lot, firing line and field prep will be excellent for boss or major dps.\n\nHigh-Impact machine guns in PvP are not the first choice, and really not even the second or third choice either. Their TtK is competitive, but their forgiveness and ease of use is not. Arrowhead brake really cleans up the recoil and will make follow up shots a lot easier to hit. Pair that with accurized rounds to extend your engagement range. Finally, because of the nature of heavy ammo in PvP, you'll be happy to grab a roll with under pressure for the added accuracy and stability. Best of luck to anyone who uses this."},{"hash":2194955522,"plugs":[[839105230],[106909392],[2779035018,1171147302],[557221067,2896748467]],"tags":["GodPVE"]},{"hash":2194955522,"plugs":[[839105230,1840239774,1392496348],[3142289711,106909392],[1645158859,2866798147,3755250867,3974407819],[2846385770,557221067,509594246,2896748467]],"tags":["PVP"]},{"hash":2194955522,"plugs":[[839105230],[3142289711],[1645158859,3755250867],[2846385770,509594246]],"tags":["GodPVP"]},{"hash":2345794502,"plugs":[[1840239774,4090651448,1482024992],[1087426260,2420895100],[1820235745,3523296417],[1546637391,11612903,247725512]],"tags":["PVE"],"description":"Forgiveness is what I will need after seeing this sidearm. Boy do I just not like aggressive burst sidearms. I don't know what it is about them, but they just feel like wet noodles in my paws. Maybe it's my lack of opposable thumbs? The fur in the controller? Let's just ignore what I just said. Forgiveness is shaping up to be a more focused Brass Attacks. Brass Attacks could roll a reload perk and damage perk, making it neutrally strong. Forgiveness has two reload bypassing perks in subsistence and demolitionist. Vorpal and grenade focus are great and fall into different use cases. If you already have a Brass Attacks, I don't see a need for this in your rotation. But if you would prefer a grenade heavy build than Forgiveness is a great pick.\n\nI will tag u/ReepLoL for this secret. Forgiveness will be incredible in PvP. With a base air accuracy stat of 25, Adept Icarus adding +15, and Air Assault giving up to 60 as your health drops, you could have 100 air accuracy with rapid hit, ricochet rounds and a 17m effective range. For those who aren't Reep, go for something like demolitionist for the added ability energy and multikill clip for the lethality. If you really like grenade builds in PvP and can secure those grenade kills then adrenaline junkie is the best pick for you. Some great neutral perks are moving target for the flat bonus to aim assist, and rapid hit to make securing that first kill easier."},{"hash":2345794502,"plugs":[[1840239774],[1087426260],[1820235745],[1546637391]],"tags":["GodPVE"]},{"hash":2345794502,"plugs":[[1840239774,1482024992],[1561002382,1885400500],[3523296417,588594999,744594675],[2458213969,11612903,247725512]],"tags":["PVP"]},{"hash":2345794502,"plugs":[[1840239774],[1561002382],[3523296417],[2458213969]],"tags":["GodPVP"]},{"hash":2405619467,"plugs":[[1840239774,4090651448,1482024992],[1087426260,2420895100],[1820235745,3523296417],[1546637391,11612903,247725512]],"tags":["PVE"],"description":"Forgiveness is what I will need after seeing this sidearm. Boy do I just not like aggressive burst sidearms. I don't know what it is about them, but they just feel like wet noodles in my paws. Maybe it's my lack of opposable thumbs? The fur in the controller? Let's just ignore what I just said. Forgiveness is shaping up to be a more focused Brass Attacks. Brass Attacks could roll a reload perk and damage perk, making it neutrally strong. Forgiveness has two reload bypassing perks in subsistence and demolitionist. Vorpal and grenade focus are great and fall into different use cases. If you already have a Brass Attacks, I don't see a need for this in your rotation. But if you would prefer a grenade heavy build than Forgiveness is a great pick.\n\nI will tag u/ReepLoL for this secret. Forgiveness will be incredible in PvP. With a base air accuracy stat of 25, Adept Icarus adding +15, and Air Assault giving up to 60 as your health drops, you could have 100 air accuracy with rapid hit, ricochet rounds and a 17m effective range. For those who aren't Reep, go for something like demolitionist for the added ability energy and multikill clip for the lethality. If you really like grenade builds in PvP and can secure those grenade kills then adrenaline junkie is the best pick for you. Some great neutral perks are moving target for the flat bonus to aim assist, and rapid hit to make securing that first kill easier."},{"hash":2405619467,"plugs":[[1840239774],[1087426260],[1820235745],[1546637391]],"tags":["GodPVE"]},{"hash":2405619467,"plugs":[[1840239774,1482024992],[1561002382,1885400500],[3523296417,588594999,744594675],[2458213969,11612903,247725512]],"tags":["PVP"]},{"hash":2405619467,"plugs":[[1840239774],[1561002382],[3523296417],[2458213969]],"tags":["GodPVP"]},{"hash":617501162,"plugs":[[1840239774,839105230,4090651448],[106909392,1087426260,2420895100],[3643424744],[2896038713,2848615171,438098033]],"tags":["PVE"],"description":"Gallu RR3 feels like a waste. The best mag increasing perk is overflow, which I have clear history loving. And focused fury is incredible when reloaded into a full mag. But when you already have strong options like Thoughtless, The Long Shadow, Uzume RR4, and Fugue-55 competing for the same slot, and the IKELOS_SR_v1.0.2 or Praedyth's Revenge being the best snipers for damage. It's hard to recommend a new sniper that does everything the former sniper's do but less.\n\nSnipers in PvP are incredibly personal, so if you find yourself looking for a lower zoom sniper and don't have a Beloved, 1000 Yard Stare, Fugue-55, or any other archetype of sniper you like, the Gallu RR3 is here to try. It does have a low 40 zoom. But I know a lot of players have already moved back to 50 zoom and will be staying there for the foreseeable future."},{"hash":617501162,"plugs":[[1840239774],[106909392],[3643424744],[2896038713]],"tags":["GodPVE"]},{"hash":617501162,"plugs":[[1840239774],[3142289711],[509074078,3643424744,2866798147],[957782887]],"tags":["PVP"]},{"hash":617501162,"plugs":[[1840239774],[3142289711],[509074078],[957782887]],"tags":["GodPVP"]},{"hash":2323544076,"plugs":[[1840239774,1482024992,4090651448],[732557052,2680121939,1483536627],[1048183818,1556840489,3436462433,3431277734,3442762221,2658083589],[557221067,2848615171,4082225868,2896748467,169755979,1161469972]],"tags":["PVE"],"description":"Hollow Denial is the second legendary trace rifle to be given to us, and I think it's better than Retraced Path. Adaptive munitions is incredibly strong and on a trace rifle will shred shields. Killing tally makes a return and and will be great for general mobbing, but without subsistence or overflow to keep the damage going it will fall off the higher the difficulty of activity you're in.\n\nIn PvP trace rifles are like suped up auto rifles, but the scavenger nerf really put a damper on their usability. Rangefinder is the best in slot. But overall, you're better off using any auto rifle over a trace rifle."},{"hash":2323544076,"plugs":[[1840239774],[732557052],[1048183818,3431277734],[557221067,2896748467]],"tags":["GodPVE"]},{"hash":2323544076,"plugs":[[3250034553,1482024992],[2969185026,732557052],[2846385770,1570042021,3436462433,509594246,2748258257,2658083589],[4082225868,3108830275,1161469972,855168139]],"tags":["PVP"]},{"hash":2323544076,"plugs":[[3250034553],[2969185026],[2846385770,509594246],[4082225868,1161469972]],"tags":["GodPVP"]},{"hash":216983039,"plugs":[[839105230],[106909392,1087426260,2420895100],[1428297954,671806388,1570042021],[1546637391,2896038713,4104185692]],"tags":["PVE"],"description":"Who still has one of those zero power Horror's Leasts? Sound off in the comments. I am very sad that my old Horror's Least was sunset, because I am basically grinding for the exact same roll. For PvE you can get away with perpetual motion as your pseudo-reload perk. Couple that with reloader gauntlets and you'll be fine in almost all activities. Vorpal or focused fire are incredible for boss damage or chunking down majors, but I think for most general activities frenzy is going to be the best play.\n\nFor PvP the best perk to look for is kill clip. Absolutely no competition. This takes the crit damage from 24 (72 per burst) to 31.92 (95.76 per burst) which gives you an incredibly easy three burst kill. Either way you'll need all three bursts to kill but anything to make kills easier is a bonus. The 540 RPMmakes firing at the full RPM incredibly difficult without the full auto retrofit. The issue is that even with arrowhead brake you'll still want to slot a counterbalance mod to take the recoil direction to 100, which means manually pulling that trigger at 540 RPM. An easier second kill will be appreciated on your fingers."},{"hash":216983039,"plugs":[[839105230],[106909392],[1428297954],[1546637391]],"tags":["GodPVE"]},{"hash":216983039,"plugs":[[839105230],[3142289711],[1428297954,1570042021],[1015611457]],"tags":["PVP"]},{"hash":216983039,"plugs":[[839105230],[3142289711],[1428297954],[1015611457]],"tags":["GodPVP"]},{"hash":1924276978,"plugs":[[839105230],[106909392,1087426260,2420895100],[1428297954,671806388,1570042021],[1546637391,2896038713,4104185692]],"tags":["PVE"],"description":"Who still has one of those zero power Horror's Leasts? Sound off in the comments. I am very sad that my old Horror's Least was sunset, because I am basically grinding for the exact same roll. For PvE you can get away with perpetual motion as your pseudo-reload perk. Couple that with reloader gauntlets and you'll be fine in almost all activities. Vorpal or focused fire are incredible for boss damage or chunking down majors, but I think for most general activities frenzy is going to be the best play.\n\nFor PvP the best perk to look for is kill clip. Absolutely no competition. This takes the crit damage from 24 (72 per burst) to 31.92 (95.76 per burst) which gives you an incredibly easy three burst kill. Either way you'll need all three bursts to kill but anything to make kills easier is a bonus. The 540 RPMmakes firing at the full RPM incredibly difficult without the full auto retrofit. The issue is that even with arrowhead brake you'll still want to slot a counterbalance mod to take the recoil direction to 100, which means manually pulling that trigger at 540 RPM. An easier second kill will be appreciated on your fingers."},{"hash":1924276978,"plugs":[[839105230],[106909392],[1428297954],[1546637391]],"tags":["GodPVE"]},{"hash":1924276978,"plugs":[[839105230],[3142289711],[1428297954,1570042021],[1015611457]],"tags":["PVP"]},{"hash":1924276978,"plugs":[[839105230],[3142289711],[1428297954],[1015611457]],"tags":["GodPVP"]},{"hash":2026087437,"plugs":[[3525010810,3798852852,1441682018],[3301904089,3032599245],[3300816228,2010801679,3108830275],[2978966579,1546637391,3523296417]],"tags":["PVE"],"description":"Chill clip on a tube grenade launcher? Heck yeah. Sign me up. Now that blinding grenades and concussion grenades caught another nerf, any crowd control is good crowd control. Spike grenades will see a small rise in popularity with Lingering Dread as you do need direct impacts to apply the slow effect. Auto-loading holster or ambitious assassin are both incredible for two different play styles, but a sleeper perk is unrelenting. You can easily get multikills with grenade launchers, and the added health regeneration is noticeable.\n\nIn PvP you could try for chill clip but I think the utility of demolitionist for potentially shooting twice in quick succession is better. You'll also need to have good aim to get those direct hits. Whereas with demolitionist if you do happen to get a kill with Lingering Dread you'll just get some of your grenade cooldown knocked off. Proximity grenades are the best in slot for demoltionist, but if you wanted the alternative high-velocity rounds for getting the grenade to targets with chill clip is the way to go."},{"hash":2026087437,"plugs":[[3525010810],[3301904089],[3300816228],[2978966579]],"tags":["GodPVE"]},{"hash":2026087437,"plugs":[[3525010810,3798852852],[409831596,2822142346],[3300816228,744594675,509074078],[3523296417,2978966579]],"tags":["PVP"]},{"hash":2026087437,"plugs":[[3525010810],[409831596],[3300816228],[3523296417]],"tags":["GodPVP"]},{"hash":2513965917,"plugs":[[852209214,1784898267,1196733167],[3429800428,3827198035,3311977193],[744594675,2621346526,509074078],[124408337,11612903,2652708987]],"tags":["PVE"],"description":"STASIS BOW. BOW MAKE CRYSTAL. HELL YEAH! Now that that is out of my system. Lunulata-4b is a great alternative in the kinetic slot. The clear choice is to pair it with any of the stasis builds, and you'd be absolutely correct. Polymer string and a draw time masterwork is all that's needed to reach the draw time floor without sacrificing any accuracy. Lunulata-4b's low accuracy stat of 25 means losing some would nearly drop you to the floor. Fiberglass arrow shaft brings the accuracy stat up to a respectable amount, but nowhere near perfect. The clear best perk is headstone, but having adrenaline junkie on a bow is fun. If you didn't get one on a Fel Taradiddle then Lunulata-4b is your next best option. (though you could always craft a Fel Taradiddle).\n\nUnfortunately my enthusiasm doesn't extend to PvP. Which is fine, not all PvE weapons have to be strong in PvP and vice versa. Lightweight bows just don't feel as strong as their precision brethren. To make the most of Lunulata-4b you'll want to drop the draw time down to the floor. Rangefinder doesn't do a ton to make the arrows more hit-scan or extend your range by a ton, but it does make those longer shots feel a bit more sticky and successful warm-up will make follow up kills easier to manage."},{"hash":2513965917,"plugs":[[852209214],[3429800428],[744594675],[124408337]],"tags":["GodPVE"]},{"hash":2513965917,"plugs":[[852209214,1784898267],[3429800428,3827198035,3311977193],[2846385770,2866798147,509074078],[2652708987,11612903,124408337]],"tags":["PVP"]},{"hash":2513965917,"plugs":[[852209214],[3429800428],[2846385770],[2652708987]],"tags":["GodPVP"]},{"hash":1780464822,"plugs":[[839105230],[1087426260,1968497646,2420895100],[2779035018,1428297954],[3047969693,1546637391,124408337]],"tags":["PVE"],"description":"It's like Messenger but more angular. New Purpose fills a different niche compared to Messenger. Neither are stronger than the other. New Purpose has headstone, vorpal weapon, and feeding frenzy. Messenger has rapid hit and adept mods. I think the strength of New Purpose is its synergy with stasis as well as the addition of feeding frenzy and vorpal weapon. Both have the stopping power of buffed desperado, but having vorpal for majors and champs is a bonus in New Purpose's corner.\n\nIn terms of PvP it's really close. Rapid hit and the adept mods to give a small edge to messenger, but needing only arrowhead brake to clean up the recoil and have a perfectly vertical recoil direction is really hard to pass up. It completely frees up your mod slot for radar tuner, targeting, or whatever else tickles your fancy."},{"hash":1780464822,"plugs":[[839105230],[1087426260],[2779035018],[3047969693]],"tags":["GodPVE"]},{"hash":1780464822,"plugs":[[839105230],[1561002382,1885400500],[1428297954,744594675,1570042021],[3047969693,124408337,438098033]],"tags":["PVP"]},{"hash":1780464822,"plugs":[[839105230],[1561002382],[1428297954],[3047969693]],"tags":["GodPVP"]},{"hash":254636484,"plugs":[[594346985,2713678205],[3721627275,679225683,1087426260],[951095735,3523296417,1556840489,3878366039,1906147653,3442762221],[1546637391,4104185692,11612903,3418165135,3007133316,2422968039]],"tags":["PVE"],"description":"To quote the great Sneecher, \"Glaives are kinda like bows to me. Out of the 20 perks you can get, only like 5 are worth anything.\" (join the discord for more gems like this one).\n\nGlaives don't have a ton of useful perks on them. Impulse amplifier gives those \"shots\" the extra juice they need to hit targets. Vorpal weapon does allow you to hit majors hard. This glaive, while better than Enigma, is just an arc alternative to Lubrae's Ruin. Which is not a problem.\n\nGlaives in PvP are still not my favorite choice, especially now with the scavenger nerf. Non-OHK special weapons struggle to keep up, and the three melee hit kill is extremely underwhelming."},{"hash":254636484,"plugs":[[594346985],[3721627275],[951095735,3878366039],[1546637391,3418165135]],"tags":["GodPVE"]},{"hash":254636484,"plugs":[[1934171651,5699512,1263609309],[3721627275,679225683],[951095735,3523296417,3878366039,1906147653],[11612903,2224838837,2422968039,3102670337]],"tags":["PVP"]},{"hash":254636484,"plugs":[[1934171651],[3721627275],[951095735,3878366039],[11612903,2422968039]],"tags":["GodPVP"]},{"hash":2715240478,"plugs":[[839105230,1840239774,1482024992],[689005463,2680121939,1483536627],[2779035018,744594675,3300816228],[1546637391,2978966579,4104185692]],"tags":["PVE"],"description":"The Crucible focus weapon this season is Riptide. A rapid -ire fusion in the \"kinetic\" slot. Deliverance has some competition now. Similar to Season of the Cartesian Coordinate vorpal weapon is the best in slot perk to chase after. With 12 perks in that column you'll just have to pray to RNGesus to even see the perk. The two very close second and third are chill clip for Stasis oriented builds (or general add control builds), and frenzy for neutral damage across all enemy types. I find frenzy works best on primary weapons, but a full arsenal of frenzy weapons means you won't ever drop your damage buff.\n\nFor a Crucible weapon it has some very good perks for the Crucible itself. You have two choices in the first column; perpetual motion for players constantly on the move; under pressure for players who prefer to play slower or if you completely dropped scavs in favor of other leg mods. Under pressure is great for Riptide with its 7 mag, but the extra 15 stability just for moving is hard to beat at any point in the magazine."},{"hash":2715240478,"plugs":[[839105230],[689005463],[2779035018],[1546637391]],"tags":["GodPVE"]},{"hash":2715240478,"plugs":[[839105230,1392496348],[689005463,3868766766],[1428297954,1645158859,744594675],[2652708987,3523296417,438098033]],"tags":["PVP"]},{"hash":2715240478,"plugs":[[839105230],[689005463],[1428297954],[2652708987]],"tags":["GodPVP"]},{"hash":4019668921,"plugs":[[839105230,1840239774],[106909392,1087426260,2420895100],[3400784728,1168162263,3700496672],[4293542123,3038247973,2896038713]],"tags":["PVE"],"description":"Staccato-46 sounds incredible. Unlike Tears of Contrition there aren't any meme rolls. But Staccato-46 does come brimming with great Solar 3.0 synergy. Incandescent and triple tap or outlaw are fantastic together to spread scorch. Explosive payload and focused fury are also incredibly strong but are better when not using a Solar 3.0 subclass.\n\nSimilar to Tears of Contrition, Staccato-46 will not see a lot of PvP time. You can make this scout feel better through a mix of stability and recoil direction, but ultimately 180 scouts just aren't as strong as they need to be."},{"hash":4019668921,"plugs":[[839105230],[106909392],[3400784728],[4293542123]],"tags":["GodPVE"]},{"hash":4019668921,"plugs":[[839105230,1840239774],[3177308360],[744594675,1645158859],[3038247973,4293542123]],"tags":["PVP"]},{"hash":4019668921,"plugs":[[839105230],[3177308360],[744594675],[3038247973]],"tags":["GodPVP"]},{"hash":3652506829,"plugs":[[839105230,1840239774],[1687452232,2680121939,1483536627],[3300816228,2284787283,247725512],[1771339417,4104185692,1546637391]],"tags":["PVE"],"description":"New linear fusion archetype? Nice. Stormchaser is a fantastic addition to the game. It might not be game breaking, but it is fun. A three round burst linear fusion. It's most similar to high-impact fusions, but it does significantly more damage and charges faster. For PvE auto-loading holster, clown cartridge, or rapid hit are all fantastic options. Firing line, frenzy, and vorpal are all really close in terms of best in slot, but I would rank them in that order. Firing line is the easiest to proc, frenzy can be your whole loadout, and vorpal while the weakest is still 10% damage. Depending on how you decide to play will determine which is best for you.\n\nI think Stormchaser is a weird weapon for the crucible. It does do enough to body shot with the whole burst, but you're better off going for a crit with just a regular linear fusion rifle or body shot with adagio. Stormchaser is cool and I think it will see some use, but I don't think it will be anyone's first pick."},{"hash":3652506829,"plugs":[[839105230],[1687452232],[3300816228],[1771339417]],"tags":["GodPVE"]},{"hash":3652506829,"plugs":[[1840239774,202670084,1467527085],[689005463,2969185026],[2846385770,744594675],[3523296417]],"tags":["PVP"]},{"hash":3652506829,"plugs":[[1840239774],[689005463],[2846385770],[3523296417]],"tags":["GodPVP"]},{"hash":2591241074,"plugs":[[2801223209,852209214,4067834857],[3429800428,3827198035,3311977193],[201365942,744594675],[1546637391,3365897133,2848615171]],"tags":["PVE"],"description":"Strident Whistle is a great addition to the loot pool. The previous and only non-sunset solar bow was Tyranny of Heaven which was restricted behind the Last Wish raid and raid RNG. Strident Whistle gives a lot of players, both solo and fireteams, the ability to have a solar bow for bow champions and match game. Similar to all other bows the best in slot perks are archer's tempo and either vorpal weapon or explosive head. Overload bow loves explosive head.\n\nPrecision frames are some of the better choices for bows in PvP. Strident Whistle would need to have the lowest charge time of 576 to even compete in PvP. Fiberglass arrow shaft brings the accuracy back up after elastic string lowers it. Archer's tempo is still great here, as is explosive head for double flinch. Moving target is a great pick if you feel you use your bow for follow up shots instead of bow-swap. Successful warm-up paired with archer's tempo is incredible for some really fast draw times, but it feels almost \"kill clip-esque\" with successful warm-up needing a kill to activate."},{"hash":2591241074,"plugs":[[2801223209],[3429800428],[201365942],[1546637391]],"tags":["GodPVE"]},{"hash":2591241074,"plugs":[[2801223209,852209214,4067834857],[3429800428,3827198035,3311977193],[201365942,588594999,744594675],[3365897133,2652708987,47981717]],"tags":["PVP"]},{"hash":2591241074,"plugs":[[2801223209],[3429800428],[201365942],[3365897133]],"tags":["GodPVP"]},{"hash":1366394399,"plugs":[[839105230,1840239774],[106909392,1087426260,2420895100],[3400784728,1428297954,744594675,573122728,2014892510,2139363611],[1546637391,3038247973,1354429876,3418165135,64866129,848860060]],"tags":["PVE"],"description":"Tears of Contrition is a really good feeling Nameless Midnight. If you are a real OG (original guardian) you'll know all about nameless midnight. For PvE you can go with a very similar explosive payload roll. Or the incredibly silly triple tap / fourth time's the charm. Vorpal will give you the best utility on scout rifle seasons.\n\nPrecision frame scouts do not have a strong presence in PvP. To give you the best chance using one, use arrowhead brake. That will clean up the recoil enough. There aren't many lanes that require 80m+ of range, so going for steady rounds will make each shot easier to land. No distractions also combats a lot of the flinch scouts naturally take. Explosive payload increases your outgoing flinch. All of these steps should give you the best chance in the Crucible."},{"hash":1366394399,"plugs":[[839105230],[106909392],[3400784728,573122728],[1546637391,3418165135]],"tags":["GodPVE"]},{"hash":1366394399,"plugs":[[839105230],[3177308360,106909392],[2866798147,744594675,1428297954,3974407819,2139363611,2014892510],[3038247973,47981717,64866129,1370847713]],"tags":["PVP"]},{"hash":1366394399,"plugs":[[839105230],[3177308360],[2866798147,3974407819],[3038247973,64866129]],"tags":["GodPVP"]},{"hash":2263839058,"plugs":[[1840239774,839105230,3661387068],[1687452232,2680121939,1483536627],[2779035018,3436462433,1171147302,2658083589],[4082225868,1799762209,1161469972,1008128453]],"tags":["PVE"],"description":"Probably the only Menagerie weapon returning I am actually excited about. The Epicurean was always a great alternative to Main Ingredient, and after the two Xur Main Ingredients I would like a little breath of fresh air. The Epicurean can roll feeding frenzy and swashbuckler as its main two perks. While it doesn't have the best PvE applications it is still a great option for BONK, schwing, or to channel your inner Roy Mustang.\n\nFor PvP there is really only one perk to look out for. Rangefinder is the absolute best in slot perk for the Epicurean. Zoom is the most important thing on fusion rifles. While Main Ingredient still boasts the best in class zoom, the Epicurean can come pretty close. Snapshot sights or surplus will make the Epicurean feel lighter or handle better which is one of its lowest stats. Look for arrowhead brake to clean up the recoil and make those longer ranged voops easier to handle."},{"hash":2263839058,"plugs":[[1840239774],[1687452232],[2779035018,1171147302],[4082225868,1161469972]],"tags":["GodPVE"]},{"hash":2263839058,"plugs":[[839105230,3661387068],[689005463,3868766766],[3436462433,957782887,744594675,2658083589,4116820839,2139363611],[2846385770,588594999,509594246,2717805783]],"tags":["PVP"]},{"hash":2263839058,"plugs":[[839105230],[689005463],[3436462433,2658083589],[2846385770,509594246]],"tags":["GodPVP"]},{"hash":2488587246,"plugs":[[1840239774,1482024992,4090651448],[1968497646,1087426260,2420895100],[2779035018,744594675],[1015611457,1546637391]],"tags":["PVE"],"description":"This weapon is probably the one I am most excited for. I loved my old Hero's Burden but deleted it because it wasn't a full 5/5 for me, and then Bungie took it out of the loot pool the next season. Adaptive frame 900's always felt the best for me in PvE and PvP. Feeding frenzy and kill clip are the de facto best for PvE activities. Vorpal weapon is great but I find vorpal works best on longer ranged / harder hitting weapons like pulses and scouts.\n\nFor PvP is where this weapon will sing. Kill clip and feeding frenzy are still both great for Crucible purposes. I know a decent number of players will go for iron reach to hit that coveted 20-21m effective range. Neither are bad options but I would rate ricochet rounds higher over high-caliber rounds when using iron reach for that touch of stability. On the other hand high-caliber rounds will help you win those 1v1 situations to proc kill clip."},{"hash":2488587246,"plugs":[[1840239774],[1968497646],[2779035018],[1015611457]],"tags":["GodPVE"]},{"hash":2488587246,"plugs":[[3250034553,1482024992,1467527085],[1561002382,1885400500],[2779035018,744594675],[1015611457,591790007,699525795]],"tags":["PVP"]},{"hash":2488587246,"plugs":[[3250034553],[1561002382],[2779035018],[1015611457]],"tags":["GodPVP"]},{"hash":1999697514,"plugs":[[839105230,1840239774,1482024992],[689005463,2680121939,1483536627],[1820235745,744594675],[1546637391,2652708987]],"tags":["PVE"],"description":"Another returning weapon is my \"Erentil\" the Wizened Rebuke. I absolutely loved using my firmly planted and tap the trigger Wizened Rebuke back in the Forsaken era of Seasons 6 and 7. With the fusion changes I would highly recommend cleaning up the recoil direction to make sure that you have the easiest time controlling the burst. For PvE similar to Riptide you will want vorpal weapon for the best success. Subsistence helps keep the voops going.\n\nFor PvP you'll also want to increase the recoil direction while also increasing the stability. The two most important factors for deep OHK on a fusion are zoom followed by stability. Because the Wizened Rebuke cannot roll rangefinder, the next best thing is to invest into stability to make sure that all the bolts hit. Under pressure also ensures that the little ammo you do get has the best benefits for each shot. Successful warm-up is one of my favorite perks for fusions to really make that second kill super easy to secure."},{"hash":1999697514,"plugs":[[839105230],[689005463],[1820235745],[1546637391]],"tags":["GodPVE"]},{"hash":1999697514,"plugs":[[839105230,3661387068],[689005463,3868766766],[1645158859,588594999,744594675],[2652708987,11551321]],"tags":["PVP"]},{"hash":1999697514,"plugs":[[839105230],[689005463],[1645158859],[2652708987]],"tags":["GodPVP"]},{"hash":3000847393,"plugs":[[1840239774,1482024992,4090651448],[1087426260,2420895100],[2779035018,3523296417,744594675],[4104185692,11612903,2848615171]],"tags":["PVE"],"description":"Unforgiven is a really interesting submachine gun. Hot off the heels of Funnelweb and the Title, Unforgiven falls into a weird spot. Most people have a good to great Funnelweb, and the Title was being handed out like crazy. Unforgiven does have the benefit of getting golden tricorn, frenzy, dragonfly, adrenaline junkie in combination with demolitionist. Is that enough for you?\n\nUnforgiven in PvP is a bit of a mixed bag. Aggressive frame submachine guns aren't exactly the easiest to use on controllers, but MnK can really leverage its strengths. For both input methods, maxing out the recoil direction at 100 with either chambered compensator or extended barrel will be the first play. A good combination for grenade centered builds will be demolitionist and adrenaline junkie, but if you happen to find yourself on a more neutral void subclass then you might like golden tricorn. You probably won't see golden tricorn 2x too often, but when you do and the stars align you'll have a monster in your hands."},{"hash":3000847393,"plugs":[[1840239774],[1087426260],[2779035018],[4104185692]],"tags":["GodPVE"]},{"hash":3000847393,"plugs":[[3661387068,1467527085,1482024992],[1885400500,1561002382],[3523296417,509074078,744594675],[11612903,2610012052]],"tags":["PVP"]},{"hash":3000847393,"plugs":[[3661387068],[1885400500],[3523296417],[11612903]],"tags":["GodPVP"]},{"hash":1478986057,"plugs":[[1300023272,1482024992,4090651448],[791862061,106909392,1087426260],[2869569095,744594675,2308090567,2139363611],[2679249093,1546637391,4293542123,788178929,3418165135,2675184851]],"tags":["PVE"],"description":"Without Remorse is an interesting shotgun. It competes with everyone's favorite Seventh Seraph CQC-12. Without Remorse has better range and stability, but worse handling and reload. They are very comparable though, only being a maximum of 9 points off in stability. Where Without Remorse wins is in the PvE category. One-Two Punch is my favorite damage perk regardless of what subclass you play on. Having a 200% damage increase to your non-ranged melee is incredibly fun for destroying majors or chunky red bars. Pair that with auto-loading holster to keep your mag topped off is the way to go.\n\nWhere things get a lot closer is in the crucible. A very common perk combo to run in order to max out handling is via threat detector and elemental capacitor on arc. The Seventh Seraph CQC-12 has a different but equally effective max handling combination in snapshot and quickdraw. Depending on how you play I think the winner will be decided that way. If you enjoy arc subclasses, Without Remorse is the reigning champion. If you play almost any other subclass, the Seventh Seraph CQC-12 is the best in slot."},{"hash":1478986057,"plugs":[[1300023272],[791862061],[2869569095,2308090567],[2679249093,788178929]],"tags":["GodPVE"]},{"hash":1478986057,"plugs":[[1047830412,1300023272],[3142289711,791862061],[4071163871,509074078,1866048759,494941759,843318450,3118144663],[3511092054,711234314]],"tags":["PVP"]},{"hash":1478986057,"plugs":[[1047830412],[3142289711],[4071163871,494941759],[3511092054,711234314]],"tags":["GodPVP"]}]}
