{
    "name": "Pandapaxxy's Mouse and Keyboard rolls - Season 19",
    "description": "Recommendations based on Pandapaxxy's breakdowns on r/sharditorkeepit for Mouse and Keyboard on Season 19 weapons.",
    "data": [
        {
            "hash": 676270382,
            "plugs": [
                [
                    1840239774,
                    839105230
                ],
                [
                    1087426260,
                    106909392,
                    3230963543
                ],
                [
                    3400784728,
                    2284787283,
                    2869569095
                ],
                [
                    1771339417,
                    4104185692,
                    1546637391
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Albruna-D is the new gambit weapon. It has that inflated perk pool like all core playlist weapons. That being said, there's a ton of incredible perks you can choose from. With the recent-ish change of resets adding more perks it will be really easy to get your god roll or at least a usable roll. For any PvE activity I will always try and prioritize recoil direction. Especially on special weapons or your main DPS weapon to make follow up shots easier. Any mag boosting perk will make the overall roll better. The usual suspects of triple tap, clown cartridge and field prep all make their appearance. Alongside our usual damage perks; firing line, frenzy and vorpal weapon. All of these damage perks are phenomenal, but use case specific. Firing line only works when in a full fireteam or raid, and you'd have to be within range for it to work. Frenzy only really works as long as you're continuously taking damage or dealing it. Vorpal is the easiest to work with but also has the lowest damage output of all three.\n\nFor PvP it is a decent zoom high-impact frame. You can make a choice between opening shot or snapshot if you crank up the handling high enough. Elemental capacitor will certainly help with that. Perpetual motion and moving target are also both incredible perks on snipers, one boosting low stats, the other adding forgiveness through aim assist."
        },
        {
            "hash": 676270382,
            "plugs": [
                [
                    1840239774
                ],
                [
                    1087426260
                ],
                [
                    3400784728
                ],
                [
                    1771339417
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 676270382,
            "plugs": [
                [
                    1840239774,
                    4090651448
                ],
                [
                    3142289711
                ],
                [
                    588594999,
                    3511092054,
                    1428297954
                ],
                [
                    957782887,
                    47981717
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 676270382,
            "plugs": [
                [
                    1840239774
                ],
                [
                    3142289711
                ],
                [
                    588594999
                ],
                [
                    957782887
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 963710795,
            "plugs": [
                [
                    839105230
                ],
                [
                    689005463,
                    2680121939,
                    1483536627
                ],
                [
                    1523832109,
                    1820235745
                ],
                [
                    2978966579,
                    2610012052,
                    3523296417
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Oh this is a spicy roll. Reconstruction and chill clip are so strong together. Subsistence is another good shout if you know you'll secure the kill. I think dropping the charge time as a quality of life perk will make the whole experience better, but if you are okay with the charge time normally, you can go for a larger magazine.\n\nIn PvP there aren't a lot of pros for high-impact fusions. They are certainly strong and they are my favorites to use. But the charge time increase really hurt their overall utility. The change to 5 bolts was nice, but not having high-impact reserves in this weapons perk pool is a bit of a let down. Elemental capacitor can make it feel super consistent on void, arc or stasis. Firmly planted will make the shot you do take incredibly consistent, void or not."
        },
        {
            "hash": 963710795,
            "plugs": [
                [
                    839105230
                ],
                [
                    689005463
                ],
                [
                    1523832109
                ],
                [
                    2978966579
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 963710795,
            "plugs": [
                [
                    3250034553,
                    839105230
                ],
                [
                    2969185026,
                    689005463
                ],
                [
                    280464955
                ],
                [
                    4082225868,
                    3523296417,
                    3511092054
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 963710795,
            "plugs": [
                [
                    3250034553
                ],
                [
                    2969185026
                ],
                [
                    280464955
                ],
                [
                    4082225868
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 495940989,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    3300816228
                ],
                [
                    365154968
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "I am always both happy and sad when this weapon rolls around. Avalanche is just a relic of year 3. It's a weird SUROS machine gun that fires from both barrels. The saving grace is being a 450 RPM machine gun. I went slightly different with my recommendations compared to my peers. With a recoil direction of 70 you really want to bump this up to max. Arrowhead brake is the first suggestion I have. With auto-loading holster you won't have to worry about reload speed and you'll get all the benefits of a bigger magazine with appended mag. Finally there's target lock. This season's newest perk. Target lock will increase your damage the longer you stay on target. With backup mag and appended mag you cap out your magazine at 75. With these many bullets you should definitely be the coolest person in your fireteam when you hit the cap on damage and be able to show off that sweet, sweet DEEPS.\n\nAdaptive machine guns have always been my favorite for PvP. Being able to have decent damage at range, good chip damage, and a pretty manageable recoil are all great things to have. Avalanche does bring some good things to the table, like maxing out recoil direction with arrowhead brake. Ricochet rounds gives you some much needed stability. Dynamic sway reduction will reduce your bloom on extended gunfights. On MnK I would recommend swashbuckler or adrenaline junkie for a flat damage bonus. On Controller I would recommend tap the trigger for even more stability. Not all of it is needed, but having a gun you don't have to fight will make your job easier and you can focus on your opponent."
        },
        {
            "hash": 495940989,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    3300816228
                ],
                [
                    365154968
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 495940989,
            "plugs": [
                [
                    839105230
                ],
                [
                    1885400500
                ],
                [
                    1359896290
                ],
                [
                    4082225868,
                    11612903
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 495940989,
            "plugs": [
                [
                    839105230
                ],
                [
                    1885400500
                ],
                [
                    1359896290
                ],
                [
                    4082225868
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1903182562,
            "plugs": [
                [
                    3525010810,
                    1441682018,
                    3798852852
                ],
                [
                    3796465595,
                    2985827016
                ],
                [
                    2869569095,
                    3523296417,
                    2010801679
                ],
                [
                    4104185692,
                    3927722942,
                    2396489472
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Blowout will be an alright addition to your arsenal. There isn't much that this rocket does that others don't besides dropping more frequently and having more perks with resets. The same \"get damage perk, get reload perk\" applies to Blowout. Frenzy, lasting impression, or chain reaction for add clear are all fantastic options. Field prep for near instant reloads, demolitionist for instant reloads, and ambitious assassin for bigger magazine are all the best in their slot.\n\nBlowout is an interesting core playlist weapon. Being a rocket launcher there isn't much you want in PvP. You want your rocket to go where you're shooting so either impulse amplifier for the zoom or tracking module to ensure it gets to where it should be. Then you want to make sure your one rocket counts so you choose chain reaction or cluster bomb. There really isn't a lot to think about when it comes to PvP rockets."
        },
        {
            "hash": 1903182562,
            "plugs": [
                [
                    3525010810
                ],
                [
                    3796465595
                ],
                [
                    2869569095
                ],
                [
                    4104185692
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1903182562,
            "plugs": [
                [
                    3525010810,
                    3798852852,
                    3809316345
                ],
                [
                    1996142143,
                    2822142346
                ],
                [
                    951095735
                ],
                [
                    2396489472,
                    1275731761
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 1903182562,
            "plugs": [
                [
                    3525010810
                ],
                [
                    1996142143
                ],
                [
                    951095735
                ],
                [
                    2396489472
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2814093983,
            "plugs": [
                [
                    4090651448
                ],
                [
                    3230963543
                ],
                [
                    1820235745
                ],
                [
                    4104185692
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "I really wish Bungie would just update Cold Front's stats. With the return of the Ikelos SMG this season (and its craftable), Blood Feud last season, the Extraordinary Rendition before that and the Ikelos v2 even further back. The Cold Front just has poor stats across the board. With the lowest stability in its class, the lowest reload and aim assist. Cold Front is tied for the lowest magazine with Blood Feud. Cold Front needs a lot to make it feel and shoot well. In PvE I would recommend corkscrew rifling to give a flat buff to all its stats. Flared magwell offers the best of both reload and stability (two stats this gun desperately needs). Frenzy and Subsistence are my final choices. Frenzy is the best for bringing up even more of Cold Front's poor stats. Subsistence has received multiple buffs and it feels incredible on your primary add clear weapon. It's a good thing no matter what you will look cool shooting this gun.\n\nIt's a similar situation in PvP. Cold Front has a giant hill to climb and with a lot of competition it might not be worth it. Most people have Blood Feud from last season, and the Ikelos SMG just received a pretty nice upgrade. Cold Front does have the best sights IMO so for me it's semi-worth. In PvP you're really looking for consistency or lethality. Cold Front does not have super strong lethality perks like kill clip or multikill clip, so you're looking for consistency. Cold Front does offer rangefinder, putting it on par with its siblings, but the lack of stats still leaves a lot to be desired. Perpetual motion, tap the trigger, smallbore, and stability are all very important stats to look into. With the Ikelos SMG having eighteen more stability at base, you will need all the help you can get."
        },
        {
            "hash": 2814093983,
            "plugs": [
                [
                    4090651448
                ],
                [
                    3230963543
                ],
                [
                    1820235745
                ],
                [
                    4104185692
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2814093983,
            "plugs": [
                [
                    3250034553
                ],
                [
                    3142289711
                ],
                [
                    1428297954
                ],
                [
                    2846385770
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 2814093983,
            "plugs": [
                [
                    3250034553
                ],
                [
                    3142289711
                ],
                [
                    1428297954
                ],
                [
                    2846385770
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 540880995,
            "plugs": [
                [
                    839105230
                ],
                [
                    106909392,
                    1087426260,
                    3230963543
                ],
                [
                    1820235745
                ],
                [
                    2173046394,
                    2610012052,
                    2848615171
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Oh dark decider. I am happy to see you. I do not know what it is about the Veist style rapid fire frames, but I vastly prefer them over non-Veist ones. Dark Decider is almost a carbon copy of my favorite rapid fire frame of all time Hollow Earth from Year 1. Subsistence and voltshot are going to be the roll to get on Dark Decider for PvE. Golden tricorn is fantastic but requires a bit more thinking to maintain 2x.\n\nFor PvP Dark Decider fits into a weird spot. It has some of the lowest base stats within its archetypes but some of the most unique perks that can put it well above the rest. For one, it is the only rapid-fire frame to roll rangefinder. Putting it in a range class well above its stats. It can also roll Iron Grip for a whopping +20 stability without sacrificing your barrel and magazine perks to stability. The only other auto rifle in this class to compete with Dark Decider would be Krait and given comparable rolls (DD - hammer-forged, accurized, iron grip, rangefinder / K - hammer-forged, ricochet, overflow, moving target) Dark Decider would have 2 whole meters over Krait. Which is a lot within the auto rifle space."
        },
        {
            "hash": 540880995,
            "plugs": [
                [
                    839105230
                ],
                [
                    106909392
                ],
                [
                    1820235745
                ],
                [
                    2173046394
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 540880995,
            "plugs": [
                [
                    839105230
                ],
                [
                    3142289711
                ],
                [
                    1359896290,
                    11551321
                ],
                [
                    2846385770,
                    591790007
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 540880995,
            "plugs": [
                [
                    839105230
                ],
                [
                    3142289711
                ],
                [
                    1359896290
                ],
                [
                    2846385770
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1751893422,
            "plugs": [
                [
                    839105230
                ],
                [
                    3230963543,
                    106909392,
                    1087426260
                ],
                [
                    247725512,
                    1168162263,
                    2938480696,
                    1347741687
                ],
                [
                    4104185692,
                    124408337,
                    3047969693,
                    3007133316,
                    1171887445,
                    624891305
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Disparity is probably the best weapon to come out of the season. A craftable aggressive burst pulse rifle that looks good, feels good, has a fantastic sight and oh gosh my bees are kneed (I know that's not how that goes). There are so many great perks to go for but the base will all be the same. Arrowhead to have near-perfect recoil direction. Flared magwell or tactical mag for a bump in reload / stability with the latter having a slight bump in magazine. Rapid hit is my preferred third column option but outlaw is easier and immediate. No need to build up stacks, just headshot and done. Frenzy is the immediate choice for a \"no thoughts, head empty\" workhorse weapon. Headstone and desperado are both fantastic for their respective builds. The former gives you slow, cover, and stasis synergy, while the latter gives you that Rambo effect turning your pulse into a mini machine gun.\n\nTaking that fantastic base and transitioning it over to the crucible is easy. Most of the weapon stays the same. Arrowhead and rapid hit are the foundation. Steady rounds for more stability, or accurized rounds for even more range is your preference. In the last column you have three separate ways you can go. Kill clip is the easiest to use and helps make the second kill easier as you won't need as many critical hits. Headseeker is my pick for overall neutral play. Desperado is great for kill chaining in 6v6 but I wouldn't use it in 3v3."
        },
        {
            "hash": 1751893422,
            "plugs": [
                [
                    839105230
                ],
                [
                    3230963543
                ],
                [
                    247725512,
                    2938480696
                ],
                [
                    4104185692,
                    3007133316
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1751893422,
            "plugs": [
                [
                    3250034553,
                    1482024992
                ],
                [
                    3142289711
                ],
                [
                    247725512,
                    699525795,
                    2938480696,
                    3719974635
                ],
                [
                    1015611457,
                    460017080,
                    3047969693,
                    2923251173,
                    4045335048,
                    624891305
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 1751893422,
            "plugs": [
                [
                    3250034553
                ],
                [
                    3142289711
                ],
                [
                    247725512,
                    2938480696
                ],
                [
                    1015611457,
                    2923251173
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 3102421004,
            "plugs": [
                [
                    1840239774,
                    1482024992,
                    4090651448
                ],
                [
                    3230963543,
                    106909392,
                    1087426260
                ],
                [
                    1168162263
                ],
                [
                    4104185692,
                    1015611457
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "This is going to be Palindrome-lite. It won't have the same all-encompassing perk pool that made Palindrome so good in all aspects of the game. But being a void hand cannon that can take adept mods, has frenzy and alacrity can come in handy when in GMs or master content. While it's not a direct 1:1 it can fill a hole if you missed Palindrome before it was taken from the loot pool.\n\nSimilarly, Exalted Truth will be the direct comparison in PvP. Rangefinder in the third column paired with eye of the storm will make Exalted Truth a very coveted hand cannon. This combo only rolls on a select few hand cannons. Cantata-57, Ancient Gospel, Austringer, Bottom Dollar, and now Exalted Truth. Having access to adept mods puts Exalted Truth at the top of this family and alacrity is just the cherry on top. Keep an eye out for this hand cannon come Trials."
        },
        {
            "hash": 3102421004,
            "plugs": [
                [
                    1840239774
                ],
                [
                    3230963543
                ],
                [
                    1168162263
                ],
                [
                    4104185692
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 3102421004,
            "plugs": [
                [
                    3250034553,
                    1482024992
                ],
                [
                    3142289711
                ],
                [
                    2846385770,
                    2450788523
                ],
                [
                    699525795
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 3102421004,
            "plugs": [
                [
                    3250034553
                ],
                [
                    3142289711
                ],
                [
                    2846385770
                ],
                [
                    699525795
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 3920882229,
            "plugs": [
                [
                    1840239774,
                    1482024992,
                    4090651448
                ],
                [
                    3230963543,
                    106909392,
                    1087426260
                ],
                [
                    1168162263
                ],
                [
                    4104185692,
                    1015611457
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "This is going to be Palindrome-lite. It won't have the same all-encompassing perk pool that made Palindrome so good in all aspects of the game. But being a void hand cannon that can take adept mods, has frenzy and alacrity can come in handy when in GMs or master content. While it's not a direct 1:1 it can fill a hole if you missed Palindrome before it was taken from the loot pool.\n\nSimilarly, Exalted Truth will be the direct comparison in PvP. Rangefinder in the third column paired with eye of the storm will make Exalted Truth a very coveted hand cannon. This combo only rolls on a select few hand cannons. Cantata-57, Ancient Gospel, Austringer, Bottom Dollar, and now Exalted Truth. Having access to adept mods puts Exalted Truth at the top of this family and alacrity is just the cherry on top. Keep an eye out for this hand cannon come Trials."
        },
        {
            "hash": 3920882229,
            "plugs": [
                [
                    1840239774
                ],
                [
                    3230963543
                ],
                [
                    1168162263
                ],
                [
                    4104185692
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 3920882229,
            "plugs": [
                [
                    3250034553,
                    1482024992
                ],
                [
                    3142289711
                ],
                [
                    2846385770,
                    2450788523
                ],
                [
                    699525795
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 3920882229,
            "plugs": [
                [
                    3250034553
                ],
                [
                    3142289711
                ],
                [
                    2846385770
                ],
                [
                    699525795
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2566006935,
            "plugs": [
                [
                    3250034553,
                    1840239774
                ],
                [
                    3230963543,
                    679225683,
                    1087426260
                ],
                [
                    691659142,
                    4071163871
                ],
                [
                    1015611457,
                    2610012052,
                    4082225868
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Fioritura-59 (I am never spelling that right on the first try) is an interesting world drop. Rapid-fire sidearms are really fun and quirky. They go pew pew rather fast but feel like pea shooters more than weapons half the time. Kill clip, golden tricorn, and swashbuckler will all raise your damage, but rapid-fire sidearms need their whole mag to take down most enemies. Any and all damage modifiers just drop that to half mag or a third of a mag. This still means you're practically mag dumping each time, but hey. It feels fun to shoot.\n\nRapid-fire frame sidearms are the biggest Uno Reverse card for shotgun rushers. Spray them down and you don't need a lot of range to do so. These weapons excel in cqc but also live and die by their consistency. Fioritura-59 has great lethality perks and will serve well in a very aggressive play style but will be hard countered by anyone walking backwards."
        },
        {
            "hash": 2566006935,
            "plugs": [
                [
                    3250034553
                ],
                [
                    3230963543
                ],
                [
                    691659142
                ],
                [
                    1015611457
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2566006935,
            "plugs": [
                [
                    3250034553
                ],
                [
                    1885400500,
                    1561002382
                ],
                [
                    2450788523,
                    4071163871,
                    691659142
                ],
                [
                    1015611457,
                    4082225868
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 2566006935,
            "plugs": [
                [
                    3250034553
                ],
                [
                    1885400500
                ],
                [
                    2450788523
                ],
                [
                    1015611457
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2272041093,
            "plugs": [
                [
                    839105230
                ],
                [
                    689005463,
                    2680121939,
                    1483536627
                ],
                [
                    2869569095,
                    124408337,
                    1168162263,
                    2308090567,
                    1171887445,
                    1347741687
                ],
                [
                    1546637391,
                    2978966579,
                    4104185692,
                    3418165135,
                    344235611,
                    3007133316
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Other than Disparity, this is probably the best weapon to grind for this season. Not having to rely on RNG to get your 5/5 is incredible. Fire and Forget also being stasis allows you to go big damage with Silence and Squall and font of might. The aggressive burst linear fusions are definitely best in slot. Fire and Forget is an incredible gift from the Bungie gods. I would highly recommend bringing the recoil direction up to 100 with arrowhead brake. That way you can solely focus on fighting flinch. You can go a couple different routes with magazine and masterwork, but I prefer mag dumping and better burst dps with accelerated coils and charge time MW. Field prep is best for pure damage, but headstone and vorpal are probably what I will be going for. That way I can have some decent damage and crowd control. Chill clip is interesting and certainly viable, but I don't know how useful it will really be in practice.\n\nIn terms of using fire and forget in PvP. It's kind of a mixed bag. It can definitely feel good and has some forgiveness you don't really find on heavy weapons. I like aggressive bursts for PvP but I don't find myself reaching for them often. Maybe a crafted version will change that. Go for as low of a charge time with as high handling and as much range you can fit into this wonderfully sexy weapon. Rangefinder will help keep aim assist at range, and high-impact reserves will help if you miss part of the burst."
        },
        {
            "hash": 2272041093,
            "plugs": [
                [
                    839105230
                ],
                [
                    689005463
                ],
                [
                    2869569095,
                    2308090567
                ],
                [
                    1546637391,
                    3418165135
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2272041093,
            "plugs": [
                [
                    1840239774,
                    839105230
                ],
                [
                    2969185026
                ],
                [
                    2846385770,
                    2450788523,
                    124408337,
                    509594246,
                    4207509907,
                    1171887445
                ],
                [
                    2213355989,
                    3523296417,
                    2002547233,
                    1906147653
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 2272041093,
            "plugs": [
                [
                    1840239774
                ],
                [
                    2969185026
                ],
                [
                    2846385770,
                    509594246
                ],
                [
                    2213355989,
                    2002547233
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 3573686365,
            "plugs": [
                [
                    839105230
                ],
                [
                    689005463
                ],
                [
                    1820235745
                ],
                [
                    1427256713
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Let me start off by saying I love Glacioclasm. I grinded for one back in 2020 and loved the scope and the way it feels. In 2021 its perk pool was updated and now in 2022 we again grind for a newer, more updateder version of the 2021 roll. Arrowhead brake is the best thing for these dawning weapons. Maxing out recoil direction will just make the shooting experience easier. Not having to think about recoil control just means you can focus on how cool this gun is. Subsistence will continue to keep reservoir burst up, but newer fusions can roll reservoir burst and keep it for more than one shot. Glacioclasm is a product of power creep, but that's okay. Not needing to think about how many shots of reservoir burst you have left and instead going 1:1 makes things easier. Easy is good. I will also give a special shoutout to Golden tricorn. SImilar to Stay Frosty, having the ability cycling and one of the highest damage outputs you can imagine for this weapon type is incredible. Void also gives you more ways of uptime and refresh-ability. Definitely keep an eye out for that.\n\nIn PvP it's all about stacking as many consistency perks as possible. Lowering the charge time via accelerated coils and charge time MW so you won't have to pre-charge as long. Arrowhead to make tracking easier. Under pressure for the most accuracy bonuses. High-impact reserves for some damage bonuses. It's not going to be as quick as Midha's Reckoning but it can get close and feel just as strong."
        },
        {
            "hash": 3573686365,
            "plugs": [
                [
                    839105230
                ],
                [
                    689005463
                ],
                [
                    1820235745
                ],
                [
                    1427256713
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 3573686365,
            "plugs": [
                [
                    839105230
                ],
                [
                    689005463
                ],
                [
                    1645158859
                ],
                [
                    2213355989
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 3573686365,
            "plugs": [
                [
                    839105230
                ],
                [
                    689005463
                ],
                [
                    1645158859
                ],
                [
                    2213355989
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 487361141,
            "plugs": [
                [
                    1840239774,
                    1482024992
                ],
                [
                    1087426260,
                    106909392,
                    3230963543
                ],
                [
                    3300816228,
                    4071163871
                ],
                [
                    1546637391
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Did you never get a good rolled FILO? Well this is your chance, Gunnora's Axe is a perfect replacement or alternative. Auto-loading holster and vorpal weapon make this an identical roll to FILO.\n\nI know this was u/SirStallion_'s favorite shotgun back in the day. And it was also mine further back in year 1. Gunnora's Axe never left my inventory whenever I was going into PvP. With the current state of slug shotguns, you do want to go for as much range as possible while maintaining as high of handling as possible. Fluted barrel or hammer-forged rifling are your best options for barrels. Accurized is the only choice as for whatever reason Gunnora's Axe doesn't get access to assault mag. Threat detector and opening shot are the S tier combo to get. Iron reach and moving target are decent substitutes as long as you have the handling to back it up."
        },
        {
            "hash": 487361141,
            "plugs": [
                [
                    1840239774
                ],
                [
                    1087426260
                ],
                [
                    3300816228
                ],
                [
                    1546637391
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 487361141,
            "plugs": [
                [
                    1840239774,
                    3250034553
                ],
                [
                    3142289711
                ],
                [
                    4071163871,
                    588594999,
                    3436462433
                ],
                [
                    47981717,
                    591790007,
                    957782887
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 487361141,
            "plugs": [
                [
                    1840239774
                ],
                [
                    3142289711
                ],
                [
                    4071163871
                ],
                [
                    47981717
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 772231794,
            "plugs": [
                [
                    839105230,
                    1840239774,
                    4090651448
                ],
                [
                    106909392,
                    1087426260,
                    3230963543
                ],
                [
                    247725512,
                    1820235745
                ],
                [
                    4104185692,
                    3824105627,
                    3038247973
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Hung Jury is back! Again again! It was originally in d1, introduced in d2, left d2 and now brought back. Does that make this version the best version yet? Kinda not really. All the base stats are the same The new Hung Jury now has the origin traits. It lost bottomless grief, one for all and adrenaline junkie. All fantastic perks depending on what you like to use. In their place we received no distractions, and frenzy. Frenzy is a fantastic addition and I love seeing it on more weapons, but losing things to not have as strong of a weapon next time around is a let down. Hung Jury is the first weapon that has rotated out to come back again. If this is the treatment they get I would rather have them not come back.\n\nHung Jury also caught a nerf in the crucible. It used to have the ability to three-crit with box breathing. A somewhat niche, but strong way of reliving the old Not Forgotten and Luna's Howl era. With the lower damage box breathing does and losing moving target I don't think Hung Jury has much of a place in PvP."
        },
        {
            "hash": 772231794,
            "plugs": [
                [
                    839105230
                ],
                [
                    106909392
                ],
                [
                    247725512
                ],
                [
                    4104185692
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 772231794,
            "plugs": [
                [
                    1482024992,
                    4090651448
                ],
                [
                    3230963543,
                    3142289711,
                    3177308360
                ],
                [
                    247725512,
                    2866798147,
                    3436462433
                ],
                [
                    3038247973,
                    3824105627
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 772231794,
            "plugs": [
                [
                    1482024992
                ],
                [
                    3230963543
                ],
                [
                    247725512
                ],
                [
                    3038247973
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 4074251943,
            "plugs": [
                [
                    839105230,
                    1840239774,
                    4090651448
                ],
                [
                    106909392,
                    1087426260,
                    3230963543
                ],
                [
                    247725512,
                    1820235745
                ],
                [
                    4104185692,
                    3824105627,
                    3038247973
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Hung Jury is back! Again again! It was originally in d1, introduced in d2, left d2 and now brought back. Does that make this version the best version yet? Kinda not really. All the base stats are the same The new Hung Jury now has the origin traits. It lost bottomless grief, one for all and adrenaline junkie. All fantastic perks depending on what you like to use. In their place we received no distractions, and frenzy. Frenzy is a fantastic addition and I love seeing it on more weapons, but losing things to not have as strong of a weapon next time around is a let down. Hung Jury is the first weapon that has rotated out to come back again. If this is the treatment they get I would rather have them not come back.\n\nHung Jury also caught a nerf in the crucible. It used to have the ability to three-crit with box breathing. A somewhat niche, but strong way of reliving the old Not Forgotten and Luna's Howl era. With the lower damage box breathing does and losing moving target I don't think Hung Jury has much of a place in PvP."
        },
        {
            "hash": 4074251943,
            "plugs": [
                [
                    839105230
                ],
                [
                    106909392
                ],
                [
                    247725512
                ],
                [
                    4104185692
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 4074251943,
            "plugs": [
                [
                    1482024992,
                    4090651448
                ],
                [
                    3230963543,
                    3142289711,
                    3177308360
                ],
                [
                    247725512,
                    2866798147,
                    3436462433
                ],
                [
                    3038247973,
                    3824105627
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 4074251943,
            "plugs": [
                [
                    1482024992
                ],
                [
                    3230963543
                ],
                [
                    247725512
                ],
                [
                    3038247973
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1731355324,
            "plugs": [
                [
                    1482024992,
                    4090651448,
                    1840239774
                ],
                [
                    1087426260,
                    106909392,
                    2420895100
                ],
                [
                    1820235745,
                    247725512,
                    3400784728,
                    4245865861,
                    2938480696,
                    573122728
                ],
                [
                    4104185692,
                    2610012052,
                    3425386926,
                    3007133316,
                    4290541820,
                    288411554
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "The Ikelos hand cannon (I refuse to type out that \"Rasputin naming\" for each of these weapons) has had a grand total of 3 revisions now. None of them have been any good. This is probably the best timeline the Ikelos hand cannon has seen but it is still underwhelming. Precision frame hand cannons do not do enough damage in PvE to warrant use outside out bounties or low-level PvE. They just simply don't scale well enough for my tastes. Frenzy and subsistence will help a ton but even with all the benefits they still underperform. Golden tricorn will give you the maximum benefits with a void subclass. Good luck with this gun.\n\nPrecision frame hand cannons did get a slight buff recently. They are consistent but just as underwhelming in PvP. I cannot undervalue their easy recoil control, but they are outclassed in almost all other aspects. Rapid hit will make shooting a breeze, and rampage is enough to 3-crit up to 9 resilience."
        },
        {
            "hash": 1731355324,
            "plugs": [
                [
                    1482024992
                ],
                [
                    1087426260
                ],
                [
                    1820235745,
                    4245865861
                ],
                [
                    4104185692,
                    3007133316
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1731355324,
            "plugs": [
                [
                    3250034553
                ],
                [
                    3142289711
                ],
                [
                    247725512,
                    2938480696
                ],
                [
                    3425386926,
                    288411554
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 1731355324,
            "plugs": [
                [
                    3250034553
                ],
                [
                    3142289711
                ],
                [
                    247725512,
                    2938480696
                ],
                [
                    3425386926,
                    288411554
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1168625549,
            "plugs": [
                [
                    1300023272,
                    4090651448
                ],
                [
                    106909392,
                    1087426260,
                    679225683
                ],
                [
                    1631667848,
                    1820235745,
                    691659142,
                    402033656,
                    4245865861,
                    536173722
                ],
                [
                    2679249093,
                    2360754333,
                    4082225868,
                    788178929,
                    2459015849,
                    1161469972
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "It has been many, many moons since the Ikelos shotgun has been viable or even in the conversation. When it was reintroduced in season 11 it didn't make much of a splash. Not much has changed and it still probably won't make much of a splash this season either. In PvE the best shotguns are pin-point frames for damage, and dealer's choice for general use. I do like rapid-fire frames with one-two punch builds as you don't need a lot to hit max magazine and grave robber for \"free\" reloads. The synergy is there and it makes for a really fun game play cycle. Subsistence and trench barrel are good options together, as are pugilist and swashbuckler. I just don't think with all the rapid-fire frame shotguns and PvE centered shotguns the Ikelos will really shine.\n\nRapid-fire frame shotguns have not had a strong presence in PvP either. Their recent change to a fixed spread will help but their poor ammo economy on top of the gamemodes 1 shot per brick leads to a bad taste. They can be strong when barrel stuffing your opponent, but any shotgun will do then. I would just stay away from rapid-fire shotguns until there is a really strong incentive to use them."
        },
        {
            "hash": 1168625549,
            "plugs": [
                [
                    1300023272
                ],
                [
                    106909392
                ],
                [
                    1631667848,
                    402033656
                ],
                [
                    2679249093,
                    788178929
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1168625549,
            "plugs": [
                [
                    1482024992,
                    4090651448
                ],
                [
                    3142289711
                ],
                [
                    4071163871,
                    494941759
                ],
                [
                    4082225868,
                    1161469972
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 1168625549,
            "plugs": [
                [
                    1482024992
                ],
                [
                    3142289711
                ],
                [
                    4071163871,
                    494941759
                ],
                [
                    4082225868,
                    1161469972
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2149683300,
            "plugs": [
                [
                    1840239774,
                    1482024992,
                    4090651448
                ],
                [
                    1087426260,
                    3230963543,
                    1140096971
                ],
                [
                    2779035018,
                    1428297954,
                    4071163871,
                    1171147302,
                    2014892510,
                    494941759
                ],
                [
                    2173046394,
                    4104185692,
                    1720528630,
                    3007133316
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "I know this is probably going to be one of, if not, the first weapon most people want to craft this season. Feeding frenzy and voltshot are an incredible combo and you can choose exactly how you want to craft this weapon. More stability? Bigger magazine? More range? You get to decide what works and what doesn't. Frenzy will scale up a bit better than voltshot for PvE, but voltshot will clear a room quicker.\n\nIn PvP the Ikelos SMG was gutted a bit. It lost some stats and was moved down a peg. But this version has access to rangefinder and killing wind which give it utility outside of neutral perks the previous version had. These extra perks will make it a monster. It won't have the same lethality as Shayura's Wrath or Tarrabah, but it will have some incredible consistency other aggressive frame SMGs don't have."
        },
        {
            "hash": 2149683300,
            "plugs": [
                [
                    1840239774
                ],
                [
                    1087426260
                ],
                [
                    2779035018,
                    1171147302
                ],
                [
                    2173046394,
                    1720528630
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2149683300,
            "plugs": [
                [
                    3250034553,
                    1482024992,
                    1467527085
                ],
                [
                    3142289711,
                    1140096971
                ],
                [
                    2450788523,
                    1428297954,
                    4207509907,
                    2014892510
                ],
                [
                    2846385770,
                    1890422124,
                    509594246,
                    1523649716
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 2149683300,
            "plugs": [
                [
                    3250034553
                ],
                [
                    3142289711
                ],
                [
                    2450788523,
                    4207509907
                ],
                [
                    2846385770,
                    509594246
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2302346155,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260,
                    106909392,
                    2420895100
                ],
                [
                    3643424744,
                    1354429876,
                    2682205016,
                    848860060
                ],
                [
                    2213355989,
                    2896038713,
                    2002547233,
                    2402480669
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Not gonna lie, I still have my season 11 Ikelos sniper. I still use it and I don't think there's a large reason for me to grind out the crafted version. For those who don't have the 2nd version of the Ikelos sniper, overflow and focused fury are a very fun combo for maximizing your damage per magazine. I prefer high-impact reserves and fourth time's the charm for ammo refunding. Something about damage numbers going up consistently makes my smooth brain happy.\n\nIn PvP you will have to decide if this sniper is good enough. Snipers are incredibly personal and what works for one person will not always work for others. The zoom, the scope, the feel will all determine your success. Elemental capacitor on arc subclasses will maximize your handling, but elemental capacitor on stasis or void is another great option for movement speed and stability, respectively."
        },
        {
            "hash": 2302346155,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    3643424744,
                    2682205016
                ],
                [
                    2213355989,
                    2002547233
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2302346155,
            "plugs": [
                [
                    1840239774
                ],
                [
                    3142289711,
                    1140096971
                ],
                [
                    588594999,
                    1428297954,
                    2717805783,
                    2014892510
                ],
                [
                    3511092054,
                    711234314
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 2302346155,
            "plugs": [
                [
                    1840239774
                ],
                [
                    3142289711
                ],
                [
                    588594999,
                    2717805783
                ],
                [
                    3511092054,
                    711234314
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1851521408,
            "plugs": [
                [
                    839105230
                ],
                [
                    3230963543,
                    1087426260,
                    679225683
                ],
                [
                    247725512,
                    1428297954,
                    1354429876
                ],
                [
                    124408337,
                    1015611457,
                    2610012052
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Rapid-fire scouts are like the precision frame hand cannons. Decent but outclassed by most weapons. Rapid hit and headstone are stand out perks but work better on harder hitting archetypes. Kill clip is neutral and a good damage bump. Golden tricorn will give you the strongest damage increase but stasis in PvE for kills is a little lackluster.\n\nThis is just a stasis Contingency Plan. Which I am all here for. I love my Contingency Plan. You do have to bring up almost all Jararaca's low stats. Hammer-forged for range or smallbore for some stability. Scouts generally don't need range but it also doesn't hurt to maintain your aim assist at those longer engagements. Arrowhead for recoil control as the 57 recoil direction is pretty low. Rapid hit is incredibly strong and kill clip is just the bee's knees."
        },
        {
            "hash": 1851521408,
            "plugs": [
                [
                    839105230
                ],
                [
                    3230963543
                ],
                [
                    247725512
                ],
                [
                    124408337
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1851521408,
            "plugs": [
                [
                    3250034553,
                    1482024992,
                    839105230
                ],
                [
                    1885400500,
                    1561002382
                ],
                [
                    1428297954,
                    247725512
                ],
                [
                    1015611457,
                    124408337
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 1851521408,
            "plugs": [
                [
                    3250034553
                ],
                [
                    1885400500
                ],
                [
                    1428297954
                ],
                [
                    1015611457
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2978226043,
            "plugs": [
                [
                    2713678205,
                    580685494,
                    1934171651
                ],
                [
                    3721627275,
                    679225683,
                    1087426260
                ],
                [
                    3643424744,
                    3523296417,
                    691659142,
                    2682205016,
                    1906147653,
                    536173722
                ],
                [
                    4293542123,
                    2224838837,
                    1782407750,
                    2675184851,
                    3102670337,
                    2241043034
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "A glaive with overflow and incandescent. Now I have not had the opportunity to fully test it but if Incandescent works with the glaive melee. That would be a hoot. If it doesn't work with the melee it will still be an incredible combo. You could also go with the new glaive perk close to melee to increase your glaive damage. Judgment of Kelgorath is truly the best legendary glaive of them all. (oh and it's craftable)\n\nGlaives in the crucible are not my forte. Let me be perfectly honest and say I do not like glaives in PvP. I understand their appeal and their usefulness. I just don't vibe with them. I do know that immovable object and tilting at windmills are fantastic if you use your shield constantly (why wouldn't you), Unstoppable force is the perk on glaives to maximize their effectiveness once you do get the shield up."
        },
        {
            "hash": 2978226043,
            "plugs": [
                [
                    2713678205
                ],
                [
                    3721627275
                ],
                [
                    3643424744,
                    2682205016
                ],
                [
                    4293542123,
                    2675184851
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2978226043,
            "plugs": [
                [
                    2713678205,
                    580685494,
                    1934171651
                ],
                [
                    3721627275,
                    679225683,
                    1087426260
                ],
                [
                    3800201097,
                    3523296417,
                    691659142,
                    3674673997,
                    1906147653,
                    536173722
                ],
                [
                    2224838837,
                    951095735,
                    438098033,
                    3102670337,
                    3878366039,
                    2748801589
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 2978226043,
            "plugs": [
                [
                    2713678205
                ],
                [
                    3721627275
                ],
                [
                    3800201097,
                    3674673997
                ],
                [
                    2224838837,
                    3102670337
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 3138208275,
            "plugs": [
                [
                    4090651448,
                    1482024992
                ],
                [
                    3230963543,
                    1087426260,
                    1968497646
                ],
                [
                    124408337,
                    4071163871
                ],
                [
                    3047969693,
                    3708227201,
                    4082225868
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Luminal Vigil might be the strongest sidearm to date. Headstone and desperado on an aggressive burst are fantastic. You could also opt for surrounded or swashbuckler for more specific damage bonuses, but both headstone and desperado requiring a crit kill makes it easy. See a crystal? Reload for speedy quick shooting.\n\nLuminal Vigil will continue its dominance in PvP. Rangefinder will push out its effective range enough to be viable against some submachine guns. Tap the trigger or headstone for bonus accuracy or stasis crystals. Kill clip for easy damage. Desperado for Luminal Vigil, the machine gun. All fantastic perks that are wrapped up into the Crimson Chin."
        },
        {
            "hash": 3138208275,
            "plugs": [
                [
                    4090651448
                ],
                [
                    3230963543
                ],
                [
                    124408337
                ],
                [
                    3047969693
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 3138208275,
            "plugs": [
                [
                    3250034553,
                    1482024992,
                    1467527085
                ],
                [
                    1885400500,
                    1561002382
                ],
                [
                    124408337,
                    1428297954,
                    1890422124
                ],
                [
                    2846385770,
                    1015611457,
                    3047969693
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 3138208275,
            "plugs": [
                [
                    3250034553
                ],
                [
                    1885400500
                ],
                [
                    124408337
                ],
                [
                    2846385770
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2328531378,
            "plugs": [
                [
                    1840239774,
                    1482024992
                ],
                [
                    1087426260,
                    3230963543,
                    2420895100
                ],
                [
                    3523296417,
                    1428297954,
                    1774574192
                ],
                [
                    11612903,
                    3751912585,
                    365154968
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "High-impact frame autos feel weird. They shoot too slow for my liking but their damage is incredible. They can chew through rank-and-file enemies with ease, but their low magazine size handicaps them. The best thing to do is try and work around the low magazine by bumping it up or bypassing it entirely. Doing both with appended mag and demolitionist might give you the best bang for your buck. Add on adrenaline junkie for the damage boost and you have a pretty solid weapon. Osmosis will help with elemental wells and general subclass synergy. Cascade point and target lock are interesting. I think on a high-damage primary like Lodbrok-C either could work really well. Cascade point will increase your RPM and target lock will increase your damage. Either way you're doing more damage to majors and chunky enemies.\n\nLodbrok-C in PvP will be an interesting weapon. High-impact frames have some chunky damage and allow for some great team shooting potential. Add in some juiced up stats and range and you can compete with some of the more meta weapons. You can realistically hit 100 range which will put you at a whopping 40m of in-game range. Juice up your other stats through perpetual motion, add in kill clip for extra oomph."
        },
        {
            "hash": 2328531378,
            "plugs": [
                [
                    1840239774
                ],
                [
                    1087426260
                ],
                [
                    3523296417
                ],
                [
                    11612903
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2328531378,
            "plugs": [
                [
                    3250034553,
                    1482024992
                ],
                [
                    1885400500,
                    1561002382
                ],
                [
                    1428297954,
                    3523296417,
                    1359896290
                ],
                [
                    1015611457,
                    1890422124
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 2328531378,
            "plugs": [
                [
                    3250034553
                ],
                [
                    1885400500
                ],
                [
                    1428297954
                ],
                [
                    1015611457
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 8293111,
            "plugs": [
                [
                    1840239774,
                    839105230,
                    4090651448
                ],
                [
                    3230963543,
                    106909392,
                    1087426260
                ],
                [
                    247725512,
                    1820235745
                ],
                [
                    3038247973,
                    2848615171,
                    11612903
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "A legendary Dead Man's Tale? Does this make it an Expired Exo's Epic (EEE)? Slain Awoken's Sagas (SASs)? Having Long Arm be arc opens up loadouts and possibilities while still retaining some of the same identity. Rapid hit and explosive payload are the tried and true combo. Coupled with Long Arm's intrinsic dual loader will make shooting and downtime a breeze.\n\nLong Arm also opens up some neat builds in PvP. Being able to use legendary and exotic kinetics with a DMT-lite will open up so many different play styles and options. Rapid hit or hip-fire grip are going to be player dependent. Hip firing Long Arm or having better follow up shots when aiming down sights will depend on you. Opening shot will ensure that your first shot is going to connect. Explosive payload will introduce added flinch and even some small AoE."
        },
        {
            "hash": 8293111,
            "plugs": [
                [
                    1840239774
                ],
                [
                    3230963543
                ],
                [
                    247725512
                ],
                [
                    3038247973
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 8293111,
            "plugs": [
                [
                    1840239774,
                    839105230
                ],
                [
                    3177308360,
                    3230963543
                ],
                [
                    247725512,
                    1866048759
                ],
                [
                    47981717,
                    3038247973
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 8293111,
            "plugs": [
                [
                    1840239774
                ],
                [
                    3177308360
                ],
                [
                    247725512
                ],
                [
                    47981717
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2827764482,
            "plugs": [
                [
                    1840239774,
                    1482024992,
                    4090651448
                ],
                [
                    732557052,
                    2680121939,
                    1483536627
                ],
                [
                    1820235745,
                    1048183818,
                    1583705720,
                    4245865861,
                    3431277734,
                    1409206216
                ],
                [
                    2173046394,
                    2896038713,
                    4049631843,
                    1720528630,
                    2402480669,
                    859780267
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "I think the Path of Least Resistance is going to be a crowd favorite. Adaptive munitions to crush shields and voltshot to clear rooms. There is the classic \"Musketeer\" combo of stats for all and one for all. As well as some decent damage through focused fury. Subsistence I think is the best for mobbing but without a direct damage bonus you might be a bit underwhelmed with its performance.\n\nTrace rifles have had a very small but solid cult following. The best are still the exotics, but having a near-perfect hipfire juiced up auto rifle is hard to argue against. Path of Least Resistance doesn't offer a lot in terms of lethality to keep the ball rolling once it does get started. Neutrally it is very strong but I think PvE is where it will survive."
        },
        {
            "hash": 2827764482,
            "plugs": [
                [
                    1840239774
                ],
                [
                    732557052
                ],
                [
                    1820235745,
                    4245865861
                ],
                [
                    2173046394,
                    1720528630
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2827764482,
            "plugs": [
                [
                    3250034553,
                    1482024992
                ],
                [
                    2969185026,
                    732557052
                ],
                [
                    1359896290,
                    3060983774
                ],
                [
                    1890422124,
                    1365187766,
                    1523649716,
                    4200236906
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 2827764482,
            "plugs": [
                [
                    3250034553
                ],
                [
                    2969185026
                ],
                [
                    1359896290,
                    3060983774
                ],
                [
                    1890422124,
                    1523649716
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2349907931,
            "plugs": [
                [
                    839105230,
                    4090651448,
                    1482024992
                ],
                [
                    3230963543,
                    1087426260
                ],
                [
                    1820235745,
                    2779035018,
                    1168162263
                ],
                [
                    4104185692,
                    124408337,
                    2458213969
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "This submachine gun is incredible. Decent base stats, good base recoil direction, a million and a half perks. What could be better? Despite not having perfect recoil I would still try and hit 100 with arrowhead brake. Flared magwell or appended is dealer's choice. I find with reload gauntlets or the plethora of ways to bypass reload are more than enough for me. Subsistence is one such way. Being able to ignore a whole stat on your weapon means you can invest those stat points into any other stat. You will still need to reload eventually and having a good reload stat will make that feel less like a slow molasses river. Finally there's your damage perks. Frenzy is tried and true, and headstone is just a wonderful add clear perk. Multikill clip is best used with a dedicated reload perk like feeding frenzy or outlaw.\n\nUnfortunately for Prolonged Engagement it won't see a lot of use outside of PvE. Having 14 zoom makes it firmly middle of the pack and having the lowest base range in its class (technically Escape Velocity is lower, but Escape Velocity also gets sights, not barrels) doesn't help it. What it lacks in range it does make up for in stability, being on the upper percentile. It also has some of the best aim assist for its archetype. Rangefinder is definitely a must, as is pushing up the range. Hammer-forged rifling or smallbore is going to be key, but don't decrease other stats just to increase your range."
        },
        {
            "hash": 2349907931,
            "plugs": [
                [
                    839105230
                ],
                [
                    3230963543
                ],
                [
                    1820235745
                ],
                [
                    4104185692
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2349907931,
            "plugs": [
                [
                    1840239774,
                    1482024992
                ],
                [
                    1885400500,
                    1561002382
                ],
                [
                    2450788523,
                    699525795
                ],
                [
                    2846385770,
                    124408337
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 2349907931,
            "plugs": [
                [
                    1840239774
                ],
                [
                    1885400500
                ],
                [
                    2450788523
                ],
                [
                    2846385770
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 3103325054,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260,
                    3230963543,
                    106909392
                ],
                [
                    2779035018,
                    2869569095,
                    1354429876,
                    1171147302,
                    2308090567,
                    848860060
                ],
                [
                    2610012052,
                    4104185692,
                    1546637391,
                    4290541820,
                    3007133316,
                    3418165135
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "I dislike 900 rpm machine guns. They don't feel very strong for how fast they fire. If I had some good Rambo moments where I could shred hordes of low-tier adds without having to recoil control that much I would love it. But having the lowest base stats across the machine gun archetypes and the fastest rpm makes them unwieldy. Arrowhead brake will bring up the terribly low recoil direction and having more in the magazine means you can be off target for 0.001s and not waste half your ammo. Feeding frenzy and field prep are both ways to bump up the decent reload speed. Golden tricorn will get you the best bang for your glimmer when paired with a void subclass. All void subclasses are viable in end game content so that's not an issue. Frenzy is best when not on a void subclass and vorpal will allow you to do increased but not substantial damage in and out of combat.\n\nLet me issue you a challenge. If you kill me in PvP with this weapon I will uninstall Destiny 2. Find me, kill me. Clip it. Make me suffer.\n\nIn other news, go for consistency perks as the base stats are so low they are almost non-existent. Arrowhead break will make the recoil easier. Accurized rounds will push out your effective range. Heating up will better your stability and recoil direction further, but you have to get a kill first. Tap the trigger won't last long, but will help you get some damage on target."
        },
        {
            "hash": 3103325054,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    2779035018,
                    1171147302
                ],
                [
                    2610012052,
                    4290541820
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 3103325054,
            "plugs": [
                [
                    839105230
                ],
                [
                    3142289711
                ],
                [
                    1570042021,
                    2748258257
                ],
                [
                    1890422124,
                    3425386926,
                    1523649716,
                    288411554
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 3103325054,
            "plugs": [
                [
                    839105230
                ],
                [
                    3142289711
                ],
                [
                    1570042021,
                    2748258257
                ],
                [
                    1890422124,
                    1523649716
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 882778888,
            "plugs": [
                [
                    1840239774,
                    1482024992,
                    4090651448
                ],
                [
                    3230963543,
                    106909392,
                    1087426260
                ],
                [
                    247725512,
                    3511092054
                ],
                [
                    1546637391,
                    3038247973
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Let me be clear here. Rose is not a good PvE weapon. It can exist within the PvE space with rapid hit and either vorpal weapon or explosive payload, but it is not a PvE oriented weapon.\n\nRose is the hotness if you're into using hand cannons in the crucible. Being a stand-alone archetype of a relic long thought lost. Rose has the intrinsic lightweight bonus (+20 mobility) and it also has access to grips over an origin trait. The unique archetype will feel right at home with crucible affectionados and the grips can make up for some extra stats. Rose will excel if you bump up handling, stability and, most importantly, range. I would still not sacrifice other stats to make up for range, but if you happen to get more range I would take it. All the standard crucible perks are here and it makes sense that the crucible weapon is good in the crucible."
        },
        {
            "hash": 882778888,
            "plugs": [
                [
                    1840239774
                ],
                [
                    3230963543
                ],
                [
                    247725512
                ],
                [
                    1546637391
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 882778888,
            "plugs": [
                [
                    3250034553,
                    1482024992,
                    1840239774
                ],
                [
                    3142289711
                ],
                [
                    1428297954,
                    3161816588,
                    247725512
                ],
                [
                    699525795,
                    2846385770,
                    3038247973
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 882778888,
            "plugs": [
                [
                    3250034553
                ],
                [
                    3142289711
                ],
                [
                    1428297954
                ],
                [
                    699525795
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 4070357005,
            "plugs": [
                [
                    839105230,
                    3661387068,
                    1482024992
                ],
                [
                    3230963543,
                    106909392,
                    1087426260
                ],
                [
                    1523832109,
                    1354429876
                ],
                [
                    4104185692,
                    4082225868,
                    365154968
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "I straight up dislike the Seventh Seraph Carbine, I don't know what it is about this weapon but I could never get behind it. Maybe the second iteration will change that. Reconstruction and frenzy are the absolute best perks to look for. Being able to passively double your magazine and have a damage bonus all while the weapon is stowed is too good to pass up.\n\nPrecision frame autos are supposedly very strong (according to Mercules904). While I have my reservations, the Seventh Seraph Carbine might prove me wrong. Dynamic sway reduction to remove bloom and rangefinder will be the go-to combo. Reconstruction, while niche, will be useful in longer gunfights or 1vX situations. Elemental capacitor will be decent in bringing up some lower stats, depending on your subclass of choice."
        },
        {
            "hash": 4070357005,
            "plugs": [
                [
                    839105230
                ],
                [
                    3230963543
                ],
                [
                    1523832109
                ],
                [
                    4104185692
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 4070357005,
            "plugs": [
                [
                    1467527085,
                    1482024992,
                    3250034553
                ],
                [
                    3142289711,
                    1140096971
                ],
                [
                    1359896290,
                    1523832109,
                    691659142
                ],
                [
                    2846385770,
                    3511092054,
                    4082225868
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 4070357005,
            "plugs": [
                [
                    1467527085
                ],
                [
                    3142289711
                ],
                [
                    1359896290
                ],
                [
                    2846385770
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1555959830,
            "plugs": [
                [
                    1840239774,
                    1482024992,
                    4090651448
                ],
                [
                    3230963543,
                    106909392,
                    1087426260
                ],
                [
                    1523832109,
                    2010801679,
                    1354429876
                ],
                [
                    1546637391,
                    438098033
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Similar to the Ikelos hand cannon, I just wish these Rasputin weapons were a different archetype. Precision frames lack a lot in PvE. Reconstruction and vorpal weapon will be the strongest combo, the Seventh Seraph Officer Revolver will fall off hard as the content gets more difficult. If we had seen frenzy I could recommend it higher. Without that damage perk it falls to the wayside.\n\nRangefinder rolling in the third column is an interesting option. Being able to have one of the strongest PvP perks alongside a, somewhat middling, damage perk is incredible. It's not going to have consistent three-taps like Survivor's Epitaph or even the Ikelos hand cannon, it will have some extra punch at the tail end of its magazine."
        },
        {
            "hash": 1555959830,
            "plugs": [
                [
                    1840239774
                ],
                [
                    3230963543
                ],
                [
                    1523832109
                ],
                [
                    1546637391
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1555959830,
            "plugs": [
                [
                    3250034553,
                    1482024992
                ],
                [
                    3142289711,
                    1140096971
                ],
                [
                    2846385770,
                    1523832109
                ],
                [
                    1546637391,
                    2213355989
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 1555959830,
            "plugs": [
                [
                    3250034553
                ],
                [
                    3142289711
                ],
                [
                    2846385770
                ],
                [
                    1546637391
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2812100428,
            "plugs": [
                [
                    839105230
                ],
                [
                    1968497646
                ],
                [
                    2726471870
                ],
                [
                    124408337
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Stay Frosty is probably the only weapon I feel like I need to grind for, then shelve in my vault and forget about for several seasons only to delete it when I realise I haven't used it in months. Jokes aside, it is really cool to see a new lightweight \"kinetic\" pulse rifle. Its base stats aren't anything to write home about. Tied for stability with Ogma PR6, and Chattering Bone at 52, it also ties the Ogma in range but beats Chattering Bone. Stay Frosty also has the lowest handling, aim assist, and \"magazine\" (it's at 31, Ogma at 32, and Chattering at 33, but they're all three-round pulses. Take that for what you want). It's definitely a little outclassed within the stat department. Where Stay Frosty takes the lead is in its perks. Arrowhead is a must regardless of what activity you're in. Having a base recoil of 55 means you can slap on a CB mod and be at 100. Thresh is an incredible tool for building your supers now that your intellect stat doesn't matter as much compared to whatever tier you're in. Headstone is just fun add clear. Get a crit on a thrall? It's no longer a thrall but a thrallsicle! (I'll see myself out). Short shout-out to Golden tricorn. Golden tricorn is the best for ability cycling and weapon cycling. Being able to have such a huge refreshable buff that stacks with things like elemental wells, high-energy fire, and radiance is too good to pass up. Stasis isn't the strongest on its own for abilities, but it might get a buff. Who knows.\n\nOver in the crucible 450 pulses just aren't anything important. Messenger exists, and the new hotness is Disparity. Stay Frosty has a lot to build up in order to compete. Arrowhead brake is a must, but smallbore is a decent alternative if you're fine with the lower recoil direction. Ricochet rounds brings up the stability and bumps up the range a smidge. Over on MnK I would recommend killing wind for the bump in range, handling and movement speed. Couple that with desperado and you've got a pretty solid roll for going on sprees. On Controller I would recommend something slightly different. Moving target is the only perk I would change. Moving target gives you aim assist and movement speed neutrally. That extra aim assist will help a ton to ensure a crit kill in order to get desperado going in the first place."
        },
        {
            "hash": 2812100428,
            "plugs": [
                [
                    839105230
                ],
                [
                    1968497646
                ],
                [
                    2726471870
                ],
                [
                    124408337
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2812100428,
            "plugs": [
                [
                    1482024992
                ],
                [
                    1885400500
                ],
                [
                    2450788523
                ],
                [
                    3047969693
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 2812100428,
            "plugs": [
                [
                    1482024992
                ],
                [
                    1885400500
                ],
                [
                    2450788523
                ],
                [
                    3047969693
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 487205709,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260,
                    2420895100
                ],
                [
                    247725512,
                    3523296417,
                    2848615171
                ],
                [
                    365154968,
                    2173046394,
                    11612903
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Terminus Horizon will be an interesting weapon to use. Being a slow firing weapon it can probably take advantage of target lock better than the other archetypes purely because the weapon takes longer to empty its magazine comparatively. Having 73 bullets at maximum capacity and laying into a boss with triple tap, demolitionist for instant reloads or rapid hit for the bonuses to stability and reload. There are few times I will fully recommend a high-impact machine gun, but Terminus Horizon is definitely one of them.\n\nTerminus Horizon will also fare pretty well in the crucible. Having access to high-impact reserves for some bonus damage or cascade point for an almost desperado type RPM increase will feel incredible depending on your streak or preference. Try and bump up its stability to make sure you can hit every single shot."
        },
        {
            "hash": 487205709,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    247725512
                ],
                [
                    365154968
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 487205709,
            "plugs": [
                [
                    1482024992,
                    3250034553
                ],
                [
                    1885400500,
                    1561002382
                ],
                [
                    247725512,
                    3523296417
                ],
                [
                    2213355989,
                    3751912585
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 487205709,
            "plugs": [
                [
                    1482024992
                ],
                [
                    1885400500
                ],
                [
                    247725512
                ],
                [
                    2213355989
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 3849444474,
            "plugs": [
                [
                    2801223209,
                    852209214
                ],
                [
                    3429800428
                ],
                [
                    201365942,
                    247725512,
                    2848615171,
                    3523746922,
                    2938480696,
                    169755979
                ],
                [
                    4104185692,
                    3365897133,
                    3007133316,
                    1551736345
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Tripwire Canary is the newest arc combat bow. Hopefully it lives up to replace Arsenic Bite. It can roll the infamous roll of dragonfly and explosive head, with the newly buffed dragonfly it should feel really strong. Frenzy being the major source of damage can be paired with your choice of reload or draw time bonuses or the AoE of dragonfly. No choice is wrong from these options.\n\nIn PvP lightweight bows are not the strongest choice. You can definitely make them work in either a swap build or by team-shooting with them. Opening shot is going to ensure a crit when you're in the same postal code as your opponent, or you could go for flinch city and roll with explosive head. It's a niche play style but you can build into it."
        },
        {
            "hash": 3849444474,
            "plugs": [
                [
                    2801223209
                ],
                [
                    3429800428
                ],
                [
                    201365942,
                    3523746922
                ],
                [
                    4104185692,
                    3007133316
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 3849444474,
            "plugs": [
                [
                    2801223209,
                    852209214
                ],
                [
                    3429800428
                ],
                [
                    201365942,
                    247725512,
                    3523746922,
                    2938480696
                ],
                [
                    47981717,
                    3365897133,
                    2652708987,
                    1370847713,
                    1551736345,
                    617966211
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 3849444474,
            "plugs": [
                [
                    2801223209
                ],
                [
                    3429800428
                ],
                [
                    201365942,
                    3523746922
                ],
                [
                    47981717,
                    1370847713
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 3624844116,
            "plugs": [
                [
                    839105230,
                    4090651448
                ],
                [
                    1087426260,
                    106909392,
                    2420895100
                ],
                [
                    1820235745,
                    2010801679,
                    2869569095
                ],
                [
                    4293542123,
                    557221067,
                    2896038713
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Unwavering Duty is the Hammerhead of year 5. The only major differences are that Hammerhead has +2 range, but -4 reload speed, +5 bullets in the magazine and +18 aim assist. They will still feel very comparable. The difference in stats will feel negligible, and the loss in bullets can be made up for via subsistence or ambitious assassin. Incandescent and killing tally are both S tier perks. Focused fury will be useful if this becomes your main dps weapon or machine guns get a sizeable PvE damage buff.\n\nUnwavering Duty will also feel right at home in the crucible. Dynamic sway reduction or killing wind are the best in slot perks. Either will depend on your input and if you want a neutral perk or a lethality perk. While Unwavering Duty isn't able to take advantage of damage perks like rampage or high-impact reserves, it will be able to slot adept mods and take advantage of free stats. Having already pretty similar stats to our favorite sunset machine gun, it will make sense that this machine gun will find a nice home in PvP."
        },
        {
            "hash": 3624844116,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    1820235745
                ],
                [
                    4293542123
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 3624844116,
            "plugs": [
                [
                    3250034553,
                    1482024992
                ],
                [
                    3142289711
                ],
                [
                    2450788523,
                    1359896290
                ],
                [
                    1890422124
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 3624844116,
            "plugs": [
                [
                    3250034553
                ],
                [
                    3142289711
                ],
                [
                    2450788523
                ],
                [
                    1890422124
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2759251821,
            "plugs": [
                [
                    839105230,
                    4090651448
                ],
                [
                    1087426260,
                    106909392,
                    2420895100
                ],
                [
                    1820235745,
                    2010801679,
                    2869569095
                ],
                [
                    4293542123,
                    557221067,
                    2896038713
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Unwavering Duty is the Hammerhead of year 5. The only major differences are that Hammerhead has +2 range, but -4 reload speed, +5 bullets in the magazine and +18 aim assist. They will still feel very comparable. The difference in stats will feel negligible, and the loss in bullets can be made up for via subsistence or ambitious assassin. Incandescent and killing tally are both S tier perks. Focused fury will be useful if this becomes your main dps weapon or machine guns get a sizeable PvE damage buff.\n\nUnwavering Duty will also feel right at home in the crucible. Dynamic sway reduction or killing wind are the best in slot perks. Either will depend on your input and if you want a neutral perk or a lethality perk. While Unwavering Duty isn't able to take advantage of damage perks like rampage or high-impact reserves, it will be able to slot adept mods and take advantage of free stats. Having already pretty similar stats to our favorite sunset machine gun, it will make sense that this machine gun will find a nice home in PvP."
        },
        {
            "hash": 2759251821,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    1820235745
                ],
                [
                    4293542123
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2759251821,
            "plugs": [
                [
                    3250034553,
                    1482024992
                ],
                [
                    3142289711
                ],
                [
                    2450788523,
                    1359896290
                ],
                [
                    1890422124
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 2759251821,
            "plugs": [
                [
                    3250034553
                ],
                [
                    3142289711
                ],
                [
                    2450788523
                ],
                [
                    1890422124
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2276328320,
            "plugs": [
                [
                    3661387068
                ],
                [
                    3230963543
                ],
                [
                    776531651,
                    2946784966
                ],
                [
                    2610012052,
                    1015611457
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "This is Season 19's ritual weapon. Veles-X is an aggressive burst pulse rifle that doesn't need a raid to acquire. This is the first time since Black Armory that we can find this archetype in the \"wild.\" Insidious and Sacred Provenance are both native to raids. Veles-X is a way to feel out this archetype with a clear path to acquire. It has a pretty good standard roll. Every roll has chambered compensator and flared magwell for better recoil and better reload and stability. Repulsor brace is the only let down for me. If you are a void subclass main, it can be incredible to have a 45 health overshield on demand but having to stay on void lets it down a little bit. Neutrally, tunnel vision is easy to proc and you don't have to think about it at all or set your subclass for it to work. If you happen to use void, however, getting golden tricorn 2x should be a cakewalk. The synergy is there to take this gun with echo of instability. Get a kill with Veles-X first, throw a grenade and get volatile rounds. You have golden tricorn 2x, this can stack with font of might for insane damage output. You have volatile rounds for add clear and if you get the kill you'll have a small overshield to use. This is incredible for almost all activities. Unless you can't get the grenade kill easily I would keep this in your inventory.\n\nVeles-X will still have some incredible usefulness in PvP as well. Tunnel vision and kill clip are perfect with one another. At base you have an incredible pulse that can two burst. With kill clip it makes that two burst more forgiving but you also have tunnel vision for more aim assist. With the recent change to kill clip and tunnel vision, both can be refreshed so it keeps both perks active whenever you get a kill."
        },
        {
            "hash": 2276328320,
            "plugs": [
                [
                    3661387068
                ],
                [
                    3230963543
                ],
                [
                    776531651
                ],
                [
                    2610012052
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2276328320,
            "plugs": [
                [
                    3661387068
                ],
                [
                    3230963543
                ],
                [
                    2946784966
                ],
                [
                    1015611457
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 2276328320,
            "plugs": [
                [
                    3661387068
                ],
                [
                    3230963543
                ],
                [
                    2946784966
                ],
                [
                    1015611457
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 3183283212,
            "plugs": [
                [
                    3525010810,
                    1441682018,
                    3798852852
                ],
                [
                    3032599245,
                    3301904089
                ],
                [
                    2396489472,
                    3300816228,
                    2869569095
                ],
                [
                    4104185692,
                    2610012052,
                    3194351027
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Wendigo is back! It now has random rolls and access to way more things than it used to. Is the current meta open enough to allow Wendigo to flex its tired muscles? I think so. GLs aren't oppressive in PvP but they offer better in between than a rocket or a machine gun. It can clear rooms quickly and do decent single target damage. With a linear fusion rifle nerf incoming we might see a rise in grenade launcher usage. With Wendigo being at the top of the list. Spike will give you damage, but better utility might be blinding. If you want to go all into damage, spike grenades, golden tricorn, adept big ones, and font of might will give you some incredible damage output. It's a lot harder to upkeep on a grenade launcher, and especially when you're dealing with a boss with limited fodder you might not be able to sustain golden tricorn 2x. Even with that set up you will have some great burst damage.\n\nWendigo is interesting in PvP. I wouldn't use it, but I also wouldn't be upset with someone if they did. It has utility and it can work similar to other grenade launchers. Proximity grenades adds forgiveness and flexibility. Impulse amplifier makes it more of a pocket rocket launcher, and rangefinder will just make whatever arc the grenade has minimal. Another good shout is explosive light. If you hold onto your explosive light shots, or build it up without having power ammo, you will have even more flexibility with the added damage, and be able to counter supers with ease."
        },
        {
            "hash": 3183283212,
            "plugs": [
                [
                    3525010810
                ],
                [
                    3032599245
                ],
                [
                    2396489472
                ],
                [
                    4104185692
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 3183283212,
            "plugs": [
                [
                    3525010810,
                    3798852852,
                    3809316345
                ],
                [
                    409831596
                ],
                [
                    951095735
                ],
                [
                    2846385770,
                    3194351027
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 3183283212,
            "plugs": [
                [
                    3525010810
                ],
                [
                    409831596
                ],
                [
                    951095735
                ],
                [
                    2846385770
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 555148853,
            "plugs": [
                [
                    3525010810,
                    1441682018,
                    3798852852
                ],
                [
                    3032599245,
                    3301904089
                ],
                [
                    2396489472,
                    3300816228,
                    2869569095
                ],
                [
                    4104185692,
                    2610012052,
                    3194351027
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Wendigo is back! It now has random rolls and access to way more things than it used to. Is the current meta open enough to allow Wendigo to flex its tired muscles? I think so. GLs aren't oppressive in PvP but they offer better in between than a rocket or a machine gun. It can clear rooms quickly and do decent single target damage. With a linear fusion rifle nerf incoming we might see a rise in grenade launcher usage. With Wendigo being at the top of the list. Spike will give you damage, but better utility might be blinding. If you want to go all into damage, spike grenades, golden tricorn, adept big ones, and font of might will give you some incredible damage output. It's a lot harder to upkeep on a grenade launcher, and especially when you're dealing with a boss with limited fodder you might not be able to sustain golden tricorn 2x. Even with that set up you will have some great burst damage.\n\nWendigo is interesting in PvP. I wouldn't use it, but I also wouldn't be upset with someone if they did. It has utility and it can work similar to other grenade launchers. Proximity grenades adds forgiveness and flexibility. Impulse amplifier makes it more of a pocket rocket launcher, and rangefinder will just make whatever arc the grenade has minimal. Another good shout is explosive light. If you hold onto your explosive light shots, or build it up without having power ammo, you will have even more flexibility with the added damage, and be able to counter supers with ease."
        },
        {
            "hash": 555148853,
            "plugs": [
                [
                    3525010810
                ],
                [
                    3032599245
                ],
                [
                    2396489472
                ],
                [
                    4104185692
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 555148853,
            "plugs": [
                [
                    3525010810,
                    3798852852,
                    3809316345
                ],
                [
                    409831596
                ],
                [
                    951095735
                ],
                [
                    2846385770,
                    3194351027
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 555148853,
            "plugs": [
                [
                    3525010810
                ],
                [
                    409831596
                ],
                [
                    951095735
                ],
                [
                    2846385770
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2306182339,
            "plugs": [
                [
                    3525010810,
                    1441682018,
                    3798852852
                ],
                [
                    3032599245,
                    3301904089
                ],
                [
                    3300816228,
                    3523296417,
                    3108830275
                ],
                [
                    1683379515,
                    4104185692,
                    1546637391
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Wilderflight is an incredibly unique weapon. Similar to Warden's Law it fires two grenades at once. This does mean that the grenades can split off and you'd only be doing half damage. The double grenades do have two impact damages which does put them ahead of regular grenade launchers. Auto-loading holster is still the best for fire-and-forget. Disruption break is always going to be a strong pick, especially on impacts for demolishing shields. Frenzy and vorpal can work if you're primarily going to be using Wilderflight as your main source of damage instead of setting up yourself or your team for kinetic damage.\n\nI don't know how to feel about Wilderflight in PvP. Technically you can do more damage with double impact, and have some forgiveness with proximity grenades. But it also means that the architecture can really mess you up if you go to bounce shot and it splits the grenades into two different directions. I have yet to fully test out the full damage of each grenade, but disruption break will still probably be then play. Being able to hit one grenade and break a shield will give your kinetic 50% more damage which will definitely drop any guardian with ease."
        },
        {
            "hash": 2306182339,
            "plugs": [
                [
                    3525010810
                ],
                [
                    3032599245
                ],
                [
                    3300816228
                ],
                [
                    1683379515
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2306182339,
            "plugs": [
                [
                    3525010810,
                    3798852852,
                    3809316345
                ],
                [
                    409831596,
                    2822142346
                ],
                [
                    3300816228,
                    3523296417
                ],
                [
                    1683379515,
                    691659142,
                    11612903
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 2306182339,
            "plugs": [
                [
                    3525010810
                ],
                [
                    409831596
                ],
                [
                    3300816228
                ],
                [
                    1683379515
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 396910433,
            "plugs": [
                [
                    3666208348
                ],
                [
                    269888150
                ],
                [
                    3108830275
                ],
                [
                    2396489472
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Zephyr was my favorite looking sword (right up until Hero of Ages released). It just looks cool. Besides the general Stasis sword go ColdSteel (brrrrrrrr) I would also recommend another roll. Unrelenting to get your health back and chain reaction for STASIS BOOM. Come on, that's gonna be sweet.\n\nIn PvP there isn't a lot to talk about, swords aren't really hot commodities within PvP and those that use swords are mostly using eager edge. Zephyr looks amazing but looks won't win you crucible matches. Grenades will. #ShaxxSponsored."
        },
        {
            "hash": 396910433,
            "plugs": [
                [
                    3666208348
                ],
                [
                    269888150
                ],
                [
                    3108830275
                ],
                [
                    2396489472
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 396910433,
            "plugs": [
                [
                    3666208348
                ],
                [
                    269888150
                ],
                [
                    2590710093
                ],
                [
                    354401740
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 396910433,
            "plugs": [
                [
                    3666208348
                ],
                [
                    269888150
                ],
                [
                    2590710093
                ],
                [
                    354401740
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        }
    ]
}