{
    "name": "Pandapaxxy's Controller rolls - Season 23",
    "description": "Recommendations based on Pandapaxxy's breakdowns on r/sharditorkeepit for Controller on Season 23 weapons.",
    "data": [
        {
            "hash": 4097972038,
            "plugs": [
                [
                    1300023272,
                    4090651448
                ],
                [
                    791862061,
                    1087426260,
                    106909392
                ],
                [
                    968510818,
                    1631667848,
                    776531651
                ],
                [
                    2679249093,
                    2360754333,
                    2048641572
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "A Sudden Death is not a great shotgun for PvE, while you do have Envious Assassin and One-Two Punch which together allow you to never worry about reloading, I find rapid-fire frames at the opposite end of the shotgun spectrum better for One-Two Punch. Trench Barrel and Grave Robber are great combinations for \"maining\" this shotgun but an even better combination would be Destabilizing Rounds and Repulsor Brace, the issue with this combo is that it's a shotgun and not a primary ammo weapon.\nMasterworks: Range, Stability, Handling, Reload Speed"
        },
        {
            "hash": 4097972038,
            "plugs": [
                [
                    1300023272
                ],
                [
                    791862061
                ],
                [
                    968510818
                ],
                [
                    2679249093
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 4097972038,
            "plugs": [
                [
                    1300023272,
                    1482024992
                ],
                [
                    3142289711,
                    791862061
                ],
                [
                    4071163871,
                    3511092054,
                    3161816588
                ],
                [
                    47981717
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "I used all my \"creator\" luck on my own personal Sudden Death, which I am very happy with. Threat Detector and Opening Shot are going to be the tried and true combinations. If you rock exotics like Ophidians, Dragon's Shadow, or even Speedloader Slacks you can go with Slideshot, and those who love arc will love Elemental Capacitor. Opening Shot regardless of third column perk is still your best bet.\nMasterworks: Range, or Handling"
        },
        {
            "hash": 4097972038,
            "plugs": [
                [
                    1300023272
                ],
                [
                    3142289711
                ],
                [
                    4071163871
                ],
                [
                    47981717
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 250721843,
            "plugs": [
                [
                    3666208348,
                    2827049491,
                    938542991
                ],
                [
                    269888150,
                    3625355092,
                    52780822
                ],
                [
                    1749209109,
                    3705817207,
                    2030760728
                ],
                [
                    4274614370,
                    4293542123,
                    3913600130
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "What a missed opportunity for an underutilized sword to have a specific niche. How interesting would it be if Bungie introduced a double zoom sword. Valiant Charge and Eager Edge. Swap to the sword for your first zoom, block on your way for a second. Be able to zoom in two different directions or one direction for a huge zoooom. Without that it falls into a large category of underused adaptive frame swords.\nMasterworks: Impact"
        },
        {
            "hash": 250721843,
            "plugs": [
                [
                    3666208348
                ],
                [
                    269888150
                ],
                [
                    1749209109
                ],
                [
                    4274614370
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 250721843,
            "plugs": [
                [
                    3666208348,
                    2827049491,
                    938542991
                ],
                [
                    269888150,
                    3625355092,
                    52780822
                ],
                [
                    2590710093
                ],
                [
                    4274614370
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "As with most adaptive frame swords, they're not great in PvP. At least not this one. Valiant Charge is great for closing the distance but it's not incredible\nMasterworks: Impact"
        },
        {
            "hash": 250721843,
            "plugs": [
                [
                    3666208348
                ],
                [
                    269888150
                ],
                [
                    2590710093
                ],
                [
                    4274614370
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2993554824,
            "plugs": [
                [
                    839105230,
                    1482024992
                ],
                [
                    1087426260,
                    1968497646,
                    3230963543
                ],
                [
                    2779035018,
                    243981275,
                    3017780555,
                    1171147302,
                    984655331,
                    4223976499
                ],
                [
                    2610012052,
                    4293542123,
                    4290541820,
                    2675184851
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Adhortative is an adaptive solar pulse rifle most similar to Forge's Pledge. Adhortative has better range, handling, and recoil direction, while losing in stability, reload speed and airborne effectiveness. Either pulse is only better than the other by less than 3 points in each category, except for airborne effectiveness and recoil direction, 9 and 10 respectively. Between these two for PvE, Adhortative wins purely for having a reload perk in Feeding Frenzy. If you don't care about that, either can work.\nMasterworks: Reload Speed"
        },
        {
            "hash": 2993554824,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    2779035018,
                    1171147302
                ],
                [
                    2610012052,
                    4290541820
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2993554824,
            "plugs": [
                [
                    839105230,
                    1482024992,
                    3250034553
                ],
                [
                    1885400500,
                    1561002382
                ],
                [
                    2779035018,
                    1821614984,
                    1171147302,
                    1942880504
                ],
                [
                    460017080,
                    588594999,
                    4045335048,
                    2717805783
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "With such a similar pulse existing in PvP it comes down to perks. Forge's Pledge gets access to Accurized and Steady Rounds, while Adhortative comes with High-Caliber and Ricochet Rounds. Forge's Pledge comes with Zen Moment and Elemental Capacitor for big bonuses in stats, while Adhortative has Headseeker or Incandescent for better neutrality or some AoE. Depending on your preferred play style you might prefer one over the other, but I cannot emphasize this enough: both can work wonders.\nMasterworks: Stability"
        },
        {
            "hash": 2993554824,
            "plugs": [
                [
                    839105230
                ],
                [
                    1885400500
                ],
                [
                    2779035018,
                    1171147302
                ],
                [
                    460017080,
                    4045335048
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1013434963,
            "plugs": [
                [
                    4090651448,
                    1840239774
                ],
                [
                    1087426260,
                    106909392,
                    3230963543
                ],
                [
                    1820235745,
                    2779035018
                ],
                [
                    95528736,
                    365154968,
                    3891536761
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Precision frame submachine guns are not good in PvE content, their low handling, reload speed, and stability are all important factors when mowing down waves of enemies. Subsistence and Feeding Frenzy both improve one of those limitations but I wouldn't invest into those to make up for it. Onslaught will make Adjudicator feel more like other archetypes but won't replace them.\nMasterworks: Reload Speed"
        },
        {
            "hash": 1013434963,
            "plugs": [
                [
                    4090651448
                ],
                [
                    1087426260
                ],
                [
                    1820235745
                ],
                [
                    95528736
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1013434963,
            "plugs": [
                [
                    3250034553,
                    1482024992
                ],
                [
                    3142289711
                ],
                [
                    1359896290,
                    2846385770,
                    1428297954
                ],
                [
                    365154968,
                    95528736,
                    2451262963
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Adjudicator is back and I was really hoping for a replacement for my Antiope-D, while this isn't it I can confidently use this for a similar feel. Dynamic Sway Reduction will keep those bullets tight and on target while Target Lock will adjust your optimal TtK. Onslaught is probably going to be on my personal roll, but I'll have to actually get it to drop first.\nMasterworks: Range"
        },
        {
            "hash": 1013434963,
            "plugs": [
                [
                    3250034553
                ],
                [
                    3142289711
                ],
                [
                    1359896290
                ],
                [
                    365154968
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2680976411,
            "plugs": [
                [
                    1934171651
                ],
                [
                    679225683
                ],
                [
                    2859149211
                ],
                [
                    1782407750
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "I don't know how often this glaive will be used over the crafted glaives but there's a nice niche between Beacon Rounds and Close to Melee. If you get any glaive kill you'll activate Beacon Rounds, with the added tracking you can shoot off in the general direction of a thrall and with that kill you'll activate Close to Melee to deal an extra 30% more melee damage. Any additional damage with your melee or projectile you'll keep up Beacon Rounds and Close to Melee to continue the chaining of better tracking and better damage.\nMasterworks: Range"
        },
        {
            "hash": 2680976411,
            "plugs": [
                [
                    1934171651
                ],
                [
                    679225683
                ],
                [
                    2859149211
                ],
                [
                    1782407750
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2680976411,
            "plugs": [
                [
                    580685494
                ],
                [
                    679225683
                ],
                [
                    3619207468
                ],
                [
                    2610012052
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "With Auxiliary Reserves you get some great shield duration. With Light Mag and Keep Away you negate the reload speed loss from Auxiliary Reserves. All the range gives you a velocity of 130 m/s which is 1.11x times faster than the base 117 m/s. This extra speed will make the hit registration feel better. If you can manage to get Golden Tricorn 2x with one surge mod you can one hit kill any guardian 6 resilience or below. As you add one surge mod you can down an additional resilience tier. It scales 1:1.\nMasterworks: Range"
        },
        {
            "hash": 2680976411,
            "plugs": [
                [
                    580685494
                ],
                [
                    679225683
                ],
                [
                    3619207468
                ],
                [
                    2610012052
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 4153087276,
            "plugs": [
                [
                    1840239774,
                    1482024992,
                    4090651448
                ],
                [
                    732557052,
                    2680121939,
                    2749775325
                ],
                [
                    3643424744,
                    2284787283,
                    3523296417,
                    2682205016,
                    3563868667,
                    1906147653
                ],
                [
                    557221067,
                    124408337,
                    4049631843,
                    2896748467,
                    1171887445,
                    859780267
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Appetence is our first weapon. Being a stasis trace rifle already gives Appetence viability in a lot of loadouts. No longer are you tied to Ager's Scepter for a \"kinetic\" trace rifle. Appetence is also legendary so you open up a plethora of loadout possibilities. In PvE you can make the most of this trace rifle with Overflow and Killing Tally for a 21% Delirium-lite. Being able to walk over bricks of special to double the magazine capacity keeps Killing Tally primed and ready to rip into any wave of enemy you might have in front of you. If you prefer a more calculated approach or don't want to use just one weapon, Headstone is extremely strong with the buffed Stasis subclasses.\nMasterworks: Reload Speed"
        },
        {
            "hash": 4153087276,
            "plugs": [
                [
                    1840239774
                ],
                [
                    732557052
                ],
                [
                    3643424744,
                    2682205016
                ],
                [
                    557221067,
                    2896748467
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 4153087276,
            "plugs": [
                [
                    3250034553,
                    1482024992,
                    4090651448
                ],
                [
                    2969185026,
                    732557052
                ],
                [
                    3828510309,
                    3523296417,
                    3643424744,
                    1771736209,
                    1906147653,
                    2682205016
                ],
                [
                    124408337,
                    557221067,
                    3592538738,
                    1171887445,
                    2896748467,
                    2675361166
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Taking Appetence into the crucible might be a big test of your patience. Already having low ammo, and the current economy of ammo bricks will severely limit your overall usage. If you can horde ammo bricks like Scrooge you can certainly make this weapon work better. Enlightened Action will make the weapon feel better, and Headstone can deny revives or build into the Stasis subclass like in PvE. Killing Tally can work if you use nothing but this trace rifle but I wouldn't advise it.\nMasterworks: Range"
        },
        {
            "hash": 4153087276,
            "plugs": [
                [
                    3250034553
                ],
                [
                    2969185026
                ],
                [
                    3828510309,
                    1771736209
                ],
                [
                    124408337,
                    1171887445
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 4220529694,
            "plugs": [
                [
                    839105230
                ],
                [
                    2420895100
                ],
                [
                    3418782618
                ],
                [
                    1546637391
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "How many bullets can you shoot before reloading? Will this be a power weapon alternative of Sweet Business? Quite possibly. With Actium War Rig, Extended Mag, and Rewind Rounds you'll never have to reload before the target is dead. Especially so if you stack on damage from a spec mod and Vorpal Weapon.\nMasterworks: Reload"
        },
        {
            "hash": 4220529694,
            "plugs": [
                [
                    839105230
                ],
                [
                    2420895100
                ],
                [
                    3418782618
                ],
                [
                    1546637391
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 4220529694,
            "plugs": [
                [
                    839105230
                ],
                [
                    3177308360
                ],
                [
                    1359896290
                ],
                [
                    4293542123
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "While you don't see many machine guns running around in the crucible, you can with Avalanche. Arrowhead Brake brings up the recoil direction to 100. Adding in either range or stability (or both) with Dynamic Sway Reduction will make the shooting experience enjoyable. Incandescent is a bit of an odd choice but being able to apply some Scorch and make the second kill easier will allow you to go on a nice spree.\nMasterworks: Stability"
        },
        {
            "hash": 4220529694,
            "plugs": [
                [
                    839105230
                ],
                [
                    3177308360
                ],
                [
                    1359896290
                ],
                [
                    4293542123
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2313726158,
            "plugs": [
                [
                    839105230,
                    1840239774,
                    1482024992
                ],
                [
                    1087426260,
                    1968497646,
                    3230963543
                ],
                [
                    1546637391,
                    247725512,
                    3619207468
                ],
                [
                    1015611457,
                    831391274,
                    3993379141
                ],
                [
                    1067908860,
                    1067908860
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "This season's Competitive weapon. Belisarius-D is already making waves as one of the strongest pulse rifles with a ton of combinations. It might not be as good as pre-nerf No Time to Explain, but it certainly holds its own in our current Meta. Arrowhead isn't necessary with our deterministic recoil, but I found the bursts a bit tighter and easier to control. I like that Vorpal Weapon can be paired with Kill Clip for extra damage against majors and champions. Rapid Hit is a better neutral perk for cleaning up the burst and adding much needed reload speed.\nMasterworks: Stability"
        },
        {
            "hash": 2313726158,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    1546637391
                ],
                [
                    1015611457
                ],
                [
                    1067908860
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2313726158,
            "plugs": [
                [
                    839105230,
                    3661387068,
                    1482024992
                ],
                [
                    1885400500,
                    1561002382
                ],
                [
                    247725512,
                    3619207468,
                    699525795
                ],
                [
                    460017080,
                    1015611457,
                    588594999
                ],
                [
                    1067908860,
                    990298390,
                    3465198467
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Belisarius-D comes from the crucible, and it belongs in the crucible. Rapid Hit and Headseeker are fantastic neutral perks that no one would argue belong together. Keep Away and Moving Target can substitute as well for a very strong neutral weapon. Eye of the Storm is conditional in that you will have to take damage, but the benefits far outweigh the drawbacks. In the crucible you will be taking damage, so getting some extra benefits alongside that is all upsides. Kill Clip doesn't change the time to kill enough to be noticeable unless you hit nothing but headshots. In which case you'll drop down to a 0.60 TtK with 6 crits on Tier 8 Resilience or below. Without Kill Clip on those higher tiered resilience levels you'll need 1 extra bullet, either way it still remains a two-burst as you won't stop the burst mid-burst.\nMasterworks: Stability"
        },
        {
            "hash": 2313726158,
            "plugs": [
                [
                    839105230
                ],
                [
                    1885400500
                ],
                [
                    247725512
                ],
                [
                    460017080
                ],
                [
                    1067908860
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2026755633,
            "plugs": [
                [
                    839105230,
                    1482024992,
                    1840239774
                ],
                [
                    3230963543,
                    1087426260,
                    1968497646
                ],
                [
                    1820235745,
                    2779035018,
                    3619207468
                ],
                [
                    95528736,
                    3891536761
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Breakneck returns to us in all its glory. Onslaught paired with Subsistence gives you the best of both worlds. A faster shot and Actium War Rig-lite. Feeding Frenzy is a nice second but you don't want to stop firing to lose the damage buff. Onslaught itself also gives you a nice bonus to reload on its own. The obvious choice then is to bump up the magazine and recoil direction to make shooting last longer and be a little easier at those maximum stacks.\nMasterworks: Handling"
        },
        {
            "hash": 2026755633,
            "plugs": [
                [
                    839105230
                ],
                [
                    3230963543
                ],
                [
                    1820235745
                ],
                [
                    95528736
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2026755633,
            "plugs": [
                [
                    839105230,
                    3250034553,
                    1482024992
                ],
                [
                    1885400500,
                    1561002382
                ],
                [
                    1359896290,
                    3619207468,
                    3828510309
                ],
                [
                    1890422124,
                    588594999,
                    3673922083
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Breakneck is one of those weapons where if you like it, you'll use it everywhere no matter what. It isn't incredible in the crucible, but it can hold its own as a precision frame auto rifle. Breakneck gets a touch of SUROS Regime by either speeding up the RPM post kill with Onslaught or slowing it down with Adagio. Depending on how you play, one might feel better than the other. If you're not looking for a legendary SUROS I'd recommend consistency perks to have a reliable precision frame from gunfight to gunfight.\nMasterworks: Range"
        },
        {
            "hash": 2026755633,
            "plugs": [
                [
                    839105230
                ],
                [
                    1885400500
                ],
                [
                    1359896290
                ],
                [
                    1890422124
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 3438139008,
            "plugs": [
                [
                    938542991
                ],
                [
                    52780822
                ],
                [
                    1749209109,
                    776531651
                ],
                [
                    243981275,
                    2048641572
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Our full ritual playlist weapon is an interesting one. Caster frame swords have not been strong since their introduction. So Bungie is either testing us to see if they should buff caster frames or trying to get more hands on feedback. I feel like caster frames are a tough one to balance. Give them too much damage and they become an extremely safe pick in everyday play. Lower the ammo requirements and you will inadvertently buff their DPS as you'll have more opportunities to use the heavy attack. Lower their charge time to counterbalance either of those changes and we're back to square one. Chivalric Fire is a great neutral sword that works best on Void subclasses, but you can utilize either orb generation or volatility to great success without committing to Void.\nMasterworks: Impact"
        },
        {
            "hash": 3438139008,
            "plugs": [
                [
                    938542991
                ],
                [
                    52780822
                ],
                [
                    1749209109
                ],
                [
                    243981275
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 3438139008,
            "plugs": [
                [
                    938542991
                ],
                [
                    52780822
                ],
                [
                    1749209109,
                    776531651
                ],
                [
                    2048641572
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "I would not recommend using these swords in PvP. They have utility as a legendary Black Talon, but the tracking is horrendous comparatively.\nMasterworks: Impact"
        },
        {
            "hash": 3438139008,
            "plugs": [
                [
                    938542991
                ],
                [
                    52780822
                ],
                [
                    1749209109
                ],
                [
                    2048641572
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 3206190066,
            "plugs": [
                [
                    1482024992
                ],
                [
                    3230963543
                ],
                [
                    1820235745
                ],
                [
                    4104185692
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "While there aren't a lot of amazing submachine guns, Cold Front is reliable in that we get Subsistence and Frenzy for low level PvE activities. It's not going to replace any of your more specified submachine guns for any particular subclass. But if you want something to turn your brain off and still clear rooms with ease. Cold Front can be it.\nMasterworks: Stability"
        },
        {
            "hash": 3206190066,
            "plugs": [
                [
                    1482024992
                ],
                [
                    3230963543
                ],
                [
                    1820235745
                ],
                [
                    4104185692
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 3206190066,
            "plugs": [
                [
                    1392496348
                ],
                [
                    3230963543
                ],
                [
                    1890422124
                ],
                [
                    2846385770
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Now I know what you're saying, Rangefinder was nerfed. I know it was. But having lower range for the SMG class you'll feel some of the forgiveness factors from Rangefinder coupled with Tap the Trigger bringing you better accuracy and stability.\nMasterworks: Stability"
        },
        {
            "hash": 3206190066,
            "plugs": [
                [
                    1392496348
                ],
                [
                    3230963543
                ],
                [
                    1890422124
                ],
                [
                    2846385770
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1719687748,
            "plugs": [
                [
                    3525010810,
                    3798852852,
                    1441682018
                ],
                [
                    3796465595
                ],
                [
                    968510818,
                    1523832109,
                    2284787283
                ],
                [
                    3194351027
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Crux Termination IV is an incredibly strong weapon this season. Not only does it get access to one of the best damage perks but also some of the best mag extending perks. Explosive Light and your choice of Reconstruction, Envious Assassin, or even Clown Cartridge are all great within their own right. Impact Casing is nice for additional damage, but it isn't extremely mandatory.\nMasterworks: Velocity"
        },
        {
            "hash": 1719687748,
            "plugs": [
                [
                    3525010810
                ],
                [
                    3796465595
                ],
                [
                    968510818
                ],
                [
                    3194351027
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1719687748,
            "plugs": [
                [
                    3525010810,
                    3798852852,
                    1441682018
                ],
                [
                    2822142346
                ],
                [
                    3161816588,
                    1523832109
                ],
                [
                    3194351027,
                    3523296417,
                    3977735242
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Slideshot on a rocket is certainly interesting. I wouldn't recommend it as a meta choice but more of a novelty. Is it niche? For sure. Will you pick up ammo, and be able to slide to reload back to back shots? Not outside of Mayhem. Would it be cool? I think this gun speaks for itself.\nMasterworks: Velocity"
        },
        {
            "hash": 1719687748,
            "plugs": [
                [
                    3525010810
                ],
                [
                    2822142346
                ],
                [
                    3161816588
                ],
                [
                    3194351027
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 435821040,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260,
                    1968497646,
                    3230963543
                ],
                [
                    3017780555,
                    1820235745
                ],
                [
                    4293542123,
                    1015611457
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Darkest Before is now changed up and swapped to solar. With this change it synergizes better with solar subclass verbs. Heal Clip and Incandescent are fantastic together and allow you to push out your engagement ranges a bit further because it's a pulse rifle. The issue I have with this is that Darkest Before is a rapid-fire frame, meaning it does really low damage per shot. Sometimes needing two or even three bursts for a red bar. Almost any other frame would be incredible. What a shame.\nMasterworks: Reload Speed"
        },
        {
            "hash": 435821040,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    3017780555
                ],
                [
                    4293542123
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 435821040,
            "plugs": [
                [
                    839105230
                ],
                [
                    1885400500,
                    1561002382
                ],
                [
                    3511092054,
                    3017780555
                ],
                [
                    460017080,
                    1015611457,
                    4293542123
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Darkest Before in PvP lost a little bit of arc shenanigans, but gained a better perk pool. Elemental Capacitor and Headseeker will make for an extremely consistent or snappy pulse on void or solar, respectively. Kill Clip and Heal Clip together make for a lethal and synergistic build. I don't foresee Darkest Before becoming the king of pulses, but definitely a top contender for those rapid-fires.\nMasterworks: Stability"
        },
        {
            "hash": 435821040,
            "plugs": [
                [
                    839105230
                ],
                [
                    1885400500
                ],
                [
                    3511092054
                ],
                [
                    460017080
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1501688142,
            "plugs": [
                [
                    839105230
                ],
                [
                    689005463,
                    2680121939,
                    1483536627
                ],
                [
                    968510818,
                    1523832109,
                    424370782,
                    461595545
                ],
                [
                    555281244,
                    2610012052,
                    3708227201,
                    332733060,
                    4290541820,
                    781192741
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "We have ourselves the second craftable non-raid aggressive frame linear fusion rifle. Holy traveler. Say that sentence 5 times fast. I think Doomed Petitioner will be slightly more used over Fire and Forget due to a reload bypassing perk in Reconstruction. Pair that with either Golden Tricorn on void or Precision Instrument to really crank up those stacks within two shots. Envious Assassin works well if you're slaying enemies before your damage phase while Reconstruction works well passively.\nMasterworks: Charge Time"
        },
        {
            "hash": 1501688142,
            "plugs": [
                [
                    839105230
                ],
                [
                    689005463
                ],
                [
                    968510818,
                    424370782
                ],
                [
                    555281244,
                    332733060
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1501688142,
            "plugs": [
                [
                    1840239774
                ],
                [
                    689005463,
                    2969185026
                ],
                [
                    3619207468,
                    4071163871,
                    3198323828,
                    494941759
                ],
                [
                    588594999,
                    2717805783
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "I adore these fusions for PvP, they just feel nice. Unfortunately they're only slightly outclassed by grenade launchers in our current meta and swords are way more mobile. This doesn't leave a lot of room for them to shine. Keep Away and Moving Target will buff your accuracy and aim assist while also giving a nice bonus to range and movement, respectfully. You'll want to lower the charge time as low as you can and the origin trait will also help with that.\nMasterworks: Charge Time"
        },
        {
            "hash": 1501688142,
            "plugs": [
                [
                    1840239774
                ],
                [
                    689005463
                ],
                [
                    3619207468,
                    3198323828
                ],
                [
                    588594999,
                    2717805783
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 105164264,
            "plugs": [
                [
                    3666208348,
                    2827049491,
                    938542991
                ],
                [
                    269888150,
                    3625355092,
                    52780822
                ],
                [
                    3705817207,
                    1749209109,
                    776531651
                ],
                [
                    2048641572,
                    4274614370,
                    3913600130
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Adaptive frame swords in PvE are a dime a dozen. There are not a lot of compelling reasons to go for this sword unless you have yet to find the Repulsor Brace / Destabilizing Rounds Nasreddin in the wild.\nMasterworks: Impact"
        },
        {
            "hash": 105164264,
            "plugs": [
                [
                    3666208348
                ],
                [
                    269888150
                ],
                [
                    3705817207
                ],
                [
                    2048641572
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 105164264,
            "plugs": [
                [
                    3666208348,
                    2827049491,
                    938542991
                ],
                [
                    269888150,
                    3625355092,
                    52780822
                ],
                [
                    2590710093,
                    2030760728
                ],
                [
                    4274614370,
                    354401740
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "I wouldn't use this sword over a zoom sword in PvP.\nMasterworks: Impact"
        },
        {
            "hash": 105164264,
            "plugs": [
                [
                    3666208348
                ],
                [
                    269888150
                ],
                [
                    2590710093
                ],
                [
                    4274614370
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 3668817296,
            "plugs": [
                [
                    3666208348,
                    2827049491,
                    938542991
                ],
                [
                    269888150,
                    3625355092,
                    52780822
                ],
                [
                    923806249,
                    3705817207,
                    3108830275
                ],
                [
                    831391274,
                    2396489472,
                    2610012052
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Dragoncult Sickle is our last dungeon weapon. Being a strand caster frame might actually benefit the toolkit a bit more. Being able to spread Sever through Slice and Chain Reaction or spawn Threadlings from a distance makes this weapon an incredibly strong addition to an all Strand loadout. It might not be the best for boss damage or the best for add clear, but I think it will find a nice home in some Strand loadouts.\nMasterworks: Impact"
        },
        {
            "hash": 3668817296,
            "plugs": [
                [
                    3666208348
                ],
                [
                    269888150
                ],
                [
                    923806249
                ],
                [
                    831391274
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 3668817296,
            "plugs": [
                [
                    3666208348,
                    2827049491,
                    938542991
                ],
                [
                    269888150,
                    3625355092,
                    52780822
                ],
                [
                    354401740
                ],
                [
                    2396489472
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Dragoncult Sickle might have some utility in PvE but PvP is not as forgiving. Assassin's Blade allows you to run a bit faster when you get a kill, and chain reaction will allow you to get some cheeky double kills or team wipes. I like the idea of caster frames in PvP but in practice you're better of using another sword.\nMasterworks: Impact"
        },
        {
            "hash": 3668817296,
            "plugs": [
                [
                    3666208348
                ],
                [
                    269888150
                ],
                [
                    354401740
                ],
                [
                    2396489472
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1401300690,
            "plugs": [
                [
                    839105230,
                    1840239774,
                    4090651448
                ],
                [
                    1087426260,
                    106909392,
                    3230963543
                ],
                [
                    1428297954,
                    2866798147
                ],
                [
                    1771339417,
                    1546637391,
                    555281244
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Here is a weapon that should not see much use in PvE. Unsurprisingly a PvP weapon is good in PvP, Eye of Sol returns but without Outlaw, Field Prep, or any real good reload perk. Nothing exists on Eye of Sol that will propel it to see any use in general PvE other than to practice for PvP. The best damage perk is either Firing Line or Vorpal Weapon. Precision Instrument is great but you'll almost ever see the full benefits of it.\nMasterworks: Reload Speed"
        },
        {
            "hash": 1401300690,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    1428297954
                ],
                [
                    1771339417
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1401300690,
            "plugs": [
                [
                    1840239774,
                    839105230,
                    4090651448
                ],
                [
                    3142289711
                ],
                [
                    588594999,
                    1428297954,
                    2451262963
                ],
                [
                    957782887,
                    47981717,
                    1546637391
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "I am glad Eye of Sol is back but if it is better than before will depend on how you view it. Snapshot Sights and Opening Shot in the same column still means those with the OG Eye of Sol are still winning. Moving Target is a great secondary, but there's one version I am really interested in.\n\nHammer-Forged Rifling / Accurized Rounds / Slickdraw / Snapshot Sights / Range MW / Alacrity / Targeting Adept Mod.\n\nWith this roll you'll have 100 range, 100 handling, and 88 aim assist. This will completely negate the loss from Slickdraw and feel incredible. I know my roll is a bit more niche, but if you do manage to get this, please let me know. I'd like to give it a try.\nMasterworks: Handling"
        },
        {
            "hash": 1401300690,
            "plugs": [
                [
                    1840239774
                ],
                [
                    3142289711
                ],
                [
                    588594999
                ],
                [
                    957782887
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2059255495,
            "plugs": [
                [
                    839105230,
                    1840239774,
                    4090651448
                ],
                [
                    1087426260,
                    106909392,
                    3230963543
                ],
                [
                    1428297954,
                    2866798147
                ],
                [
                    1771339417,
                    1546637391,
                    555281244
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Here is a weapon that should not see much use in PvE. Unsurprisingly a PvP weapon is good in PvP, Eye of Sol returns but without Outlaw, Field Prep, or any real good reload perk. Nothing exists on Eye of Sol that will propel it to see any use in general PvE other than to practice for PvP. The best damage perk is either Firing Line or Vorpal Weapon. Precision Instrument is great but you'll almost ever see the full benefits of it.\nMasterworks: Reload Speed"
        },
        {
            "hash": 2059255495,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    1428297954
                ],
                [
                    1771339417
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2059255495,
            "plugs": [
                [
                    1840239774,
                    839105230,
                    4090651448
                ],
                [
                    3142289711
                ],
                [
                    588594999,
                    1428297954,
                    2451262963
                ],
                [
                    957782887,
                    47981717,
                    1546637391
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "I am glad Eye of Sol is back but if it is better than before will depend on how you view it. Snapshot Sights and Opening Shot in the same column still means those with the OG Eye of Sol are still winning. Moving Target is a great secondary, but there's one version I am really interested in.\n\nHammer-Forged Rifling / Accurized Rounds / Slickdraw / Snapshot Sights / Range MW / Alacrity / Targeting Adept Mod.\n\nWith this roll you'll have 100 range, 100 handling, and 88 aim assist. This will completely negate the loss from Slickdraw and feel incredible. I know my roll is a bit more niche, but if you do manage to get this, please let me know. I'd like to give it a try.\nMasterworks: Handling"
        },
        {
            "hash": 2059255495,
            "plugs": [
                [
                    1840239774
                ],
                [
                    3142289711
                ],
                [
                    588594999
                ],
                [
                    957782887
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2728851518,
            "plugs": [
                [
                    1482024992
                ],
                [
                    689005463
                ],
                [
                    3643424744
                ],
                [
                    2594592626
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "One of my favorite fusions as of late has been Loaded Question with Envious Assassin and Controlled Burst. Glacioclasm will have a similar roll but with Overflow. Both will allow you to destroy majors and bosses with ease.\nMasterworks: Charge Time"
        },
        {
            "hash": 2728851518,
            "plugs": [
                [
                    1482024992
                ],
                [
                    689005463
                ],
                [
                    3643424744
                ],
                [
                    2594592626
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2728851518,
            "plugs": [
                [
                    1482024992
                ],
                [
                    3868766766
                ],
                [
                    3161816588
                ],
                [
                    2213355989
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Slideshot makes this roll. With Slideshot you can invest the rest of your stats into a mix of range and stability to still hit 100 range and have a whopping 76 stability. If you can somehow wrangle up full ammo you'll only sit 4 points less than 100 stability. High-Impact Reserves helps those long shots keep their damage at range.\nMasterworks: Range"
        },
        {
            "hash": 2728851518,
            "plugs": [
                [
                    1482024992
                ],
                [
                    3868766766
                ],
                [
                    3161816588
                ],
                [
                    2213355989
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 657927352,
            "plugs": [
                [
                    3525010810
                ],
                [
                    2822142346
                ],
                [
                    968510818
                ],
                [
                    3751912585
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Oh this is gonna be fun. I love a large mag and Cascade Point. My Until It's Return gets a lot of use due to being a better Fourth Horseman. This roll will get a ton of smiles clearing rooms and taking down beefier enemies with relative safety.\nMasterworks: Velocity"
        },
        {
            "hash": 657927352,
            "plugs": [
                [
                    3525010810
                ],
                [
                    2822142346
                ],
                [
                    968510818
                ],
                [
                    3751912585
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 657927352,
            "plugs": [
                [
                    3525010810
                ],
                [
                    2822142346
                ],
                [
                    951095735
                ],
                [
                    1683379515
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "While I don't think anyone will be vying for this roll in PvP I think the best use case is a swap build. Not ideal for \"wasting\" heavy to not get the kill with it. But being a wave frame you won't get a ton of direct hits to kill. If a guardian jumps it's all over. Ideal for pubs, not ideal for most PvP situations.\nMasterworks: Velocity"
        },
        {
            "hash": 657927352,
            "plugs": [
                [
                    3525010810
                ],
                [
                    2822142346
                ],
                [
                    951095735
                ],
                [
                    1683379515
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2045811635,
            "plugs": [
                [
                    839105230,
                    1840239774,
                    1482024992
                ],
                [
                    106909392,
                    1087426260,
                    3230963543
                ],
                [
                    247725512,
                    1820235745,
                    3619207468,
                    2938480696,
                    4245865861,
                    3198323828
                ],
                [
                    3038247973,
                    3891536761,
                    11612903,
                    64866129,
                    1549370717,
                    2422968039
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Imperative returns to us in a different form. No longer is it covered in leaves! -- what's that? It's still covered in leaves? Heck.\nMost of us already have. Workhorse PvE scout. If this is your first season playing destiny either as a new light or a returning player, Imperative has one great redeeming factor; damage. Imperative belongs to the high-impact archetype of scouts giving it the slowest firing rate but the highest damage. Pairing that with more damage through Adrenaline Junkie, some AoE damage through Kinetic Tremors or Explosive Payload. All of these will be happily paired with Rapid Hit for the bonuses to the low stability and reload speed. Subsistence and Keep Away both mitigate the low reload speed by bypassing reload entirely or speeding it up, respectively. I'd still recommend Rapid Hit over both as missing a shot is extremely unforgiving with the slower rate of fire. Precision hits are going to be the goal, why not make follow up shot easier while we're at it.\nMasterworks: Handling"
        },
        {
            "hash": 2045811635,
            "plugs": [
                [
                    839105230
                ],
                [
                    106909392
                ],
                [
                    247725512,
                    2938480696
                ],
                [
                    3038247973,
                    64866129
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2045811635,
            "plugs": [
                [
                    1840239774,
                    1482024992,
                    4090651448
                ],
                [
                    3177308360,
                    3230963543,
                    106909392
                ],
                [
                    3619207468,
                    247725512,
                    3523296417,
                    3198323828,
                    2938480696,
                    1906147653
                ],
                [
                    47981717,
                    3038247973,
                    1370847713,
                    64866129
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 2045811635,
            "plugs": [
                [
                    1840239774
                ],
                [
                    3177308360
                ],
                [
                    3619207468,
                    3198323828
                ],
                [
                    47981717,
                    1370847713
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 4248997900,
            "plugs": [
                [
                    1482024992,
                    4090651448,
                    1840239774
                ],
                [
                    732557052,
                    2680121939,
                    1483536627
                ],
                [
                    968510818,
                    1820235745
                ],
                [
                    557221067,
                    1015611457,
                    831391274
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Incisor is an exotic trace rifle in legendary form. Envious Assassin or Subsistence to keep the magazine topped up to keep fueling Killing Tally will open up your loadouts for a ton of other weapons. Kill Clip is a bit easier to keep track of, but it isn't nearly as strong. The only other competition Incisor has is Appetence which even then they aren't perfectly comparable as one is Strand and the other is Stasis, so you might not even use them for the same purposes or with the same loadouts. Definitely pick this up this season.\nMasterworks: Handling"
        },
        {
            "hash": 4248997900,
            "plugs": [
                [
                    1482024992
                ],
                [
                    732557052
                ],
                [
                    968510818
                ],
                [
                    557221067
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 4248997900,
            "plugs": [
                [
                    3250034553,
                    1482024992
                ],
                [
                    2969185026,
                    732557052
                ],
                [
                    1359896290,
                    1428297954,
                    2387244414
                ],
                [
                    1890422124,
                    1015611457,
                    557221067
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Trace rifles in general are not the strongest picks for PvP. Dynamic Sway Reduction and Tap the Trigger double dip in consistency perks, which you will need as the ammo economy is incredibly unforgiving. If you can manage to scrounge enough ammo for sprees then I would love to see the blistering 0.6s time to kill with Kill Clip.\nMasterworks: Range"
        },
        {
            "hash": 4248997900,
            "plugs": [
                [
                    3250034553
                ],
                [
                    2969185026
                ],
                [
                    1359896290
                ],
                [
                    1890422124
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2421180981,
            "plugs": [
                [
                    1482024992,
                    4090651448,
                    1840239774
                ],
                [
                    732557052,
                    2680121939,
                    1483536627
                ],
                [
                    968510818,
                    1820235745
                ],
                [
                    557221067,
                    1015611457,
                    831391274
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Incisor is an exotic trace rifle in legendary form. Envious Assassin or Subsistence to keep the magazine topped up to keep fueling Killing Tally will open up your loadouts for a ton of other weapons. Kill Clip is a bit easier to keep track of, but it isn't nearly as strong. The only other competition Incisor has is Appetence which even then they aren't perfectly comparable as one is Strand and the other is Stasis, so you might not even use them for the same purposes or with the same loadouts. Definitely pick this up this season.\nMasterworks: Handling"
        },
        {
            "hash": 2421180981,
            "plugs": [
                [
                    1482024992
                ],
                [
                    732557052
                ],
                [
                    968510818
                ],
                [
                    557221067
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2421180981,
            "plugs": [
                [
                    3250034553,
                    1482024992
                ],
                [
                    2969185026,
                    732557052
                ],
                [
                    1359896290,
                    1428297954,
                    2387244414
                ],
                [
                    1890422124,
                    1015611457,
                    557221067
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Trace rifles in general are not the strongest picks for PvP. Dynamic Sway Reduction and Tap the Trigger double dip in consistency perks, which you will need as the ammo economy is incredibly unforgiving. If you can manage to scrounge enough ammo for sprees then I would love to see the blistering 0.6s time to kill with Kill Clip.\nMasterworks: Range"
        },
        {
            "hash": 2421180981,
            "plugs": [
                [
                    3250034553
                ],
                [
                    2969185026
                ],
                [
                    1359896290
                ],
                [
                    1890422124
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 3381450498,
            "plugs": [
                [
                    3525010810,
                    3798852852,
                    1441682018
                ],
                [
                    1087426260,
                    106909392,
                    2822142346
                ],
                [
                    2859149211,
                    951095735,
                    1556840489
                ],
                [
                    2173046394,
                    3708227201,
                    3673922083
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "This sidearm is the reason why this breakdown took so long. I cannot wrap my head around it and it took me a while to get rolls I wanted to test. Beacon Rounds are incredible, it turns into a mini-tracking rocket. A beefier Dreg's Promise if you remember. Impulse Amplifier gives you a near hit scan weapon. Voltshot turns Indebted Kindness into a pocket Trinity Ghoul with a beefier per shot damage profile.\nMasterworks: Velocity"
        },
        {
            "hash": 3381450498,
            "plugs": [
                [
                    3525010810
                ],
                [
                    1087426260
                ],
                [
                    2859149211
                ],
                [
                    2173046394
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 3381450498,
            "plugs": [
                [
                    3525010810,
                    3798852852,
                    1441682018
                ],
                [
                    2822142346,
                    1380253176
                ],
                [
                    2859149211,
                    951095735,
                    3828510309
                ],
                [
                    3673922083
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Indebted Kindness is extremely interesting in the crucible. Impulse Amplifier can turn this into a near instant pseudo-grenade launcher shot, but I think most players are going to opt for Beacon Rounds for better tracking and hip-fire usage. The tracking isn't incredible side to side, for when a Dawnblade flies across your screen, but for general strafing the tracking at low levels is great. At higher buffs you can start to get into a groove and be a bit more loose with your aim, but I wouldn't rely heavily on the tracking. Adagio makes Indebted Kindness a reliable two shot, which I think feeds well into Beacon Rounds.\nMasterworks: Velocity"
        },
        {
            "hash": 3381450498,
            "plugs": [
                [
                    3525010810
                ],
                [
                    2822142346
                ],
                [
                    2859149211
                ],
                [
                    3673922083
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2969415423,
            "plugs": [
                [
                    1926090094,
                    1926090095,
                    1926090092
                ],
                [
                    1087426260,
                    106909392,
                    3230963543
                ],
                [
                    124408337,
                    3828510309,
                    3523296417
                ],
                [
                    1546637391,
                    1954620775,
                    11612903
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Judgment got an upgrade going from Kinetic to Stasis. While now it competes with the very dominant and popular Eyasluna, both being from a dungeon makes the competition also even. Headstone also being in the third column gives Judgment a huge edge. Being able to rock a damage perk and Headstone elevate Judgement past Eyasluna, however, Eyasluna is also able to get Unrelenting for better health. To each their own, but that is what makes Destiny so great.\nMasterworks: Reload Speed"
        },
        {
            "hash": 2969415423,
            "plugs": [
                [
                    1926090094
                ],
                [
                    1087426260
                ],
                [
                    124408337
                ],
                [
                    1546637391
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2969415423,
            "plugs": [
                [
                    1926090094,
                    1926090095,
                    1926090092
                ],
                [
                    3142289711
                ],
                [
                    3161816588,
                    3828510309,
                    588594999
                ],
                [
                    47981717,
                    699525795,
                    1954620775
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Judgment lost a little bit of its edge in the crucible. You can still get Slideshot and Opening Shot. It's not that Judgment is bad, just that other weapons edged it out and 140's aren't exactly strong in this meta (for the first time in a while). Hitmark HCS, SteadyHand HCS, or FastDraw HCS are all great options and allow you to add some much needed stats and aim assist. I am surprised Bungie didn't swap Judgment over to barrels. I guess hand cannon sights are easier than \"sights\" if that makes sense.\nMasterworks: Range, Stability"
        },
        {
            "hash": 2969415423,
            "plugs": [
                [
                    1926090094
                ],
                [
                    3142289711
                ],
                [
                    3161816588
                ],
                [
                    47981717
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2189073092,
            "plugs": [
                [
                    839105230,
                    1482024992,
                    4090651448
                ],
                [
                    3230963543,
                    1087426260,
                    1968497646
                ],
                [
                    3828510309,
                    3619207468,
                    923806249
                ],
                [
                    365154968,
                    831391274,
                    95528736
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Lethal Abundance has one thing going for it, being a Strand high-impact frame auto rifle. Slice and Hatchling both give this weapon extra Strand utility, but on other subclasses this weapon feels like any generic high-impact auto rifle. Enlightened Action and Keep Away both bump up your reload speed, either organically or passively, respectively. Target Lock works best on beefier targets, but can also help on rank and file enemies. Hatchling works best when paired with Strand. Onslaught might be the best neutral perk, but if you want a faster firing auto rifle, just use any of the other Strand auto.\nMasterworks: Handling"
        },
        {
            "hash": 2189073092,
            "plugs": [
                [
                    839105230
                ],
                [
                    3230963543
                ],
                [
                    3828510309
                ],
                [
                    365154968
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2189073092,
            "plugs": [
                [
                    839105230,
                    3661387068,
                    1482024992
                ],
                [
                    1885400500,
                    1561002382
                ],
                [
                    3619207468,
                    923806249,
                    1359896290
                ],
                [
                    1890422124,
                    95528736
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Lethal Abundance might have a better place in PvP with great neutral buffs like Tap the Trigger paired with Keep Away. Dynamic Sway Reduction can also tighten up the firing pattern. Slice is looking like the best option for most players in the third column, so having a bit of added stability or better lethality will depend on the players.\nMasterworks: Stability"
        },
        {
            "hash": 2189073092,
            "plugs": [
                [
                    839105230
                ],
                [
                    1885400500
                ],
                [
                    3619207468
                ],
                [
                    1890422124
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 3710082365,
            "plugs": [
                [
                    852209214,
                    1196733167,
                    3768438372
                ],
                [
                    3429800428,
                    3827198035
                ],
                [
                    2652708987,
                    776531651,
                    2428997981,
                    617966211,
                    2541826827,
                    64332393
                ],
                [
                    3365897133,
                    1683379515,
                    2610012052,
                    1551736345,
                    2216471363,
                    4290541820
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Lethophobia is defined as an abnormal anxiety of forgetting. Let's hope you don't forget the god rolls of this bow then. As with most PvE bows you're looking for a good combination of draw time and accuracy. Successful Warm-Up gives you a better draw time post-defeat, but has a bit less utility against higher health enemies. Explosive Head can stagger those arrow sponges a bit easier but having Rapid Hit or Archer's Tempo there would have been preferred. Disruption break will work best in conjunction with a high damage kinetic weapon like this season's Supercluster slug shotgun. Golden Tricorn will feel great on a combination of subclasses this season with Permeability changing this weapons damage type from void to your selected subclass. You can run a full void or full strand or stasis loadout without much thought. Just remember that the damage change goes away when you stow this weapon.\nMasterworks: Draw Time"
        },
        {
            "hash": 3710082365,
            "plugs": [
                [
                    852209214
                ],
                [
                    3429800428
                ],
                [
                    2652708987,
                    617966211
                ],
                [
                    3365897133,
                    1551736345
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 3710082365,
            "plugs": [
                [
                    2801223209,
                    852209214,
                    4067834857
                ],
                [
                    3429800428,
                    3827198035
                ],
                [
                    951095735,
                    2652708987,
                    3828510309,
                    3878366039,
                    617966211,
                    1771736209
                ],
                [
                    1683379515,
                    3365897133,
                    2216471363,
                    1551736345
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Lethophobia is already making a strong impression on crucible players everywhere being the first bow to roll Disruption Break. Paired with any kinetic weapon you can city shot and get a whopping 50% extra damage on any kinetic weapon from you or anyone on your team. This damage debuff stays applied for a full 5.5 seconds. Be on the lookout for the \"Disrupted\" debuff off your screen, you will be extra vulnerable for this time.\nMasterworks: Accuracy"
        },
        {
            "hash": 3710082365,
            "plugs": [
                [
                    2801223209
                ],
                [
                    3429800428
                ],
                [
                    951095735,
                    3878366039
                ],
                [
                    1683379515,
                    2216471363
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 4233375372,
            "plugs": [
                [
                    839105230,
                    1482024992,
                    4090651448
                ],
                [
                    1087426260,
                    106909392,
                    3230963543
                ],
                [
                    3400784728,
                    243981275
                ],
                [
                    95528736,
                    831391274,
                    2610012052
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "I'm happy to see more adaptive frame machine guns. None will ever replace our lord and savior Hammerhead. But we can think they're still strong in our heart of hearts. Onslaught paired with Triple Tap could be really good for about 3 seconds. You will have to ramp up the kills with some smaller enemies, hoping not to waste too much ammo, and then unload into a major or boss with the added damage with the remainder of your magazine. In practice I don't know how well it will be. Golden Tricorn can activate, reload, and then you can ramp up to the second level with a full magazine.\nMasterworks: Stability"
        },
        {
            "hash": 4233375372,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    3400784728
                ],
                [
                    95528736
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 4233375372,
            "plugs": [
                [
                    3250034553,
                    1482024992
                ],
                [
                    3142289711
                ],
                [
                    4071163871,
                    3523296417,
                    923806249
                ],
                [
                    2610012052,
                    95528736
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "In PvP the added damage from Golden Tricorn 1x will allow for some blistering fast kills, Threat Detector will make this machine gun feel more like a submachine gun in CQC but will not have those added benefits in its intended ranges. Demolitionist and Slice both offer unique benefits.\nMasterworks: Range"
        },
        {
            "hash": 4233375372,
            "plugs": [
                [
                    3250034553
                ],
                [
                    3142289711
                ],
                [
                    4071163871
                ],
                [
                    2610012052
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 3211624072,
            "plugs": [
                [
                    1482024992,
                    4090651448
                ],
                [
                    1087426260,
                    106909392,
                    3230963543
                ],
                [
                    1359896290,
                    1870851715
                ],
                [
                    4104185692,
                    365154968,
                    3891536761
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "How do we feel about lightweight submachine guns in PvE content? Well, if it's not named CALUS Mini-Tool, I don't think they are the best option. Multimach is no exception. Frenzy will give you the easiest damage bonus and increase our reload speed. Target Lock and Kinetic Tremors will both have utility in PvE activities, but won't have as much utility without a reload perk in column 3.\nMasterworks: Reload Speed"
        },
        {
            "hash": 3211624072,
            "plugs": [
                [
                    1482024992
                ],
                [
                    1087426260
                ],
                [
                    1359896290
                ],
                [
                    4104185692
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 3211624072,
            "plugs": [
                [
                    1482024992,
                    3250034553,
                    4090651448
                ],
                [
                    3142289711
                ],
                [
                    1359896290,
                    2846385770,
                    588594999
                ],
                [
                    591790007,
                    1015611457,
                    1890422124
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Multimach is back and boy do I have conflicting views on this. Should we invest in lethality or consistency? Iron Reach will be incredible in 3v3 game modes, as well as Trials and potentially in Rumble, but Kill Clip will be even better for 6v6 game modes or slayers. Ideally you'll find a healthy mix of range and stability, but Dynamic Sway Reduction will cover most of your stability if you opt for Iron Reach. If you prefer Kill Clip, then I would recommend Moving Target for better movement speed and being that quick slayer we all know you are.\nMasterworks: Range, Stability"
        },
        {
            "hash": 3211624072,
            "plugs": [
                [
                    1482024992
                ],
                [
                    3142289711
                ],
                [
                    1359896290
                ],
                [
                    591790007
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2806569825,
            "plugs": [
                [
                    839105230,
                    1840239774
                ],
                [
                    1087426260,
                    106909392,
                    3230963543
                ],
                [
                    1523832109,
                    3619207468,
                    3978468247
                ],
                [
                    555281244,
                    3523296417
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Naren's Lance is an interesting weapon. It's not quite dead on arrival, but it doesn't do any one thing particularly well. Reconstruction and Precision Instrument are great paired with the rapid fire frame, allowing a ton of shots fired with increased damage. But then it falls in that it's a rapid fire frame and firing at 140 RPM while maintaining full crits is extremely difficult.\nMasterworks: Reload Speed"
        },
        {
            "hash": 2806569825,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    1523832109
                ],
                [
                    555281244
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2806569825,
            "plugs": [
                [
                    1840239774,
                    839105230,
                    4090651448
                ],
                [
                    3142289711
                ],
                [
                    3619207468,
                    3511092054,
                    1523832109
                ],
                [
                    3523296417
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Over in the crucible it also lags behind without two of the most important perks. Opening Shot or Snapshot Sights, and while you can get away without either of those perks and still see success, you'll have to find handling and accuracy perks elsewhere. Keep Away is fantastic for reducing your accuracy cone, and Elemental Capacitor could bump you up to 100 handling with an arc subclass. I don't think many players will opt for this sniper but you can make it work.\nMasterworks: Handling"
        },
        {
            "hash": 2806569825,
            "plugs": [
                [
                    1840239774
                ],
                [
                    3142289711
                ],
                [
                    3619207468
                ],
                [
                    3523296417
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2817683783,
            "plugs": [
                [
                    1482024992,
                    4090651448,
                    1840239774
                ],
                [
                    1087426260,
                    106909392,
                    3230963543
                ],
                [
                    247725512,
                    3523296417,
                    3619207468,
                    2938480696,
                    1906147653,
                    3198323828
                ],
                [
                    2610012052,
                    1015611457,
                    4290541820,
                    2923251173
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Precision frame hand cannons have not had their time in the spotlight for a while. Outside of the Seventh Seraph Officer's Revolver paired with Lucky Pants there are not many reasons to use a precision frame hand cannon. If you run void subclasses a lot you can take advantage of Golden Tricorn to maximize damage, making these fast firing hand cannons feel way more chunky than they normally are. Rapid Hit will also bring up the already decent reload speed and their exceptional stability. If you feel like you need more range in PvE (which is an already odd thing to task for) you can opt for Keep Away for a continuous reload speed buff and a touch more range.\nMasterworks: Handling"
        },
        {
            "hash": 2817683783,
            "plugs": [
                [
                    1482024992
                ],
                [
                    1087426260
                ],
                [
                    247725512,
                    2938480696
                ],
                [
                    2610012052,
                    4290541820
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2817683783,
            "plugs": [
                [
                    1840239774,
                    1482024992,
                    4090651448
                ],
                [
                    3142289711
                ],
                [
                    3619207468,
                    247725512,
                    3198323828,
                    2938480696
                ],
                [
                    1015611457,
                    2610012052,
                    2387244414,
                    2923251173,
                    4290541820,
                    1748774930
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Keep Away is stronger in the crucible where range matters far more. Kill Clip gives you nostalgia for the Not Forgotten or Luna's Howl days of yore with a 0.67 time to kill. You are put in a time constraint which some players might not like, but in 6v6 game modes it's not too hard to find another unwilling participant. Fully invested into range your Optative can reach out to 34.66 meters, for the record that is further by over 1 meter than catalyzed Thorn. The drawback is the lower 1.0 s TtK but once you get going with the 0.67 TtK you can destroy any Thorn user. (Food for thought).\nMasterworks: Range"
        },
        {
            "hash": 2817683783,
            "plugs": [
                [
                    1840239774
                ],
                [
                    3142289711
                ],
                [
                    3619207468,
                    3198323828
                ],
                [
                    1015611457,
                    2923251173
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 3926811686,
            "plugs": [
                [
                    839105230,
                    1482024992,
                    4090651448
                ],
                [
                    1087426260,
                    106909392,
                    3230963543
                ],
                [
                    3828510309,
                    3418782618
                ],
                [
                    4104185692,
                    3673922083
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Parabellum is the Exit Strategy I wish I had. Enlightened Action will buff the weapon feel before Frenzy kicks in or against before targets. Rewind Rounds are fantastic for mowing down wave after wave of enemies. I'd say that Parabellum is a workhorse weapon but it's just not as strong as the CALUS-Mini Tool for being a solar submachine gun, and the competition for being a submachine gun in PvE gets stronger and stronger each season.\nMasterworks: Stability"
        },
        {
            "hash": 3926811686,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    3828510309
                ],
                [
                    4104185692
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 3926811686,
            "plugs": [
                [
                    839105230,
                    3250034553,
                    1482024992
                ],
                [
                    3142289711,
                    3230963543
                ],
                [
                    3828510309
                ],
                [
                    3673922083,
                    1359896290
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Adaptive frame submachine guns are my favorite in PvP. They combine a good weapon feel with good damage too. The Hero's Burden is amazing with Kill Clip. Parabellum gets two damage perks both with different feels. Adagio will give you forgiveness and keep your time to kill relatively the same. If you can activate Frenzy you'll drop your time to kill down to a blistering 0.67s but you'll have to keep Frenzy up in order to maintain that momentum. I have a difficult time playing the mini game of \"Frenzy.\"\nMasterworks: Range"
        },
        {
            "hash": 3926811686,
            "plugs": [
                [
                    839105230
                ],
                [
                    3142289711
                ],
                [
                    3828510309
                ],
                [
                    3673922083
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 3483591058,
            "plugs": [
                [
                    1840239774,
                    1482024992,
                    4090651448
                ],
                [
                    1087426260,
                    1968497646,
                    3230963543
                ],
                [
                    2848615171,
                    3418782618,
                    3619207468
                ],
                [
                    2173046394,
                    365154968,
                    2610012052
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Dragonfly and Voltshot is an incredibly unique combination. Dragonfly doesn't extend the Voltshot radius, but extra boom and zap does clear a room faster than one or the other. If you're looking for a more neutral weapon, I'd say that Rewind Rounds and Target Lock will be your best options for taking down majors with ease. Prosecutor isn't ideal for PvE, but we're all here for the PvP review.\nMasterworks: Reload Speed"
        },
        {
            "hash": 3483591058,
            "plugs": [
                [
                    1840239774
                ],
                [
                    1087426260
                ],
                [
                    2848615171
                ],
                [
                    2173046394
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 3483591058,
            "plugs": [
                [
                    3250034553,
                    1482024992
                ],
                [
                    1885400500,
                    1561002382
                ],
                [
                    3619207468,
                    2387244414
                ],
                [
                    365154968,
                    1890422124
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "We're in an auto rifle meta. Prosecutor is leading part of the charge. Target Lock in combination with Keep Away or Zen Moment makes for an extremely lethal and consistent weapon. You can almost ignore everything else if you have these two perks.\nMasterworks: Range"
        },
        {
            "hash": 3483591058,
            "plugs": [
                [
                    3250034553
                ],
                [
                    1885400500
                ],
                [
                    3619207468
                ],
                [
                    365154968
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 435821041,
            "plugs": [
                [
                    1482024992,
                    4090651448
                ],
                [
                    1087426260,
                    3230963543
                ],
                [
                    247725512,
                    923806249,
                    3619207468
                ],
                [
                    3047969693,
                    4104185692,
                    831391274
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Relentless could overthrow Messenger for being the best legendary high-impact pulse in the game. Is it definitively better? No, nothing really is in this game. But it can compete for sure. Rapid Hit and Desperado are both great perks. Relentless being Strand allows it Slice and Hatchling that Messenger cannot get. Frenzy and Keep Away are both neutral perks that could do well with just about any combination of alternate perks.\nMasterworks: Reload Speed"
        },
        {
            "hash": 435821041,
            "plugs": [
                [
                    1482024992
                ],
                [
                    1087426260
                ],
                [
                    247725512
                ],
                [
                    3047969693
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 435821041,
            "plugs": [
                [
                    1482024992,
                    3250034553
                ],
                [
                    1885400500,
                    1561002382
                ],
                [
                    247725512,
                    3619207468
                ],
                [
                    460017080,
                    2387244414,
                    588594999
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "In PvP Relentless and Messenger really stand toe to toe. Neither are exceptionally better than the other, and both come with Rapid Hit and Headseeker or Keep Away. Zen Moment really shines on Relentless and possibly puts it over the edge. Whichever way you fall on the two pulses both will serve you extremely well.\nMasterworks: Stability"
        },
        {
            "hash": 435821041,
            "plugs": [
                [
                    1482024992
                ],
                [
                    1885400500
                ],
                [
                    247725512
                ],
                [
                    460017080
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 871900124,
            "plugs": [
                [
                    1300023272,
                    4090651448,
                    1482024992
                ],
                [
                    791862061,
                    1087426260,
                    106909392
                ],
                [
                    1556840489,
                    776531651
                ],
                [
                    2679249093,
                    2048641572
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Retold Tale is not a PvE shotgun. It does come with some nice PvE perks like One-Two Punch, but the lack of Grave Robber lowers it in my opinion. Destabilizing Rounds and Repulsor Brace have good synergy but on a shotgun I'd rather take a good damage perk over an add clearing one.\nMasterworks: Reload Speed"
        },
        {
            "hash": 871900124,
            "plugs": [
                [
                    1300023272
                ],
                [
                    791862061
                ],
                [
                    1556840489
                ],
                [
                    2679249093
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 871900124,
            "plugs": [
                [
                    1300023272,
                    1482024992,
                    4090651448
                ],
                [
                    3142289711,
                    791862061
                ],
                [
                    706527188,
                    3161816588
                ],
                [
                    957782887,
                    2450788523,
                    1451849462
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Retold Tale was and still is one of my favorite shotguns. I used it a ton before getting my best Mindbender's Ambition. I still prefer the U shaped sights on Retold. I grinded out a decent Compass Rose with QuickDraw and Snapshot Sights, so we will see if Retold will be better. I think most players will still opt for a Matador but having a super snappy shotgun won't hurt your vault space too much (though seeing the state of your vault it might be a tough squeeze /s).\nMasterworks: Handling, Range"
        },
        {
            "hash": 871900124,
            "plugs": [
                [
                    1300023272
                ],
                [
                    3142289711
                ],
                [
                    706527188
                ],
                [
                    957782887
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1612781792,
            "plugs": [
                [
                    1300023272,
                    4090651448,
                    1482024992
                ],
                [
                    791862061,
                    1087426260,
                    106909392
                ],
                [
                    3300816228,
                    2779035018,
                    691659142
                ],
                [
                    1546637391,
                    2048641572,
                    2360754333
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Retrofuturist is an interesting addition this season. Alongside Riiswalker we have a kinetic option for a lightweight frame shotgun. Retrofuturist was never a truly strong pick for PvE and that remains for this current version. Auto-Loading Holster will be your best quality of life perk, and paired with Vorpal Weapon is a very cookie-cutter shotgun. Destabilizing Rounds pairs best with Feeding Frenzy to use Retrofuturist as your primary add-clearing weapon.\nMasterworks: Reload Speed"
        },
        {
            "hash": 1612781792,
            "plugs": [
                [
                    1300023272
                ],
                [
                    791862061
                ],
                [
                    3300816228
                ],
                [
                    1546637391
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1612781792,
            "plugs": [
                [
                    1482024992,
                    1300023272,
                    4090651448
                ],
                [
                    3142289711,
                    791862061
                ],
                [
                    1821614984,
                    706527188,
                    1866048759
                ],
                [
                    957782887,
                    1546637391
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "If you like snappy shotguns you will be happy to learn that Retrofuturist gets access to Quickdraw and Snapshot Sights. I prefer Slickdraw as shotgun aim assist doesn't feel incredibly strong to me, but I also don't mind lower AA weapons in general. Having a fast shotgun is more important to me, your mileage may vary with that. I think most players will opt for the tried and true Quickdraw and Snapshot Sights.\nMasterworks: Range"
        },
        {
            "hash": 1612781792,
            "plugs": [
                [
                    1482024992
                ],
                [
                    3142289711
                ],
                [
                    1821614984
                ],
                [
                    957782887
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1764868900,
            "plugs": [
                [
                    1300023272,
                    1482024992,
                    4090651448
                ],
                [
                    791862061,
                    1087426260,
                    106909392
                ],
                [
                    3978468247,
                    3436462433
                ],
                [
                    1546637391
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Riiswalker is an interesting weapon. A Fallen-forged weapon that can be used against the Fallen. Oh how the turns have tabled. Discord and Vorpal Weapon are going to be my top picks for keeping your magazine loaded and for extra damage against majors. It will not be better than more defined picks, but it will be strong in less focused strikes and low-end PvE.\nMasterworks: Reload Speed"
        },
        {
            "hash": 1764868900,
            "plugs": [
                [
                    1300023272
                ],
                [
                    791862061
                ],
                [
                    3978468247
                ],
                [
                    1546637391
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1764868900,
            "plugs": [
                [
                    1300023272,
                    1482024992
                ],
                [
                    3142289711,
                    791862061
                ],
                [
                    3161816588,
                    2450788523,
                    3436462433
                ],
                [
                    47981717,
                    591790007,
                    2451262963
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "If you never grinded out your Wastelander patterns like me, this could be your next best option. Riiswalker was always my favorite lightweight shotgun and this version comes with the same great stat package with a potential 100 range. The one thing that separated it from Wastelander was the lack of Opening Shot, this version comes with Opening Shot, and Slideshot for the coveted 100 range. With all the investments into range your barrel and masterwork should be geared towards handling.\nMasterworks: Range, Handling"
        },
        {
            "hash": 1764868900,
            "plugs": [
                [
                    1300023272
                ],
                [
                    3142289711
                ],
                [
                    3161816588
                ],
                [
                    47981717
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 3583275737,
            "plugs": [
                [
                    839105230,
                    1482024992,
                    4090651448
                ],
                [
                    1087426260,
                    106909392,
                    3230963543
                ],
                [
                    1820235745,
                    3418782618,
                    776531651
                ],
                [
                    2610012052,
                    95528736
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Ros Arago IV is a great new option for those of us who don't like or never got a good Gnawing Hunger. Ros Arago IV has a few tricks up its sleeve that even propel it over a good Gnawing Hunger like the addition of Golden Tricorn for damage; Rewind Rounds for slightly better magazine efficiency; Repulsor Brace for better subclass synergy; Onslaught for better DPS against higher health enemies. Depending on your needs, Ros Arago IV could even be your one and done void auto rifle.\nMasterworks: Stability"
        },
        {
            "hash": 3583275737,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    1820235745
                ],
                [
                    2610012052
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 3583275737,
            "plugs": [
                [
                    839105230,
                    3661387068,
                    1482024992
                ],
                [
                    3142289711
                ],
                [
                    1359896290
                ],
                [
                    95528736
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Over in the crucible it is slightly better and slightly worse than Gnawing Hunger. Instead of getting bonus damage through Kill Clip you can decrease your time to kill via Onslaught. With arguably a better accuracy perk in Dynamic Sway Reduction over Zen Moment. It ultimately will depend on which model you prefer as well as which version you'd like. Both technically have time to kill reducing post-kill perks as well as accuracy boosting perks.\nMasterworks: Range"
        },
        {
            "hash": 3583275737,
            "plugs": [
                [
                    839105230
                ],
                [
                    3142289711
                ],
                [
                    1359896290
                ],
                [
                    95528736
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2563668388,
            "plugs": [
                [
                    839105230,
                    1482024992
                ],
                [
                    1087426260,
                    106909392,
                    3230963543
                ],
                [
                    3643424744,
                    3828510309,
                    3619207468,
                    2682205016,
                    1771736209,
                    3198323828
                ],
                [
                    2610012052,
                    2896038713,
                    4290541820,
                    2402480669
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "I hope that Scalar Potential lives up to its name. An arc rapid-fire frame Feels. Very. Familiar. Huh, I can't place my thumb on it. Well, since we've never seen one of these before you're going to want Overflow to double your magazine capacity, and Golden Tricorn to really pump up that damage. Arrowhead Brake is almost required for the low 53 recoil direction. With our new deterministic recoil you might be able to learn the recoil pattern and not need Arrowhead Brake, but I don't like to fight with my weapons.\nMasterworks: Stability"
        },
        {
            "hash": 2563668388,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    3643424744,
                    2682205016
                ],
                [
                    2610012052,
                    4290541820
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2563668388,
            "plugs": [
                [
                    839105230,
                    1482024992
                ],
                [
                    3142289711,
                    3177308360,
                    3230963543
                ],
                [
                    3619207468,
                    3828510309,
                    3643424744,
                    3198323828,
                    1771736209,
                    2682205016
                ],
                [
                    460017080,
                    2610012052,
                    4045335048,
                    4290541820
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Scalar Potential doesn't reinvent the wheel. The perks unique to it aren't useful in the crucible spare Enlightened Action which will make this pulse feel better but not help its lethality. Neutrally with Headseeker you could have a pulse that feels fantastic, but Keep Away will probably be better for the range and accuracy bonuses. If you like the model and sights I'd suggest grinding out the patterns, if you already have another rapid-fire frame pulse I wouldn't worry too much about this one.\nMasterworks: Stability"
        },
        {
            "hash": 2563668388,
            "plugs": [
                [
                    839105230
                ],
                [
                    3142289711
                ],
                [
                    3619207468,
                    3198323828
                ],
                [
                    460017080,
                    4045335048
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2558925366,
            "plugs": [
                [
                    839105230,
                    1482024992,
                    4090651448
                ],
                [
                    689005463,
                    2680121939
                ],
                [
                    3643424744,
                    1428297954,
                    3436462433,
                    2682205016,
                    2014892510,
                    2658083589
                ],
                [
                    2594592626,
                    3673922083,
                    831391274,
                    2037312142,
                    2889515627,
                    102912326
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Oh hey, a new strand fusion rifle. Will Scatter Signal be better than Pressurized Precision? Well neither are great as Strand fusion rifles. But for a \"Kinetic\" fusion rifle I think Scatter Signal rivals and possibly beats out Riptide for best in slot fusion. Overflow and Controlled Burst for added damage throughout the magazine. You'll only need one magazine booster to hit the fusion cap of 8 shots or you can opt for an even faster firing fusion with Accelerated Coils. Overflow will double your magazine capacity giving you 16 shots, 15 of which will have an extra 20% damage increase. If you opt for Extended Battery for the 16 total shots you can slot in Major or Boss spec for an additional 7.77% damage to every shot.\nMasterworks: Charge Time"
        },
        {
            "hash": 2558925366,
            "plugs": [
                [
                    839105230
                ],
                [
                    689005463
                ],
                [
                    3643424744,
                    2682205016
                ],
                [
                    2594592626,
                    2037312142
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2558925366,
            "plugs": [
                [
                    3250034553,
                    839105230,
                    1482024992
                ],
                [
                    2969185026
                ],
                [
                    1428297954,
                    3643424744,
                    3436462433,
                    2014892510,
                    2682205016,
                    2658083589
                ],
                [
                    1754714824,
                    831391274,
                    834262328,
                    102912326
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "In PvP there's not a lot that can convince me that rapid-fire frame fusion rifles are anything other than anti-shotgun weapons. The \"Uno Reverse\" of the Destiny weapons. Scatter Signal doesn't really lean into the anti-ape role but it does have a few tricks up its metaphorical sleeve in Kickstart for the most ape fusion we can get. Lower the charge time as low as it can go or just throw on Kickstart for extra damage and speedier shots. I'd pair that with Perpetual Motion for the bonuses to stability and handling. This way the rest of your perks can be invested into range.\nMasterworks: Range"
        },
        {
            "hash": 2558925366,
            "plugs": [
                [
                    3250034553
                ],
                [
                    2969185026
                ],
                [
                    1428297954,
                    2014892510
                ],
                [
                    1754714824,
                    834262328
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2140635451,
            "plugs": [
                [
                    3525010810,
                    3798852852,
                    1441682018
                ],
                [
                    3796465595
                ],
                [
                    3300816228,
                    2869569095,
                    3977735242
                ],
                [
                    2396489472,
                    3523296417,
                    2428997981
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Sleepless is an interesting rocket. It was great when rockets could be used everywhere and when we didn't have to reload via Lunafaction Boots or Rally Barricades. Currently you'll find very limited uses out of most rockets. There are a few options that have risen to the top, but it means most rockets are going to fall into general utility tools. Sleepless has Chain Reaction for better add clear, and Auto-Loading Holster for quality of life. You might be able to squeeze out some solid DPS with Field Prep but without a good damage perk you'll fall behind almost immediately.\nMasterworks: Velocity"
        },
        {
            "hash": 2140635451,
            "plugs": [
                [
                    3525010810
                ],
                [
                    3796465595
                ],
                [
                    3300816228
                ],
                [
                    2396489472
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2140635451,
            "plugs": [
                [
                    3525010810,
                    3798852852,
                    1441682018
                ],
                [
                    2822142346,
                    1996142143
                ],
                [
                    3977735242,
                    3592538738
                ],
                [
                    2396489472,
                    3523296417
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Crucible rockets need one thing, a great blast radius. Sleepless has that in droves. With a blast radius masterwork you'll sit at 100 even, that way you can invest your other perks into velocity and handling, bringing up some of its lower stats. With Quick Launch and High-Velocity Rounds you're looking at a nice 60 velocity. It won't beat Impulse Amplifier for the quickest rocket but it will move. Chain Reaction then becomes great for dealing with multiple guardians in every gamemode.\nMasterworks: Velocity"
        },
        {
            "hash": 2140635451,
            "plugs": [
                [
                    3525010810
                ],
                [
                    2822142346
                ],
                [
                    3977735242
                ],
                [
                    2396489472
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1891321753,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    3828510309
                ],
                [
                    3047969693
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Stay Frosty is a bit of an odd weapon. It lost a bit of utility from last years model, but gained a quality of life perk in Enlightened Action. Desperado is a fun perk but nothing about this weapon will break the meta or shake up the game.\nMasterworks: Stability"
        },
        {
            "hash": 1891321753,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    3828510309
                ],
                [
                    3047969693
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1891321753,
            "plugs": [
                [
                    839105230
                ],
                [
                    106909392
                ],
                [
                    588594999
                ],
                [
                    460017080
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "There are two versions of this weapon you can get. Don't take into MnK or controller as seriously. The MnK roll is better for 6v6 or slaying play styles. The controller roll is better for 3v3 or more neutral play styles. Both will feel great but have different utilities.\nMasterworks: Stability"
        },
        {
            "hash": 1891321753,
            "plugs": [
                [
                    839105230
                ],
                [
                    106909392
                ],
                [
                    588594999
                ],
                [
                    460017080
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1447836603,
            "plugs": [
                [
                    1482024992,
                    4090651448
                ],
                [
                    1087426260,
                    106909392,
                    3230963543
                ],
                [
                    1820235745,
                    4071163871,
                    1631667848,
                    4245865861,
                    494941759,
                    402033656
                ],
                [
                    2610012052,
                    2173046394,
                    4082225868,
                    4290541820,
                    1720528630,
                    1161469972
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Subjunctive was the smg that could. It felt great in PvE and held its own back when recluse dominated all aspects of our life. Oh how naive we were. When Rampage and Outlaw were all we cared about. Things have shifted and more weapons are certainly popular. The only true competition Subjunctive needs to worry about is the Ikelos SMG. Both are arc, but what gives Subjunctive the edge? Golden Tricorn. It's not the highest uptime on Arc but you can chain back to back arc ability kills with some loadouts, this will give Subjunctive a 1.5x damage bonus over the Ikelos (this is without giving the Ikelos a damage perk of its own). Most players spec'ed into Voltshot which will clear rooms easier but have slight difficulties taking down beefier targets. With Golden Tricorn 2x you'll have enough damage to look at enemies and they'll become unalive from sheer admiration, and you'll be able to chunk down majors with ease, Subsistence just keeps the chains rolling.\nMasterworks: Stability"
        },
        {
            "hash": 1447836603,
            "plugs": [
                [
                    1482024992
                ],
                [
                    1087426260
                ],
                [
                    1820235745,
                    4245865861
                ],
                [
                    2610012052,
                    4290541820
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1447836603,
            "plugs": [
                [
                    1482024992,
                    3661387068,
                    1392496348
                ],
                [
                    3142289711
                ],
                [
                    4071163871,
                    1866048759,
                    1645158859,
                    494941759,
                    3118144663,
                    3755250867
                ],
                [
                    4082225868,
                    2610012052,
                    1683379515,
                    1161469972,
                    4290541820,
                    2216471363
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Subjunctive in PvP is a bit more subjective. Being a lightweight frame without any large range extending perks puts Subjunctive lower on the list of best SMGs within Shadx's playhouse. Threat detector helps boost your stats within range, and Swashbuckler can help your next engagement when you ultimately melee your opponent dead.\nMasterworks: Range"
        },
        {
            "hash": 1447836603,
            "plugs": [
                [
                    1482024992
                ],
                [
                    3142289711
                ],
                [
                    4071163871,
                    494941759
                ],
                [
                    4082225868,
                    1161469972
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 92459755,
            "plugs": [
                [
                    1840239774,
                    1482024992,
                    4090651448
                ],
                [
                    791862061,
                    1087426260,
                    106909392
                ],
                [
                    1523832109,
                    1556840489,
                    1354429876,
                    461595545,
                    3442762221,
                    848860060
                ],
                [
                    1546637391,
                    3751912585,
                    3708227201,
                    3418165135,
                    331667533,
                    781192741
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Does Heritage have some competition? I love to see it. Reconstruction on a non-raid weapon paired with Vorpal Weapon for consistent damage throughout the larger mag is going to be your go-to. Enhanced Cascade Point could be funny. I love it on my Until It's Return as a mini-Fourth Horseman. Oh wow, we are like 3 layers deep. Personally I'd take Assault Mag for the boost to RPM in getting out those shots faster, but it's not necessary.\nMasterworks: Handling"
        },
        {
            "hash": 92459755,
            "plugs": [
                [
                    1840239774
                ],
                [
                    791862061
                ],
                [
                    1523832109,
                    461595545
                ],
                [
                    1546637391,
                    3418165135
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 92459755,
            "plugs": [
                [
                    3250034553,
                    1482024992,
                    1840239774
                ],
                [
                    3142289711,
                    791862061
                ],
                [
                    4071163871,
                    3161816588,
                    494941759,
                    191144788
                ],
                [
                    2451262963,
                    1609056795
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Slug shotguns are not nearly as dominant as they used to be. They used to be a high skill, high reward weapon that prioritized good aim for in return a deep OHK. Threat Detector and Fragile Focus both boost your already good range and handling. That's really all you're going to need. Invest the rest of your stats into whatever you feel like you'll need more. Handling outside of Threat Detector range or range for when your shields are broken.\nMasterworks: Range"
        },
        {
            "hash": 92459755,
            "plugs": [
                [
                    3250034553
                ],
                [
                    3142289711
                ],
                [
                    4071163871,
                    494941759
                ],
                [
                    2451262963,
                    1609056795
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 3007479950,
            "plugs": [
                [
                    839105230
                ],
                [
                    106909392
                ],
                [
                    1354429876
                ],
                [
                    555281244
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "We all probably have a scout in our vault we use for PvE. Do we need another? Well technically no. Taraxippos doesn't do anything another scout couldn't do equally or better. If you somehow don't have one, then yeah. Grind yourself one out this Guardian Games. It's easy to get and you'll probably have more than you know what to do with.\nMasterworks: Stability"
        },
        {
            "hash": 3007479950,
            "plugs": [
                [
                    839105230
                ],
                [
                    106909392
                ],
                [
                    1354429876
                ],
                [
                    555281244
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 3007479950,
            "plugs": [
                [
                    839105230
                ],
                [
                    3177308360
                ],
                [
                    2387244414,
                    588594999
                ],
                [
                    1015611457
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "With the update to scout rifle damage, I think there's a good case for this scout being a low-key meta choice. It won't have as good of a feeling as the rapid-fire frames, nor the oomph of the high-impacts. But the extra movement speed and the extra flexibility could aid certain builds and loadouts. I love kill clip for really deleting guardians in 6s, but it falls off hard in 3s.\nMasterworks: Stability"
        },
        {
            "hash": 3007479950,
            "plugs": [
                [
                    839105230
                ],
                [
                    3177308360
                ],
                [
                    2387244414
                ],
                [
                    1015611457
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1968410628,
            "plugs": [
                [
                    1840239774,
                    4090651448
                ],
                [
                    1087426260,
                    106909392,
                    3230963543
                ],
                [
                    3619207468,
                    1168162263,
                    247725512
                ],
                [
                    555281244,
                    124408337,
                    3038247973
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "New DMT-lite? Heck yeah. Let's Yee to the Haw. Keep Away will benefit your accuracy and reload speed which will help alleviate the necessity of reloader gauntlets. Do I recommend foregoing it entirely? No but you can stack enough reload through your masterwork, Keep Away, and Tactical Mag or Flared Magwell to not need it. Precision Instrument will be great as the reload will allow you to keep up high stacks. Headstone works will being a scout and a high-damage frame.\nMasterworks: Reload Speed"
        },
        {
            "hash": 1968410628,
            "plugs": [
                [
                    1840239774
                ],
                [
                    1087426260
                ],
                [
                    3619207468
                ],
                [
                    555281244
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1968410628,
            "plugs": [
                [
                    1482024992,
                    4090651448,
                    1840239774
                ],
                [
                    3230963543
                ],
                [
                    3619207468,
                    1866048759,
                    247725512
                ],
                [
                    1015611457,
                    555281244,
                    2416023159
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "The Prophet in PvP doesn't really handle like a legendary DMT; more like a long ranged 120 hand cannon. Precision Instrument will make the 2c1b a little easier, but Kill Clip will be the most sought after perk for being able to 2c any resilience guardian. 120 hand cannons lost this ability so if you're looking for a replacement, this is it.\nMasterworks: Stability"
        },
        {
            "hash": 1968410628,
            "plugs": [
                [
                    1482024992
                ],
                [
                    3230963543
                ],
                [
                    3619207468
                ],
                [
                    1015611457
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 3019024381,
            "plugs": [
                [
                    1840239774,
                    4090651448
                ],
                [
                    1087426260,
                    106909392,
                    3230963543
                ],
                [
                    3619207468,
                    1168162263,
                    247725512
                ],
                [
                    555281244,
                    124408337,
                    3038247973
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "New DMT-lite? Heck yeah. Let's Yee to the Haw. Keep Away will benefit your accuracy and reload speed which will help alleviate the necessity of reloader gauntlets. Do I recommend foregoing it entirely? No but you can stack enough reload through your masterwork, Keep Away, and Tactical Mag or Flared Magwell to not need it. Precision Instrument will be great as the reload will allow you to keep up high stacks. Headstone works will being a scout and a high-damage frame.\nMasterworks: Reload Speed"
        },
        {
            "hash": 3019024381,
            "plugs": [
                [
                    1840239774
                ],
                [
                    1087426260
                ],
                [
                    3619207468
                ],
                [
                    555281244
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 3019024381,
            "plugs": [
                [
                    1482024992,
                    4090651448,
                    1840239774
                ],
                [
                    3230963543
                ],
                [
                    3619207468,
                    1866048759,
                    247725512
                ],
                [
                    1015611457,
                    555281244,
                    2416023159
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "The Prophet in PvP doesn't really handle like a legendary DMT; more like a long ranged 120 hand cannon. Precision Instrument will make the 2c1b a little easier, but Kill Clip will be the most sought after perk for being able to 2c any resilience guardian. 120 hand cannons lost this ability so if you're looking for a replacement, this is it.\nMasterworks: Stability"
        },
        {
            "hash": 3019024381,
            "plugs": [
                [
                    1482024992
                ],
                [
                    3230963543
                ],
                [
                    3619207468
                ],
                [
                    1015611457
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2889501828,
            "plugs": [
                [
                    3666208348,
                    2827049491,
                    938542991
                ],
                [
                    269888150,
                    3625355092,
                    52780822
                ],
                [
                    2077819806,
                    2396489472,
                    2726471870
                ],
                [
                    3078487919,
                    3650930298
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "New sword? I am pretty excited for the Slammer. Being a Zoom sword with some interesting combos means it will most likely find itself in my loadouts. Eager Edge will be great for most players, but if you're looking for maximum damage I would recommend Relentless Strikes for ammo back. Chain Reaction and Thresh are also great options with some of the fourth column perks. Bait and Switch will be the best for pure damage, but Cold Steel for Stasis synergy and helping with champions might be a great play.\nMasterworks: Impact"
        },
        {
            "hash": 2889501828,
            "plugs": [
                [
                    3666208348
                ],
                [
                    269888150
                ],
                [
                    2077819806
                ],
                [
                    3078487919
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2889501828,
            "plugs": [
                [
                    3666208348,
                    2827049491,
                    938542991
                ],
                [
                    269888150,
                    3625355092,
                    52780822
                ],
                [
                    2077819806,
                    2396489472
                ],
                [
                    3523296417,
                    3650930298
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "I do not think The Slammer will be the best PvP option for Swords, truly if you're looking for a Zoom sword Half-Truths is the best being paired with Tireless Blade for the best ammo economy. Obviously the Other Half is a \"flex\" as will an adept Slammer, but you and I both know you could have styled on one more player with Half-Truths.\nMasterworks: Impact"
        },
        {
            "hash": 2889501828,
            "plugs": [
                [
                    3666208348
                ],
                [
                    269888150
                ],
                [
                    2077819806
                ],
                [
                    3523296417
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1354727549,
            "plugs": [
                [
                    3666208348,
                    2827049491,
                    938542991
                ],
                [
                    269888150,
                    3625355092,
                    52780822
                ],
                [
                    2077819806,
                    2396489472,
                    2726471870
                ],
                [
                    3078487919,
                    3650930298
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "New sword? I am pretty excited for the Slammer. Being a Zoom sword with some interesting combos means it will most likely find itself in my loadouts. Eager Edge will be great for most players, but if you're looking for maximum damage I would recommend Relentless Strikes for ammo back. Chain Reaction and Thresh are also great options with some of the fourth column perks. Bait and Switch will be the best for pure damage, but Cold Steel for Stasis synergy and helping with champions might be a great play.\nMasterworks: Impact"
        },
        {
            "hash": 1354727549,
            "plugs": [
                [
                    3666208348
                ],
                [
                    269888150
                ],
                [
                    2077819806
                ],
                [
                    3078487919
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1354727549,
            "plugs": [
                [
                    3666208348,
                    2827049491,
                    938542991
                ],
                [
                    269888150,
                    3625355092,
                    52780822
                ],
                [
                    2077819806,
                    2396489472
                ],
                [
                    3523296417,
                    3650930298
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "I do not think The Slammer will be the best PvP option for Swords, truly if you're looking for a Zoom sword Half-Truths is the best being paired with Tireless Blade for the best ammo economy. Obviously the Other Half is a \"flex\" as will an adept Slammer, but you and I both know you could have styled on one more player with Half-Truths.\nMasterworks: Impact"
        },
        {
            "hash": 1354727549,
            "plugs": [
                [
                    3666208348
                ],
                [
                    269888150
                ],
                [
                    2077819806
                ],
                [
                    3523296417
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1820994983,
            "plugs": [
                [
                    839105230,
                    1482024992,
                    1840239774
                ],
                [
                    1087426260,
                    1968497646,
                    3230963543
                ],
                [
                    3017780555,
                    1820235745,
                    3643424744
                ],
                [
                    4293542123,
                    365154968,
                    95528736
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "The Summoner in PvE has a few different options. You can opt for a Heal Clip roll to keep yourself alive, a Target Lock roll to take down champions and larger health enemies, or even an Onslaught roll to tear into waves of adds with the damage of an auto but the speed of an SMG. Take your pick. If you're going Heal Clip I would recommend Incandescent. Target Lock will work best with Overflow and Onslaught with Subsistence. You can mix and match to your heart's content, but those are my recommendations.\nMasterworks: Reload Speed"
        },
        {
            "hash": 1820994983,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    3017780555
                ],
                [
                    4293542123
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1820994983,
            "plugs": [
                [
                    839105230,
                    1482024992
                ],
                [
                    1885400500,
                    1561002382
                ],
                [
                    2387244414,
                    1359896290,
                    1428297954
                ],
                [
                    365154968,
                    1890422124,
                    1015611457
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "PvP has far less options but still some solid options. Instead of different niches within the grand scheme of PvE content, we really have consistency or lethality 2x. Within both you'll find a healthy scoop of stability perks, either Zen Moment, Dynamic Sway Reduction, or Perpetual Motion. Pick your poison there. If you want more consistency on top of your consistency sundae, go for Tap the Trigger. For lethality you can opt for Target Lock, Onslaught, or the tried and true Kill Clip. All options are great but work in different ways, your best option might not be the same as others so give them a try.\nMasterworks: Range"
        },
        {
            "hash": 1820994983,
            "plugs": [
                [
                    839105230
                ],
                [
                    1885400500
                ],
                [
                    2387244414
                ],
                [
                    365154968
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1292594730,
            "plugs": [
                [
                    839105230,
                    1482024992,
                    1840239774
                ],
                [
                    1087426260,
                    1968497646,
                    3230963543
                ],
                [
                    3017780555,
                    1820235745,
                    3643424744
                ],
                [
                    4293542123,
                    365154968,
                    95528736
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "The Summoner in PvE has a few different options. You can opt for a Heal Clip roll to keep yourself alive, a Target Lock roll to take down champions and larger health enemies, or even an Onslaught roll to tear into waves of adds with the damage of an auto but the speed of an SMG. Take your pick. If you're going Heal Clip I would recommend Incandescent. Target Lock will work best with Overflow and Onslaught with Subsistence. You can mix and match to your heart's content, but those are my recommendations.\nMasterworks: Reload Speed"
        },
        {
            "hash": 1292594730,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    3017780555
                ],
                [
                    4293542123
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1292594730,
            "plugs": [
                [
                    839105230,
                    1482024992
                ],
                [
                    1885400500,
                    1561002382
                ],
                [
                    2387244414,
                    1359896290,
                    1428297954
                ],
                [
                    365154968,
                    1890422124,
                    1015611457
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "PvP has far less options but still some solid options. Instead of different niches within the grand scheme of PvE content, we really have consistency or lethality 2x. Within both you'll find a healthy scoop of stability perks, either Zen Moment, Dynamic Sway Reduction, or Perpetual Motion. Pick your poison there. If you want more consistency on top of your consistency sundae, go for Tap the Trigger. For lethality you can opt for Target Lock, Onslaught, or the tried and true Kill Clip. All options are great but work in different ways, your best option might not be the same as others so give them a try.\nMasterworks: Range"
        },
        {
            "hash": 1292594730,
            "plugs": [
                [
                    839105230
                ],
                [
                    1885400500
                ],
                [
                    2387244414
                ],
                [
                    365154968
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 655712834,
            "plugs": [
                [
                    1482024992
                ],
                [
                    1885400500
                ],
                [
                    776531651
                ],
                [
                    2048641572
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Void mains rejoice. I don't think anyone is surprised to see this pick. Smallbore plus ricochet rounds boosts your stability and range enough to not worry about engagement ranges and compete with auto rifles. The extra overshield and add clearing capabilities will also allow you to allocate different fragments into your builds.\nMasterworks: Reload"
        },
        {
            "hash": 655712834,
            "plugs": [
                [
                    1482024992
                ],
                [
                    1885400500
                ],
                [
                    776531651
                ],
                [
                    2048641572
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 655712834,
            "plugs": [
                [
                    1482024992
                ],
                [
                    1885400500
                ],
                [
                    1359896290
                ],
                [
                    4082225868
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Swashbuckler is really the only standout perk in the fourth column. Some more niche options exist but there's also not really a big pull to use this year's version of the Title for PvP. Rangefinder does help push out your zoom but with the recent changes to rangefinder it's less than stellar.\nMasterworks: Stability"
        },
        {
            "hash": 655712834,
            "plugs": [
                [
                    1482024992
                ],
                [
                    1885400500
                ],
                [
                    1359896290
                ],
                [
                    4082225868
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2465372924,
            "plugs": [
                [
                    839105230,
                    1482024992,
                    4090651448
                ],
                [
                    1087426260,
                    1968497646,
                    3230963543
                ],
                [
                    1168162263,
                    1820235745,
                    3643424744
                ],
                [
                    3891536761,
                    4104185692,
                    1015611457
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Tigerspite is one of those guns that despite not having the best perks, the best stats, or even the best model; something about it feels phenomenal. I enjoy almost every Tigerspite I use, and I am excited to get more of them. Kinetic Tremors, Frenzy, or Kill Clip will depend on your activity and favorite damage boost. Pair it with your favorite reload or reload bypassing perk and you've got a dependable workhorse auto that just feels like bliss.\nMasterworks: Handling"
        },
        {
            "hash": 2465372924,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    1168162263
                ],
                [
                    3891536761
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2465372924,
            "plugs": [
                [
                    3250034553,
                    1482024992,
                    4090651448
                ],
                [
                    1885400500,
                    1561002382
                ],
                [
                    2451262963,
                    588594999,
                    3643424744
                ],
                [
                    1015611457,
                    699525795
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Tigerspite now has a better glow-up for PvP. Fragile Focus is great for starting an engagement but will quickly lose its value the longer you're in a gunfight. Moving Target is neutrally good for providing a better strafe speed and some much needed aim assist. I prefer Kill Clip in the final column to lower my TtK requirements in subsequent kills, but if you're going to take this into Trials or 3v3 game modes, Eye of the Storm might be better for its consistency duel to duel.\nMasterworks: Range"
        },
        {
            "hash": 2465372924,
            "plugs": [
                [
                    3250034553
                ],
                [
                    1885400500
                ],
                [
                    2451262963
                ],
                [
                    1015611457
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1218113510,
            "plugs": [
                [
                    3525010810,
                    3798852852,
                    1441682018
                ],
                [
                    2822142346
                ],
                [
                    968510818,
                    1631667848,
                    923806249
                ],
                [
                    2396489472,
                    3078487919,
                    831391274
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "I believe of the loot refresh, Tusk of the Boar is probably the most exciting. A strand wave frame grenade launcher? Heck yeah. We can grab ourselves an Envious Assassin and Chain Reaction roll for a \"kinetic\" Forbearance. If you're looking for Strand synergy, a better combination would be Slice and Hatchling. You can also just go for a full Bait and Switch loadout with a Tusk of the Boar, Forbearance, and Apex Predator! Look at you go, you fully optimized guardian you.\nMasterworks: Velocity"
        },
        {
            "hash": 1218113510,
            "plugs": [
                [
                    3525010810
                ],
                [
                    2822142346
                ],
                [
                    968510818
                ],
                [
                    2396489472
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1218113510,
            "plugs": [
                [
                    3525010810,
                    3798852852,
                    1441682018
                ],
                [
                    2822142346
                ],
                [
                    3828510309
                ],
                [
                    4082225868,
                    831391274
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "In PvP, Tusk of the Boar doesn't have anything incredible that sets it apart from any other grenade launcher and being Strand limits it from the best grenade launcher perk: Disruption Break. Without Disruption Break I don't see any great use outside of more niche Strand builds.\nMasterworks: Velocity"
        },
        {
            "hash": 1218113510,
            "plugs": [
                [
                    3525010810
                ],
                [
                    2822142346
                ],
                [
                    3828510309
                ],
                [
                    4082225868
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1874424704,
            "plugs": [
                [
                    839105230,
                    1840239774
                ],
                [
                    1087426260,
                    106909392,
                    2420895100
                ],
                [
                    968510818,
                    3436462433,
                    3828510309
                ],
                [
                    1546637391,
                    555281244,
                    4293542123
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Similarly to Retold Tale, Twilight Oath has PvE perks but not the best position. Envious Assassin is great for overfilling the magazine, and Vorpal Weapon will net you great damage. You can utilize the full extent of Precision Instrument, my biggest issue is the frame. Rapid-fire frame snipers are hard to utilize at max RPM and require a hard pull down to keep on target. With the crit box shrinking on some bosses and champions doing what champions want to do, it will be hard to continuously hit crits at max RPM. Otherwise it's a pretty solid general use sniper.\nMasterworks: Reload Speed"
        },
        {
            "hash": 1874424704,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    968510818
                ],
                [
                    1546637391
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1874424704,
            "plugs": [
                [
                    1840239774,
                    839105230
                ],
                [
                    3142289711
                ],
                [
                    47981717,
                    3436462433,
                    2450788523
                ],
                [
                    957782887,
                    4293542123
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "All of the Dreaming City weapons have a special place in my heart. Twilight Oath is no exception, it was the sniper I mained until Revoker came out. I never used a Snapshot Sights and Opening Shot roll, but I think it would be fun. You're going to need to split your stat investments between handling and range to make sure you can feel that 70 aim assist on those longer sightlines.\nMasterworks: Range, Handling"
        },
        {
            "hash": 1874424704,
            "plugs": [
                [
                    1840239774
                ],
                [
                    3142289711
                ],
                [
                    47981717
                ],
                [
                    957782887
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1151688091,
            "plugs": [
                [
                    3525010810,
                    3798852852,
                    1441682018
                ],
                [
                    2822142346
                ],
                [
                    2010801679,
                    1556840489,
                    1583705720
                ],
                [
                    3078487919,
                    2173046394,
                    4049631843
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Forbearance, Salvager's Salvo, or Undercurrent. Which is going to reign supreme? Probably Forbearance. But Undercurrent is a decent attempt. Voltshot isn't as significant as Chain Reaction and only works on the first hit of subsequent shots. Bait and Switch is interesting for keeping up damage but not having a reliable magazine overflow perk hurts a bit more. Ambitious Assassin is great, but Envious is better. Overall I'd say it's a neat addition but you wouldn't be too hurt not having it if you already have Forbearance or Salvo.\nMasterworks: Velocity"
        },
        {
            "hash": 1151688091,
            "plugs": [
                [
                    3525010810
                ],
                [
                    2822142346
                ],
                [
                    2010801679
                ],
                [
                    3078487919
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1151688091,
            "plugs": [
                [
                    3525010810,
                    3798852852,
                    1441682018
                ],
                [
                    2822142346
                ],
                [
                    3523296417
                ],
                [
                    11612903
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Undercurrent in the crucible is a bit under where we need it to be. Explosive Personality is far better as a primer and other grenade launchers will be better for clean ups. Demolitionist and Adrenaline Junkie have synergy together but aren't the best combination to see.\nMasterworks: Velocity"
        },
        {
            "hash": 1151688091,
            "plugs": [
                [
                    3525010810
                ],
                [
                    2822142346
                ],
                [
                    3523296417
                ],
                [
                    11612903
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 672957262,
            "plugs": [
                [
                    3525010810,
                    3798852852,
                    1441682018
                ],
                [
                    2822142346
                ],
                [
                    2010801679,
                    1556840489,
                    1583705720
                ],
                [
                    3078487919,
                    2173046394,
                    4049631843
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Forbearance, Salvager's Salvo, or Undercurrent. Which is going to reign supreme? Probably Forbearance. But Undercurrent is a decent attempt. Voltshot isn't as significant as Chain Reaction and only works on the first hit of subsequent shots. Bait and Switch is interesting for keeping up damage but not having a reliable magazine overflow perk hurts a bit more. Ambitious Assassin is great, but Envious is better. Overall I'd say it's a neat addition but you wouldn't be too hurt not having it if you already have Forbearance or Salvo.\nMasterworks: Velocity"
        },
        {
            "hash": 672957262,
            "plugs": [
                [
                    3525010810
                ],
                [
                    2822142346
                ],
                [
                    2010801679
                ],
                [
                    3078487919
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 672957262,
            "plugs": [
                [
                    3525010810,
                    3798852852,
                    1441682018
                ],
                [
                    2822142346
                ],
                [
                    3523296417
                ],
                [
                    11612903
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Undercurrent in the crucible is a bit under where we need it to be. Explosive Personality is far better as a primer and other grenade launchers will be better for clean ups. Demolitionist and Adrenaline Junkie have synergy together but aren't the best combination to see.\nMasterworks: Velocity"
        },
        {
            "hash": 672957262,
            "plugs": [
                [
                    3525010810
                ],
                [
                    2822142346
                ],
                [
                    3523296417
                ],
                [
                    11612903
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2450917538,
            "plugs": [
                [
                    839105230,
                    1840239774,
                    4090651448
                ],
                [
                    1087426260,
                    106909392,
                    3230963543
                ],
                [
                    1354429876,
                    2284787283,
                    1556840489
                ],
                [
                    1546637391,
                    2610012052,
                    555281244,
                    4293542123
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Uzume RR4 returns to us with some interesting rolls. Fourth Time's the Charm and Vorpal Weapon are going to be your best neutral and solo picks. Golden Tricorn on Solar might be fun for short damage cycles. Precision Instrument is the worst damage perk of the three for me but pairs really well with Fourth Time's the Charm for all the precision hits. Either way you slice it, having a magazine boosting perk is a requirement.\nMasterworks: Reload Speed"
        },
        {
            "hash": 2450917538,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    1354429876
                ],
                [
                    1546637391
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2450917538,
            "plugs": [
                [
                    1840239774,
                    839105230,
                    4090651448
                ],
                [
                    3142289711
                ],
                [
                    957782887
                ],
                [
                    3038247973,
                    1546637391,
                    4293542123
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "In PvP things have shifted a bit, Explosive Payload feels like you have a better hitbox, but doesn't actually provide any benefits other than shooting the floor for some splash damage. Vorpal Weapon allows you to one shot any super, which is helpful for Trials rounds or general PvP super fights. Snapshot Sights and as much handling as you can invest will make this sniper feel extremely strong.\nMasterworks: Handling"
        },
        {
            "hash": 2450917538,
            "plugs": [
                [
                    1840239774
                ],
                [
                    3142289711
                ],
                [
                    957782887
                ],
                [
                    3038247973
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1891996599,
            "plugs": [
                [
                    839105230,
                    1840239774,
                    4090651448
                ],
                [
                    1087426260,
                    106909392,
                    3230963543
                ],
                [
                    1354429876,
                    2284787283,
                    1556840489
                ],
                [
                    1546637391,
                    2610012052,
                    555281244,
                    4293542123
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Uzume RR4 returns to us with some interesting rolls. Fourth Time's the Charm and Vorpal Weapon are going to be your best neutral and solo picks. Golden Tricorn on Solar might be fun for short damage cycles. Precision Instrument is the worst damage perk of the three for me but pairs really well with Fourth Time's the Charm for all the precision hits. Either way you slice it, having a magazine boosting perk is a requirement.\nMasterworks: Reload Speed"
        },
        {
            "hash": 1891996599,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    1354429876
                ],
                [
                    1546637391
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1891996599,
            "plugs": [
                [
                    1840239774,
                    839105230,
                    4090651448
                ],
                [
                    3142289711
                ],
                [
                    957782887
                ],
                [
                    3038247973,
                    1546637391,
                    4293542123
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "In PvP things have shifted a bit, Explosive Payload feels like you have a better hitbox, but doesn't actually provide any benefits other than shooting the floor for some splash damage. Vorpal Weapon allows you to one shot any super, which is helpful for Trials rounds or general PvP super fights. Snapshot Sights and as much handling as you can invest will make this sniper feel extremely strong.\nMasterworks: Handling"
        },
        {
            "hash": 1891996599,
            "plugs": [
                [
                    1840239774
                ],
                [
                    3142289711
                ],
                [
                    957782887
                ],
                [
                    3038247973
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 839344841,
            "plugs": [
                [
                    2801223209,
                    852209214,
                    4067834857
                ],
                [
                    3429800428,
                    3827198035
                ],
                [
                    201365942,
                    3365897133,
                    3828510309
                ],
                [
                    555281244,
                    2652708987,
                    831391274
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "I'm happy for more variants of weapons. Vengeful Whisper being a strand bow opens up some loadout flexibility and covers your strand subclass verbs. It's less useful without Match Game but it can still be useful for taking out shields faster. Archer's Tempo is fantastic on bows for lowering successive draw times, and Precision Instrument fits nicely as you'll want to hit those crits, the draw time allowing you a bit of forgiveness lining up those crit shots. You could even switch it up and go with Explosive Payload and Successful Warm-Up if you're using this in lower and PvE where you can one shot everything to keep Successful Warm-Up going.\nMasterworks: Draw Time"
        },
        {
            "hash": 839344841,
            "plugs": [
                [
                    2801223209
                ],
                [
                    3429800428
                ],
                [
                    201365942
                ],
                [
                    555281244
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 839344841,
            "plugs": [
                [
                    2801223209,
                    852209214,
                    4067834857
                ],
                [
                    3429800428,
                    3827198035
                ],
                [
                    3365897133,
                    201365942,
                    3619207468
                ],
                [
                    2652708987,
                    3324494224
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "In the crucible I don't think you'll find as much success. Vengeful Whisper does have Explosive Head for better flinch and AoE but I find bow swapping a bit easier with a handling perk like Shot Swap or even Perpetual Motion. If you're not bow swapping I prefer Archer's Tempo or Rapid Hit for better follow up shots. Successful Warm-Up is great but only works after your first kill.\nMasterworks: Draw Time"
        },
        {
            "hash": 839344841,
            "plugs": [
                [
                    2801223209
                ],
                [
                    3429800428
                ],
                [
                    3365897133
                ],
                [
                    2652708987
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 355922321,
            "plugs": [
                [
                    839105230,
                    4090651448
                ],
                [
                    1087426260,
                    106909392,
                    3230963543
                ],
                [
                    247725512,
                    1354429876,
                    776531651
                ],
                [
                    3038247973,
                    2610012052,
                    2048641572
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Vouchsafe returns but has lost a bit of its edge. It used to be a really good void scout, comparable to Night Watch. And while Night Watch has still kept some of its relevance over the years, Doom of Chelchis has overtaken Vouchsafe for the best in slot weapon. Vouchsafe does retain some great perks in Rapid Hit and Explosive Payload, while also adding in great perks like Repulsor Brace and Golden Tricorn. It might not be the ultimate best weapon, but it also doesn't require any raiding.\nMasterworks: Stability"
        },
        {
            "hash": 355922321,
            "plugs": [
                [
                    839105230
                ],
                [
                    1087426260
                ],
                [
                    247725512
                ],
                [
                    3038247973
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 355922321,
            "plugs": [
                [
                    839105230,
                    3661387068
                ],
                [
                    3177308360,
                    3230963543
                ],
                [
                    247725512,
                    588594999
                ],
                [
                    3038247973
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Lightweight frames in PvP are in an interesting spot. They don't kill fast enough to be competitive, and any boosts don't really elevate the weapon further. Golden Tricorn 2x does allow you to 3 shot any guardian at any resilience at a 0.60 TtK, but it requires two whole kills to get rolling and without additional ability kills you'll be back at square one before you know it. Taraxippos and Eternal Blazon with Kill Clip or even Tarnished Mettle with Swashbuckler allow you to 3 crit after just one kill.\nMasterworks: Stability"
        },
        {
            "hash": 355922321,
            "plugs": [
                [
                    839105230
                ],
                [
                    3177308360
                ],
                [
                    247725512
                ],
                [
                    3038247973
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 3723679465,
            "plugs": [
                [
                    1840239774,
                    1482024992,
                    4090651448
                ],
                [
                    1087426260,
                    1968497646,
                    3230963543
                ],
                [
                    247725512,
                    968510818,
                    1428297954
                ],
                [
                    2173046394,
                    2848615171,
                    1015611457
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Let's talk about power creep. When Waking Vigil released it was a phenomenal arc hand cannon. Outclassed by Nation of Beasts for the best arc hand cannon. With its midlife refresh Waking Vigil was blessed with a reload perk and an AoE perk through Dragonfly. However it was still overshadowed by Nation of Beasts and by then Ancient Gospel. When the hand cannon merger happened, Waking Vigil lost its only claim to fame being a Lightweight hand cannon versus the aforementioned adaptives. While we still have some great perks going on currently, Waking Vigil is just a relic from the past.\nMasterworks: Handling"
        },
        {
            "hash": 3723679465,
            "plugs": [
                [
                    1840239774
                ],
                [
                    1087426260
                ],
                [
                    247725512
                ],
                [
                    2173046394
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 3723679465,
            "plugs": [
                [
                    3250034553,
                    1482024992,
                    1840239774
                ],
                [
                    1885400500,
                    1561002382
                ],
                [
                    247725512,
                    1428297954,
                    2846385770
                ],
                [
                    47981717,
                    1015611457
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Waking Vigil used to be one of the most coveted energy hand cannons. A slimline model, access to Rangefinder and Opening Shot together to have an energy Dire Promise. Current form is a little less than stellar due to the lack of Slideshot, but it still retains the OG roll if you still care about Rangefinder.\nMasterworks: Range"
        },
        {
            "hash": 3723679465,
            "plugs": [
                [
                    3250034553
                ],
                [
                    1885400500
                ],
                [
                    247725512
                ],
                [
                    47981717
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1332123064,
            "plugs": [
                [
                    3525010810,
                    3798852852,
                    1441682018
                ],
                [
                    3032599245,
                    3301904089,
                    2822142346
                ],
                [
                    968510818,
                    3108830275,
                    960810156
                ],
                [
                    4293542123,
                    4049631843,
                    3708227201
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "I am glad to see more obtainable double-fire grenade launchers. Wilderflight is great, but being locked behind a dungeon means most players won't even see it drop. Being a Vanguard reward allows more players to obtain it, and I love that as the double-fire is a very fun and interesting option within our ever-expanding arsenal. For PvE you're looking for the tried and true Envious Assassin, this paired with Incandescent will clear rooms and deal some great damage against bosses. Unrelenting is a great option if you're committing to using Wild Style as your main weapon, the extra healing plus synergy with Solar verbs will make you unkillable.\nMasterworks: Blast Radius"
        },
        {
            "hash": 1332123064,
            "plugs": [
                [
                    3525010810
                ],
                [
                    3032599245
                ],
                [
                    968510818
                ],
                [
                    4293542123
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1332123064,
            "plugs": [
                [
                    3525010810,
                    3798852852,
                    1441682018
                ],
                [
                    3032599245,
                    2822142346
                ],
                [
                    3619207468,
                    3828510309
                ],
                [
                    4293542123,
                    3324494224
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Wild Style and by extension all double-fire grenade launchers have one limiting factor, and that is that it fires two shots at once. If your one grenade bounces away you lose half your damage. With Bungie's architecture it happens more often than not. Disorienting Grenades will allow you to still blind even if one goes away, and High-Velocity Rounds will keep your arc tighter to make bounces less punishing (if you're not purposefully bouncing shots).\nMasterworks: Blast Radius"
        },
        {
            "hash": 1332123064,
            "plugs": [
                [
                    3525010810
                ],
                [
                    3032599245
                ],
                [
                    3619207468
                ],
                [
                    4293542123
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 959037361,
            "plugs": [
                [
                    3525010810,
                    3798852852,
                    1441682018
                ],
                [
                    3032599245,
                    3301904089,
                    2822142346
                ],
                [
                    968510818,
                    3108830275,
                    960810156
                ],
                [
                    4293542123,
                    4049631843,
                    3708227201
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "I am glad to see more obtainable double-fire grenade launchers. Wilderflight is great, but being locked behind a dungeon means most players won't even see it drop. Being a Vanguard reward allows more players to obtain it, and I love that as the double-fire is a very fun and interesting option within our ever-expanding arsenal. For PvE you're looking for the tried and true Envious Assassin, this paired with Incandescent will clear rooms and deal some great damage against bosses. Unrelenting is a great option if you're committing to using Wild Style as your main weapon, the extra healing plus synergy with Solar verbs will make you unkillable.\nMasterworks: Blast Radius"
        },
        {
            "hash": 959037361,
            "plugs": [
                [
                    3525010810
                ],
                [
                    3032599245
                ],
                [
                    968510818
                ],
                [
                    4293542123
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 959037361,
            "plugs": [
                [
                    3525010810,
                    3798852852,
                    1441682018
                ],
                [
                    3032599245,
                    2822142346
                ],
                [
                    3619207468,
                    3828510309
                ],
                [
                    4293542123,
                    3324494224
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Wild Style and by extension all double-fire grenade launchers have one limiting factor, and that is that it fires two shots at once. If your one grenade bounces away you lose half your damage. With Bungie's architecture it happens more often than not. Disorienting Grenades will allow you to still blind even if one goes away, and High-Velocity Rounds will keep your arc tighter to make bounces less punishing (if you're not purposefully bouncing shots).\nMasterworks: Blast Radius"
        },
        {
            "hash": 959037361,
            "plugs": [
                [
                    3525010810
                ],
                [
                    3032599245
                ],
                [
                    3619207468
                ],
                [
                    4293542123
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 2910326942,
            "plugs": [
                [
                    2801223209,
                    852209214,
                    4067834857
                ],
                [
                    3429800428,
                    3827198035,
                    3311977193
                ],
                [
                    2799667909
                ],
                [
                    3917450714,
                    862848869
                ],
                [
                    372672208,
                    372672211,
                    372672210
                ]
            ],
            "tags": [
                "PVE"
            ]
        },
        {
            "hash": 2910326942,
            "plugs": [
                [
                    2801223209
                ],
                [
                    3429800428
                ],
                [
                    2799667909
                ],
                [
                    3917450714
                ],
                [
                    372672208
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 2910326942,
            "plugs": [
                [
                    2801223209,
                    852209214,
                    4067834857
                ],
                [
                    3429800428,
                    3827198035,
                    3311977193
                ],
                [
                    2799667909
                ],
                [
                    3917450714,
                    862848869
                ],
                [
                    372672211,
                    372672210
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "hash": 2910326942,
            "plugs": [
                [
                    2801223209
                ],
                [
                    3429800428
                ],
                [
                    2799667909
                ],
                [
                    3917450714
                ],
                [
                    372672211
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        },
        {
            "hash": 1911078836,
            "plugs": [
                [
                    938542991
                ],
                [
                    269888150
                ],
                [
                    3705817207
                ],
                [
                    3650930298
                ]
            ],
            "tags": [
                "PVE"
            ],
            "description": "Cold Steel is Zephyr's claim to fame. Zephyr is the only sword with Cold Steel and you'll want to stack as many charge time benefits as possible. Duelist's Trance grants +60 to charge rate and both Guard Resistance and Endurance. This all allows you to heavy swing more frequently. Stacking the extra slow debuff faster. Tempered Edge also gives you more ammo while adding more impact as well. Dealing better damage is always good.\nMasterworks: Impact"
        },
        {
            "hash": 1911078836,
            "plugs": [
                [
                    938542991
                ],
                [
                    269888150
                ],
                [
                    3705817207
                ],
                [
                    3650930298
                ]
            ],
            "tags": [
                "GodPVE"
            ]
        },
        {
            "hash": 1911078836,
            "plugs": [
                [
                    3666208348
                ],
                [
                    3625355092
                ],
                [
                    2590710093
                ],
                [
                    2396489472
                ]
            ],
            "tags": [
                "PVP"
            ],
            "description": "Zephyr was one of my favorite swords when it was introduced in season 2. I still think it looks incredible. In PvP you'll want some good guard resistance so you can get close and if you happen to have multiple enemies stacked up you can get Chain Reaction kills. More booms equals better, no?\nMasterworks: Impact"
        },
        {
            "hash": 1911078836,
            "plugs": [
                [
                    3666208348
                ],
                [
                    3625355092
                ],
                [
                    2590710093
                ],
                [
                    2396489472
                ]
            ],
            "tags": [
                "GodPVP"
            ]
        }
    ]
}